#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;       Use native low precision
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 57e11a555f7866bd13948fe7f97693e9.pdb
; shader hash: 57e11a555f7866bd13948fe7f97693e9
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(8,8,1)
;
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; colorIn                               UAV     f32          2d      U0             u0     1
; colorOut                              UAV     f16          2d      U1             u1     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:8-i16:16-i32:32-i64:64-f16:16-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }
%dx.types.ResBind = type { i32, i32, i32, i8 }
%dx.types.ResourceProperties = type { i32, i32 }
%dx.types.Dimensions = type { i32, i32, i32, i32 }
%dx.types.ResRet.f32 = type { float, float, float, float, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !35, globals: !69)
!1 = !DIFile(filename: "denoise.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !25, !29}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 84, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 84, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 84, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 143, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 143, size: 64, align: 16, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 143, baseType: !18, size: 16, align: 16, flags: DIFlagPublic)
!18 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 143, baseType: !18, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 143, baseType: !18, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 143, baseType: !18, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 108, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 108, size: 96, align: 32, elements: !27, templateParams: !32)
!27 = !{!28, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 108, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 108, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 108, baseType: !29, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!33, !34}
!33 = !DITemplateTypeParameter(name: "element", type: !29)
!34 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!35 = !{!36, !46, !49, !63, !66}
!36 = !DISubprogram(name: "Denoise", scope: !1, file: !1, line: 82, type: !37, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @Denoise)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!11, !34}
!46 = !DISubprogram(name: "blur", linkageName: "\01?blur@@YA?AV?$vector@M$02@@V?$vector@I$01@@0@Z", scope: !1, file: !1, line: 47, type: !47, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!25, !4, !4}
!49 = !DISubprogram(name: "shouldBlur", linkageName: "\01?shouldBlur@@YA_NUHitInfo@@V?$vector@I$01@@1I@Z", scope: !1, file: !1, line: 36, type: !50, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !53, !4, !4, !62}
!52 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "HitInfo", file: !54, line: 40, size: 64, align: 32, elements: !55)
!54 = !DIFile(filename: "./shared.h", directory: "")
!55 = !{!56, !58, !59, !60, !61}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "instanceID", scope: !53, file: !54, line: 42, baseType: !57, size: 24, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1, line: 5, baseType: !8)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "matID", scope: !53, file: !54, line: 43, baseType: !57, size: 8, align: 32, offset: 24)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "geometryIndex", scope: !53, file: !54, line: 44, baseType: !57, size: 24, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "didRefraction", scope: !53, file: !54, line: 45, baseType: !57, size: 1, align: 32, offset: 56)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "padd0", scope: !53, file: !54, line: 46, baseType: !57, size: 7, align: 32, offset: 57)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 98, baseType: !8)
!63 = !DISubprogram(name: "inBounds", linkageName: "\01?inBounds@@YA_NV?$vector@I$01@@0@Z", scope: !1, file: !1, line: 13, type: !64, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!52, !4, !4}
!66 = !DISubprogram(name: "getGausianVal", linkageName: "\01?getGausianVal@@YAIV?$vector@I$01@@@Z", scope: !1, file: !1, line: 18, type: !67, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false)
!67 = !DISubroutineType(types: !68)
!68 = !{!62, !4}
!69 = !{!70, !81, !85, !89}
!70 = !DIGlobalVariable(name: "colorIn", linkageName: "\01?colorIn@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 4, size: 128, align: 32, elements: !2, templateParams: !72)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "element", type: !74)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 4, size: 128, align: 32, elements: !75, templateParams: !80)
!75 = !{!76, !77, !78, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !74, file: !1, line: 4, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !74, file: !1, line: 4, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !74, file: !1, line: 4, baseType: !29, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !74, file: !1, line: 4, baseType: !29, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!80 = !{!33, !24}
!81 = !DIGlobalVariable(name: "hitInfo", linkageName: "\01?hitInfo@@3V?$StructuredBuffer@UHitInfo@@@@A", scope: !0, file: !1, line: 5, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<HitInfo>", file: !1, line: 5, size: 64, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !53)
!85 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 6, type: !86, isLocal: false, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 6, size: 64, align: 16, elements: !2, templateParams: !87)
!87 = !{!88}
!88 = !DITemplateTypeParameter(name: "element", type: !15)
!89 = !DIGlobalVariable(name: "gaussian", scope: !66, file: !1, line: 20, type: !90, isLocal: true, isDefinition: true, variable: [5 x i32]* @"\01?gaussian@?1??getGausianVal@@YAIV?$vector@I$01@@@Z@3QBIB")
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 160, align: 32, elements: !92)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!92 = !{!93}
!93 = !DISubrange(count: 5)
!94 = !{i32 2, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
