#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       64-Bit integer
;       Raytracing tier 1.1 features
;
; shader debug name: 93bf40d6f8982ca2587e112f20638788.pdb
; shader hash: 93bf40d6f8982ca2587e112f20638788
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;           uint frameNumber;                         ; Offset:   32
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;           float3 norm;                              ; Offset:   12
;           uint diffuseTextureIdx;                   ; Offset:   24
;           uint normalTextureIdx;                    ; Offset:   28
;           uint specularTextureIdx;                  ; Offset:   32
;           uint metalicTextureIdx;                   ; Offset:   36

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !88, globals: !202)
!1 = !DIFile(filename: "raytrace.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !6, !15, !22, !31, !40, !62, !77, !84, !86}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 9, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 9, size: 96, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !10, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !5)
!14 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 3)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 60, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 60, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 60, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 60, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!13, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 98, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 98, size: 48, align: 16, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 98, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 98, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 98, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !14}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 130, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 130, size: 128, align: 32, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 130, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 130, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 130, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 130, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 153, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 153, size: 512, align: 32, elements: !42, templateParams: !59)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !41, file: !1, line: 153, baseType: !5, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!59 = !{!13, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 4)
!61 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 4)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 181, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 181, size: 288, align: 32, elements: !64, templateParams: !74)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !63, file: !1, line: 181, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!74 = !{!13, !75, !76}
!75 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 3)
!76 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 3)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 220, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 220, size: 64, align: 32, elements: !79, templateParams: !82)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !1, line: 220, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !1, line: 220, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !{!83, !21}
!83 = !DITemplateTypeParameter(name: "element", type: !4)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 115, baseType: !85)
!85 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 17, baseType: !87)
!87 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!88 = !{!89, !93, !96, !99, !102, !105, !106, !109, !115, !118, !121, !140, !143, !157, !170, !173, !176, !182, !183, !184, !185, !186, !187, !188, !198, !199}
!89 = !DISubprogram(name: "Xchi", linkageName: "\01?Xchi@@YAMM@Z", scope: !90, file: !90, line: 4, type: !91, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DIFile(filename: "./CookTorrance.hlsl", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!5, !5}
!93 = !DISubprogram(name: "D", linkageName: "\01?D@@YAMV?$vector@M$02@@00M@Z", scope: !90, file: !90, line: 11, type: !94, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!5, !6, !6, !6, !5}
!96 = !DISubprogram(name: "fDialectric", linkageName: "\01?fDialectric@@YAMMMV?$vector@M$02@@0@Z", scope: !90, file: !90, line: 24, type: !97, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!5, !5, !5, !6, !6}
!99 = !DISubprogram(name: "fresnelSchlick", linkageName: "\01?fresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !90, file: !90, line: 33, type: !100, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!6, !5, !6}
!102 = !DISubprogram(name: "fConductor", linkageName: "\01?fConductor@@YAMMV?$vector@M$02@@0@Z", scope: !90, file: !90, line: 40, type: !103, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!5, !5, !6, !6}
!105 = !DISubprogram(name: "Gp", linkageName: "\01?Gp@@YAMV?$vector@M$02@@00M@Z", scope: !90, file: !90, line: 50, type: !94, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubprogram(name: "G", linkageName: "\01?G@@YAMV?$vector@M$02@@000M@Z", scope: !90, file: !90, line: 60, type: !107, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubroutineType(types: !108)
!108 = !{!5, !6, !6, !6, !6, !5}
!109 = !DISubprogram(name: "CookTorance", linkageName: "\01?CookTorance@@YA?AV?$vector@M$02@@V1@00MV1@AIAV1@@Z", scope: !90, file: !90, line: 66, type: !110, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!110 = !DISubroutineType(types: !111)
!111 = !{!6, !6, !6, !6, !5, !112, !113}
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !6)
!115 = !DISubprogram(name: "numTriangles", linkageName: "\01?numTriangles@@YAIXZ", scope: !1, file: !1, line: 41, type: !116, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubroutineType(types: !117)
!117 = !{!84}
!118 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 49, type: !119, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!119 = !DISubroutineType(types: !120)
!120 = !{null}
!121 = !DISubprogram(name: "doTransform", linkageName: "\01?doTransform@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$02@@@Z", scope: !1, file: !1, line: 149, type: !122, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{!6, !6, !124}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 147, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 147, size: 384, align: 32, elements: !126, templateParams: !139)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !125, file: !1, line: 147, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!139 = !{!13, !60, !76}
!140 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 167, type: !141, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!141 = !DISubroutineType(types: !142)
!142 = !{!6, !15}
!143 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 207, type: !144, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146}
!146 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !148, line: 30, size: 256, align: 32, elements: !149)
!148 = !DIFile(filename: "./shared.h", directory: "")
!149 = !{!150, !151, !152, !153, !155, !156}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !147, file: !148, line: 32, baseType: !6, size: 96, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !147, file: !148, line: 33, baseType: !84, size: 32, align: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !147, file: !148, line: 34, baseType: !6, size: 96, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !147, file: !148, line: 35, baseType: !154, size: 30, align: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1, line: 97, baseType: !85)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "recordHit", scope: !147, file: !148, line: 36, baseType: !154, size: 1, align: 32, offset: 254)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "insideGlass", scope: !147, file: !148, line: 37, baseType: !154, size: 1, align: 32, offset: 255)
!157 = !DISubprogram(name: "getColor", linkageName: "\01?getColor@@YA?AV?$vector@M$02@@UMaterial@@V1@@Z", scope: !1, file: !1, line: 214, type: !158, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: false)
!158 = !DISubroutineType(types: !159)
!159 = !{!6, !160, !6}
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !148, line: 70, size: 384, align: 32, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !160, file: !148, line: 72, baseType: !6, size: 96, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "smooth", scope: !160, file: !148, line: 73, baseType: !5, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !160, file: !148, line: 74, baseType: !6, size: 96, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !160, file: !148, line: 75, baseType: !5, size: 32, align: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !160, file: !148, line: 76, baseType: !5, size: 32, align: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ior", scope: !160, file: !148, line: 77, baseType: !5, size: 32, align: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "metal", scope: !160, file: !148, line: 78, baseType: !5, size: 32, align: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "indicator", scope: !160, file: !148, line: 79, baseType: !84, size: 32, align: 32, offset: 352)
!170 = !DISubprogram(name: "generateNewRayDir", linkageName: "\01?generateNewRayDir@@YA?AV?$vector@M$02@@V1@0@Z", scope: !1, file: !1, line: 237, type: !171, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false)
!171 = !DISubroutineType(types: !172)
!172 = !{!6, !6, !6}
!173 = !DISubprogram(name: "UnifiedShading", linkageName: "\01?UnifiedShading@@YAXURayPayload@@UMaterial@@IV?$vector@M$01@@@Z", scope: !1, file: !1, line: 264, type: !174, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !146, !160, !84, !15}
!176 = !DISubprogram(name: "ch_white", linkageName: "\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 389, type: !177, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!177 = !DISubroutineType(types: !178)
!178 = !{null, !146, !179}
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 385, size: 64, align: 32, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !179, file: !1, line: 385, baseType: !16, size: 64, align: 32)
!182 = !DISubprogram(name: "ch_shinyred", linkageName: "\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 405, type: !177, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!183 = !DISubprogram(name: "ch_light", linkageName: "\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 421, type: !177, isLocal: false, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!184 = !DISubprogram(name: "ch_metal", linkageName: "\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 437, type: !177, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!185 = !DISubprogram(name: "ch_mirror", linkageName: "\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 453, type: !177, isLocal: false, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!186 = !DISubprogram(name: "ch_checkered", linkageName: "\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 469, type: !177, isLocal: false, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!187 = !DISubprogram(name: "ch_glass", linkageName: "\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 485, type: !177, isLocal: false, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!188 = !DISubprogram(name: "randFloat0505", linkageName: "\01?randFloat0505@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 35, type: !189, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false)
!189 = !DISubroutineType(types: !190)
!190 = !{!5, !191}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 58, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 58, size: 64, align: 32, elements: !193, templateParams: !196)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !192, file: !1, line: 58, baseType: !85, size: 32, align: 32, flags: DIFlagPublic)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !192, file: !1, line: 58, baseType: !85, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!196 = !{!197, !21}
!197 = !DITemplateTypeParameter(name: "element", type: !85)
!198 = !DISubprogram(name: "randFloat01", linkageName: "\01?randFloat01@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 25, type: !189, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false)
!199 = !DISubprogram(name: "MWC64X", linkageName: "\01?MWC64X@@YAIV?$vector@I$01@@@Z", scope: !1, file: !1, line: 15, type: !200, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!200 = !DISubroutineType(types: !201)
!201 = !{!84, !191}
!202 = !{!203, !205, !216, !220, !224, !235, !237}
!203 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 105, type: !204, isLocal: true, isDefinition: true, variable: i32 1)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!205 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 8, type: !206, isLocal: false, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !207)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !148, line: 21, size: 288, align: 32, elements: !210)
!210 = !{!211, !212, !213, !214, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !209, file: !148, line: 23, baseType: !6, size: 96, align: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !209, file: !148, line: 24, baseType: !5, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !209, file: !148, line: 25, baseType: !6, size: 96, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !209, file: !148, line: 26, baseType: !5, size: 32, align: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "frameNumber", scope: !209, file: !148, line: 27, baseType: !84, size: 32, align: 32, offset: 256)
!216 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 9, type: !217, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!217 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 9, size: 128, align: 32, elements: !2, templateParams: !218)
!218 = !{!219}
!219 = !DITemplateTypeParameter(name: "element", type: !32)
!220 = !DIGlobalVariable(name: "randBuff", linkageName: "\01?randBuff@@3V?$RWTexture2D@_K@@A", scope: !0, file: !1, line: 10, type: !221, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?randBuff@@3V?$RWTexture2D@_K@@A")
!221 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned long long>", file: !1, line: 10, size: 64, align: 64, elements: !2, templateParams: !222)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "element", type: !87)
!224 = !DIGlobalVariable(name: "hitInfo", linkageName: "\01?hitInfo@@3V?$RWStructuredBuffer@UHitInfo@@@@A", scope: !0, file: !1, line: 11, type: !225, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?hitInfo@@3V?$RWStructuredBuffer@UHitInfo@@@@A")
!225 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<HitInfo>", file: !1, line: 11, size: 64, align: 32, elements: !2, templateParams: !226)
!226 = !{!227}
!227 = !DITemplateTypeParameter(name: "element", type: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "HitInfo", file: !148, line: 40, size: 64, align: 32, elements: !229)
!229 = !{!230, !231, !232, !233, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "instanceID", scope: !228, file: !148, line: 42, baseType: !154, size: 24, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "matID", scope: !228, file: !148, line: 43, baseType: !154, size: 8, align: 32, offset: 24)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "geometryIndex", scope: !228, file: !148, line: 44, baseType: !154, size: 24, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "didRefraction", scope: !228, file: !148, line: 45, baseType: !154, size: 1, align: 32, offset: 56)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "padd0", scope: !228, file: !148, line: 46, baseType: !154, size: 7, align: 32, offset: 57)
!235 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 12, type: !236, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 12, size: 32, align: 32, elements: !2)
!237 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 13, type: !238, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 1248, align: 32, elements: !259)
!239 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 13, size: 1248, align: 32, elements: !2, templateParams: !240)
!240 = !{!241}
!241 = !DITemplateTypeParameter(name: "element", type: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !148, line: 64, size: 1248, align: 32, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !242, file: !148, line: 66, baseType: !245, size: 1248, align: 32)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1248, align: 32, elements: !257)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !148, line: 50, size: 416, align: 32, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !246, file: !148, line: 52, baseType: !6, size: 96, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !246, file: !148, line: 53, baseType: !6, size: 96, align: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "diffuseTextureIdx", scope: !246, file: !148, line: 54, baseType: !84, size: 32, align: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "normalTextureIdx", scope: !246, file: !148, line: 55, baseType: !84, size: 32, align: 32, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "specularTextureIdx", scope: !246, file: !148, line: 56, baseType: !84, size: 32, align: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "metalicTextureIdx", scope: !246, file: !148, line: 57, baseType: !84, size: 32, align: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "roughnessTextureIdx", scope: !246, file: !148, line: 58, baseType: !84, size: 32, align: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alphaTextureIdx", scope: !246, file: !148, line: 59, baseType: !84, size: 32, align: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "emmisiveTextureIdx", scope: !246, file: !148, line: 60, baseType: !84, size: 32, align: 32, offset: 384)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !{!260}
!260 = !DISubrange(count: 1)
!261 = !{i32 2, !"Dwarf Version", i32 4}
!262 = !{i32 2, !"Debug Info Version", i32 3}
!263 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!264 = !{!"raytrace.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A#include \22CookTorrance.hlsl\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>         constants  : register(b0);\0D\0Agloballycoherent RWTexture2D<float4>         colorOut   : register(u0);\0D\0Agloballycoherent RWTexture2D<uint64_t>       randBuff   : register(u1);\0D\0Agloballycoherent RWStructuredBuffer<HitInfo> hitInfo    : register(u2);\0D\0ARaytracingAccelerationStructure              scene      : register(t0);\0D\0AStructuredBuffer<Tringle>                    geomdata[] : register(t1);\0D\0A\0D\0Ainline uint MWC64X(in uint2 pixelID)\0D\0A{\0D\0A    uint64_t state = randBuff[pixelID];\0D\0A    uint c = uint((state) >> 32);\0D\0A    uint x = uint((state) & 0xFFFFFFFF);\0D\0A    state = uint64_t(x * ((uint64_t) 4294883355U) + c);\0D\0A    randBuff[pixelID] = state;\0D\0A    return x ^ c;\0D\0A}\0D\0A\0D\0Ainline float randFloat01(in uint2 pixelID)\0D\0A{\0D\0A    //return 0.5;\0D\0A    return (float(MWC64X(pixelID)) / float(0xFFFFFFFF));\0D\0A}\0D\0Ainline float randFloat11(in uint2 pixelID)\0D\0A{\0D\0A    return (randFloat01(pixelID) * 2.0) - 1.0;\0D\0A}\0D\0A\0D\0Ainline float randFloat0505(in uint2 pixelID)\0D\0A{\0D\0A    return (randFloat01(pixelID)) - 0.5;\0D\0A}\0D\0A\0D\0A//Don't use this if it's a procedural geometry\0D\0Auint numTriangles()\0D\0A{\0D\0A    uint numtris, stride;\0D\0A    geomdata[NonUniformResourceIndex(InstanceID())].GetDimensions(numtris, stride);\0D\0A    return numtris/2;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(forward, right);\0D\0A     \0D\0A    uint2 pixelID = NonUniformResourceIndex(DispatchRaysIndex()).xy;\0D\0A    uint2 dims = NonUniformResourceIndex(DispatchRaysDimensions()).xy;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A\0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A    RayDesc ray;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.Origin = pos;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A\0D\0A\0D\0A    // for(uint i = 0; i < NUM_SAMPLES; i++)\0D\0A    // {\0D\0A    // const uint loBits = (uint32_t)(randBuff[pixelID]&0xFFFFFFFF);\0D\0A    // const uint hiBits = (uint32_t)((randBuff[pixelID]>>32)&0xFFFFFFFF);\0D\0A    // const float loFloat = (((float)loBits)/((float)0xFFFFFFFF));\0D\0A    // const float hiFloat = (((float)hiBits)/((float)0xFFFFFFFF));\0D\0A    // colorOut[pixelID].x = (float16_t) hiFloat;\0D\0A    // colorOut[pixelID].y = (float16_t) loFloat;\0D\0A    // colorOut[pixelID].z = 0.1f;\0D\0A    //return;\0D\0A    float3 accum = float3(0, 0, 0);\0D\0A\0D\0A//center ray for consistency\0D\0A    {\0D\0A        float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A        ray.Direction = normalize(lookAtPoint - pos);\0D\0A\0D\0A        RayPayload payload = (RayPayload)0;\0D\0A        payload.mask = float16_t3(1.0, 1.0, 1.0);\0D\0A        payload.layer = 0; //why doesn't the api provide a layer ugh\0D\0A        payload.accum = float16_t3(0.0, 0.0, 0.0);\0D\0A        payload.insideGlass = 0;\0D\0A        payload.recordHit = 1;\0D\0A        payload.padd = 0;\0D\0A\0D\0A        TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A        // //TODO: this clamp being required means somethign is *wrong*\0D\0A        accum += clamp(payload.accum, float3(0, 0, 0), float3(1, 1, 1));\0D\0A    }\0D\0A//the rest of the samples\0D\0A    for(uint i = 1; i < NUM_SAMPLES; i++)\0D\0A    {\0D\0A        float3 fuzzyLookAtPoint = centerOfPlane + (right * offsetFromCenter.x + randFloat0505(pixelID)) + (up * offsetFromCenter.y + randFloat0505(pixelID));\0D\0A        ray.Direction = normalize(fuzzyLookAtPoint - pos);\0D\0A\0D\0A        RayPayload payload = (RayPayload)0;\0D\0A        payload.mask = float16_t3(1.0, 1.0, 1.0);\0D\0A        payload.layer = 0; //why doesn't the api provide a layer ugh\0D\0A        payload.accum = float16_t3(0.0, 0.0, 0.0);\0D\0A        payload.insideGlass = 0;\0D\0A        payload.recordHit = 0;\0D\0A        payload.padd = 0;\0D\0A\0D\0A        TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    // //TODO: this clamp being required means somethign is *wrong*\0D\0A        accum += clamp(payload.accum, float3(0, 0, 0), float3(1, 1, 1));\0D\0A        //accum += payload.accum;\0D\0A    }\0D\0A    accum /= float3(NUM_SAMPLES, NUM_SAMPLES, NUM_SAMPLES);\0D\0A\0D\0A    colorOut[pixelID] = float4(accum, 1.0);\0D\0A\0D\0A    // if(constants.frameNumber % NUM_SAMPLES == 0)\0D\0A    // {\0D\0A    //     colorOut[pixelID] = float16_t4(0, 0, 0, 1);\0D\0A    // }\0D\0A    // //TODO: this clamp being required means somethign is *wrong*\0D\0A    // float3 sampl3 = clamp(payload.accum, float3(0, 0, 0), float3(1, 1, 1)) / float(NUM_SAMPLES);\0D\0A    // colorOut[pixelID] += float16_t4(sampl3.x, sampl3.y, sampl3.z, 0.0);\0D\0A    // colorOut[pixelID].w = 1.0;\0D\0A    // }\0D\0A\0D\0A    \0D\0A    \0D\0A    //payload.accum.b = float(payload.layer) / float(MAX_RECURSION_LAYERS);\0D\0A    \0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A}\0D\0A\0D\0Afloat3 doTransform(float3 vec3, float4x3 mat4x3)\0D\0A{\0D\0A    float4 vec4 = float4(vec3.x, vec3.y, vec3.z, 1.0);\0D\0A\0D\0A    float4x4 mat4x4 = float4x4(\0D\0A        mat4x3[0][0],mat4x3[0][1], mat4x3[0][2], 0,\0D\0A        mat4x3[1][0],mat4x3[1][1], mat4x3[1][2], 0,\0D\0A        mat4x3[2][0],mat4x3[2][1], mat4x3[2][2], 0,\0D\0A        mat4x3[3][0],mat4x3[3][1], mat4x3[3][2], 1\0D\0A    );\0D\0A    mat4x4 = transpose(mat4x4);\0D\0A\0D\0A    float4 retVal = mul(vec4, mat4x4);\0D\0A\0D\0A    return retVal.xyz;\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal(float2 bary)\0D\0A{\0D\0A    //uint offset = numTriangles();\0D\0A    Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float baryA = bary.x;\0D\0A    float baryB = bary.y;\0D\0A    float baryC = 1.0 - (baryA + baryB);\0D\0A\0D\0A    float3 normal = (tri.verts[0].norm * baryC) +\0D\0A                    (tri.verts[1].norm * baryA) +\0D\0A                    (tri.verts[2].norm * baryB);\0D\0A\0D\0A    normal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A    return normal; \0D\0A}\0D\0A\0D\0A// float3 getWorldSpaceNormal()\0D\0A// {\0D\0A//     uint offset = numTriangles();\0D\0A//     Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A//     //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A//     float3 a = tri.verts[0].pos;\0D\0A//     float3 b = tri.verts[1].pos;\0D\0A//     float3 c = tri.verts[2].pos;\0D\0A    \0D\0A//     float3 ba = b - a;\0D\0A//     float3 ca = c - a;\0D\0A//     float3 normal = cross(ba, ca);\0D\0A//     normal = normalize(mul((float3x3)ObjectToWorld4x3(), normal));\0D\0A//     return normal;\0D\0A//     //normal = normalize(doTransform(normal, ObjectToWorld4x3()));\0D\0A//    /// return normal;\0D\0A// }\0D\0A\0D\0A\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    if(payload.layer == 0) { payload.accum = float3(0, 0, 0); }\0D\0A    return;\0D\0A    \0D\0A}\0D\0A\0D\0Afloat3 getColor(in Material mat, in float3 pos)\0D\0A{\0D\0A    switch(mat.indicator)\0D\0A    {\0D\0A        case 1: //checkered\0D\0A            {\0D\0A            int2 xy = int2(floor(pos.xz));\0D\0A            uint colorIdx = (xy.x+xy.y)%2 == 0;\0D\0A\0D\0A            //int3 xyz = (int3)floor(select(pos < 1, pos-1, pos));\0D\0A            //bool3 evenSquare = xyz%2;\0D\0A        \0D\0A            //uint colorIdx = evenSquare.x ^ evenSquare.y ^ evenSquare.z;// ((xyz.x + xyz.y)%2);\0D\0A            return colorIdx ? float3(1.0, 1.0, 1.0)-mat.color : mat.color;\0D\0A            \0D\0A            }\0D\0A            break;\0D\0A        default:\0D\0A            return mat.color;\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 generateNewRayDir(float3 oldRayDir, in float3 normal)\0D\0A{\0D\0A    (void)oldRayDir;\0D\0A    //TODO: this was essentially stolen from \0D\0A    //http://raytracey.blogspot.com/2016/11/opencl-path-tracing-tutorial-2-path.html\0D\0A    //need to go through and see how the one I wrote was wrong after I confirm this works.\0D\0A\0D\0A    //TODO: this refracts sometime when it shouldn't?\0D\0A\0D\0A    //float3 w = dot(normal, oldRayDir) < 0.0f ? normal : normal * (-1.0f);\0D\0A    float3 w = normal;\0D\0A\0D\0A    /* compute two random numbers to pick a random point on the hemisphere above the hitpoint*/\0D\0A    \0D\0A    float rand1 = 2.0f * PI * randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float rand2 = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A\0D\0A    float rand2s = sqrt(rand2);\0D\0A\0D\0A    /* create a local orthogonal coordinate frame centered at the hitpoint */\0D\0A    float3 u = abs(w.x) > 0.1f ? float3(0.0f, 1.0f, 0.0f) : float3(1.0f, 0.0f, 0.0f); //axis\0D\0A    u = normalize(cross(u, w));\0D\0A    float3 v = cross(w, u);\0D\0A    v = normalize(v);                \0D\0A    return normalize(u * cos(rand1) * rand2s + v * sin(rand1) * rand2s + w * sqrt(1.0f - rand2));\0D\0A}\0D\0A\0D\0Avoid UnifiedShading(\0D\0Ainout RayPayload payload,\0D\0Ain Material mat,\0D\0Ain uint matIdx,\0D\0Ain float2 bary\0D\0A)\0D\0A{\0D\0A\0D\0A    uint w, h;\0D\0A    colorOut.GetDimensions(w, h);\0D\0A\0D\0A    uint2 pixelID = NonUniformResourceIndex(DispatchRaysIndex()).xy;\0D\0A    uint flatIndex = (pixelID.y * w) + pixelID.x;\0D\0A\0D\0A    bool recorded = false;\0D\0A    if(payload.recordHit)\0D\0A    {\0D\0A        hitInfo[flatIndex].instanceID = NonUniformResourceIndex(InstanceID());\0D\0A        hitInfo[flatIndex].geometryIndex = NonUniformResourceIndex(GeometryIndex());\0D\0A        hitInfo[flatIndex].matID = matIdx;\0D\0A        hitInfo[flatIndex].padd0 = 0;\0D\0A        payload.recordHit = 0;\0D\0A        hitInfo[flatIndex].didRefraction = 0;\0D\0A        recorded = true;\0D\0A    }\0D\0A\0D\0A\0D\0A    float3 normal = getWorldSpaceNormal(bary);\0D\0A    //payload.accum = abs(normal);\0D\0A    //return;\0D\0A    float3 pos = WorldRayOrigin() + (WorldRayDirection() * RayTCurrent());\0D\0A\0D\0A    //TODO: multiple rays for tree branching motecarlo for more efficient tracing?\0D\0A    // Maybe only branch after first hit..?\0D\0A    float3 oldRayDir = WorldRayDirection();\0D\0A    \0D\0A    float transDecider = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float mirrorDecider = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float3 newRayDir;\0D\0A\0D\0A    bool doingTransparencyStuff = false;\0D\0A\0D\0A    if(payload.insideGlass)\0D\0A    {   \0D\0A        if(recorded)\0D\0A        {\0D\0A            hitInfo[flatIndex].didRefraction = 1;\0D\0A            payload.recordHit = 1;//don't record the info of glass refractions, but of what we hit after\0D\0A        }\0D\0A        payload.insideGlass = false;\0D\0A        newRayDir = refract(oldRayDir, -normal, 1.0/mat.ior);\0D\0A        doingTransparencyStuff = true;\0D\0A    }\0D\0A    else if (mat.trans >= transDecider)\0D\0A    {\0D\0A        if(recorded)\0D\0A        {\0D\0A            hitInfo[flatIndex].didRefraction = 1;\0D\0A            payload.recordHit = 1;//don't record the info of glass refractions, but of what we hit after\0D\0A        }\0D\0A        payload.recordHit = 1;//don't record the info of glass refractions, but of what we hit after\0D\0A        // pos -= normal*0.0001f;\0D\0A        payload.insideGlass = true;\0D\0A        newRayDir = refract(oldRayDir, normal, 1);//mat.ior);\0D\0A        doingTransparencyStuff = true;\0D\0A    }\0D\0A    else if(mat.smooth >= mirrorDecider)\0D\0A    {\0D\0A        newRayDir = reflect(oldRayDir, normal);\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        newRayDir = generateNewRayDir(oldRayDir, normal);\0D\0A    }\0D\0A\0D\0A    if(!doingTransparencyStuff)\0D\0A    { // Cook Torance shading model\0D\0A    \0D\0A        float3 color = getColor(mat, pos);\0D\0A\0D\0A        //float tf = abs((1.0 - mat.ior) / (1.0 + mat.ior));\0D\0A        float3 F0a = abs((1.0 - mat.ior) / (1.0 + mat.ior)).xxx;\0D\0A\0D\0A        F0a = F0a * F0a;\0D\0A\0D\0A        float3 F0 = lerp(F0a, color, mat.metal);\0D\0A        float3 kS = float3(0, 0, 0);\0D\0A        float3 cT = max(CookTorance(oldRayDir, newRayDir, normal, mat.ior, F0, kS), 0.0f);\0D\0A        //float3 R = reflect(newRayDir, normal);\0D\0A\0D\0A\0D\0A        //float3 V = -oldRayDir;\0D\0A        float3 N = normal;\0D\0A        float3 L = newRayDir;\0D\0A\0D\0A        //float3 H = normalize((L + V));\0D\0A\0D\0A        float diff = max(dot(L, N), 0.0f);\0D\0A        //float spec = max(dot(N, H), 0.0f);\0D\0A        //float lightsum = diff + spec;\0D\0A        float3 kD = ((1.0f - kS) * (1.0f - mat.metal));\0D\0A\0D\0A        payload.accum += mat.emission * payload.mask;\0D\0A        payload.mask *= color * ((diff * kD) + (cT));\0D\0A    }\0D\0A    { // new ray stuff\0D\0A        payload.layer++;\0D\0A        if (payload.layer >= MAX_RECURSION_LAYERS || any(mat.emission > 0))\0D\0A        {\0D\0A            //payload.accum.x =\0D\0A            return;\0D\0A        }\0D\0A        \0D\0A        RayDesc ray;\0D\0A        ray.Origin = pos;\0D\0A        ray.Direction = newRayDir;\0D\0A        ray.TMin = 0.001;\0D\0A        ray.TMax = 1000;\0D\0A        \0D\0A        TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_white(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.0f;\0D\0A    mat.emission = float3(0, 0, 0);\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, 0, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_shinyred(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 0.1, 0.1);\0D\0A    mat.smooth = 0.5f;\0D\0A    mat.emission = float3(0, 0, 0);\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, 1, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_light(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.9f;\0D\0A    mat.emission = float3(1, 1, 1); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, 2, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_metal(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.6f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.9;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, 3, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_mirror(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.99f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 1.0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, 4, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_checkered(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.1f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 1;\0D\0A\0D\0A    UnifiedShading(payload, mat, 5, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_glass(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(0.2, 0.8, 0.8);\0D\0A    mat.smooth = 0.1f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0.9;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1.52;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, 6, attrib.barycentrics);\0D\0A}"}
!265 = !{!".\5CCookTorrance.hlsl", !"#include \22shared.h\22\0D\0A\0D\0A\0D\0Afloat Xchi(float x)\0D\0A{\0D\0A    int i = (int) (x > 0);\0D\0A    return (1.0f * (float) (i)) + (-1.0f * ((float) (1 - i)));\0D\0A\0D\0A}\0D\0A\0D\0Afloat D(float3 m, float3 n, float3 h, float a)\0D\0A{\0D\0A    float numerator = a * a * Xchi(dot(h, n));\0D\0A\0D\0A    float mndot2 = pow(dot(m, n), 2);\0D\0A\0D\0A    float otherPart = (1.0f - mndot2) / mndot2;\0D\0A    float denominator = PI * pow(pow(dot(m, n), 2) * ((a * a) + otherPart), 2);\0D\0A\0D\0A    return numerator / denominator;\0D\0A}\0D\0A\0D\0A\0D\0Afloat fDialectric(float prevIOR, float newIOR, float3 i, float3 o)\0D\0A{\0D\0A    float f0 = (prevIOR - newIOR) / (prevIOR + newIOR);\0D\0A    f0 *= f0;\0D\0A\0D\0A\0D\0A    return f0 + ((1.0f - f0) * pow(1.0f - dot(i, o), 5));\0D\0A\0D\0A}\0D\0Afloat3 fresnelSchlick(float cosT, float3 f0)\0D\0A{\0D\0A    return f0 + (1.0f - f0) * pow(1.0f - cosT, 5);\0D\0A}\0D\0A\0D\0A#define fK 4.0f //absorbtion coefficient\0D\0A\0D\0Afloat fConductor(float matIOR, float3 i, float3 o)\0D\0A{\0D\0A    float numerator = pow(matIOR - 1.0, 2) + (4.0 * matIOR * pow(1.0 - dot(i, o), 5)) + pow(fK, 2);\0D\0A    float denom = pow(matIOR + 1.0, 2) + pow(fK, 2);\0D\0A\0D\0A    return numerator / denom;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0Afloat Gp(float3 v, float3 n, float3 h, float a)\0D\0A{\0D\0A\0D\0A\0D\0A    float vdh = dot(v, h);\0D\0A    float chi = Xchi(vdh / dot(v, n));\0D\0A    vdh *= vdh;\0D\0A    float right = (1.0f - vdh) / vdh;\0D\0A    return (chi * 2.0f) / (1.0f + sqrt(1.0f + (a * a * right)));\0D\0A}\0D\0Afloat G(float3 wi, float3 wo, float3 n, float3 h, float a)\0D\0A{\0D\0A    return Gp(wi, n, h, a) * Gp(wo, n, h, a);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 CookTorance(\0D\0A\09in float3 oldRayDir,\0D\0A\09in float3 newRayDir,\0D\0A\09in float3 normal,\0D\0A\09//Material mat,\0D\0A\09float prevIOR,\0D\0A\09const float3 F0,\0D\0A\09inout float3 kS)\0D\0A{\0D\0A    (void)prevIOR;\0D\0A\0D\0A    //float2 uv = minRayResult.uv.xy;\0D\0A\09\0D\0A    float roughness = 0.4;// 1.0f - mat.smooth;\0D\0A\0D\0A\0D\0A    float3 vi = -oldRayDir;\0D\0A    float3 vo = newRayDir;\0D\0A\09//dvec3 vh = normalize(vi + vo);\0D\0A    float3 vn = normal;\0D\0A\0D\0A\09/*if (dot(vn, vo) < 0) { //if going into transparent material\0D\0A\09\09vo = -vo;\0D\0A\09\09vo = vo - ((2.0f * vo * vn) / pow(length(vo), 2) * vo);\0D\0A\09} else if(dot(vn, vi) < 0) { //if coming out of transparent material\0D\0A\09\09vi = -vi;\0D\0A\09\09vi = vi - ((2.0f * vi * vn) / pow(length(vi), 2) * vi);\0D\0A\09}*/\0D\0A    float3 vh = normalize(vi + vo);\0D\0A\0D\0A\0D\0A    float ndi = dot(vn, vi);\0D\0A\0D\0A    float cosT = dot(vo, vn);\0D\0A    float sinT = sqrt(1 - cosT * cosT);\0D\0A\0D\0A\09// Calculate fresnel\0D\0A    float3 fresnel = fresnelSchlick(dot(vh, vi), F0);\0D\0A\0D\0A\0D\0A\09// Geometry term\0D\0A    float geometry = G(vi, vo, vn, vh, roughness); // GGX_PartialGeometryTerm(viewVector, normal, halfVector, roughness)* GGX_PartialGeometryTerm(sampleVector, normal, halfVector, roughness);\0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   \0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   // Calculate the Cook-Torrance denominator\0D\0A    float denominator = 4.0f * (ndi * dot(vh, vn) + 0.05f);\0D\0A    kS = fresnel;\0D\0A\09\0D\0A\09// Accumulate the radiance\0D\0A    return geometry * fresnel * sinT / denominator;\0D\0A}"}
!266 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A\0D\0A#define FREQUENCIES 48\0D\0A#define NUM_SAMPLES 32//8096\0D\0A#define MAX_RECURSION_LAYERS 12\0D\0A#define PI 3.14159265f\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A    uint frameNumber;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float3 accum;\0D\0A    uint layer;\0D\0A    float3 mask;\0D\0A    uint32_t padd : 30;\0D\0A    uint32_t recordHit : 1;\0D\0A    uint32_t insideGlass : 1;\0D\0A};\0D\0A\0D\0Astruct HitInfo\0D\0A{\0D\0A    uint32_t instanceID :24;\0D\0A    uint32_t matID :8;\0D\0A    uint32_t geometryIndex :24;\0D\0A    uint32_t didRefraction :1;\0D\0A    uint32_t padd0 :7;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A    float3 norm;\0D\0A    uint diffuseTextureIdx;\0D\0A    uint normalTextureIdx;\0D\0A    uint specularTextureIdx;\0D\0A    uint metalicTextureIdx;\0D\0A    uint roughnessTextureIdx;\0D\0A    uint alphaTextureIdx;\0D\0A    uint emmisiveTextureIdx;\0D\0A\0D\0A};\0D\0A\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0Astatic uint x = sizeof(Tringle)/sizeof(uint);\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 color; //base color\0D\0A    float smooth; //smoothness\0D\0A    float3 emission; //light emissition \0D\0A    float trans; //transparency\0D\0A    float ns; //specular exponent\0D\0A    float ior; //index of refracton\0D\0A    float metal; //metalness\0D\0A    uint indicator;\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!267 = !{!"raytrace.hlsl"}
!268 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"-HV", !"2021", !"-enable-16bit-types", !"-Od", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!269 = !{i32 1, i32 6}
!270 = !{!"lib", i32 6, i32 6}
!271 = !{!272, !277, !284, null}
!272 = !{!273, !275}
!273 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !274}
!274 = !{i32 0, i32 4}
!275 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* bitcast ([0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A" to [0 x %"class.StructuredBuffer<Tringle>"]*), !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !276}
!276 = !{i32 1, i32 156}
!277 = !{!278, !280, !282}
!278 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* bitcast (%dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@M$03@@@@A" to %"class.RWTexture2D<vector<float, 4> >"*), !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 true, i1 false, i1 false, !279}
!279 = !{i32 0, i32 9}
!280 = !{i32 1, %"class.RWTexture2D<unsigned long long>"* bitcast (%dx.types.Handle* @"\01?randBuff@@3V?$RWTexture2D@_K@@A" to %"class.RWTexture2D<unsigned long long>"*), !"randBuff", i32 0, i32 1, i32 1, i32 2, i1 true, i1 false, i1 false, !281}
!281 = !{i32 0, i32 5}
!282 = !{i32 2, %"class.RWStructuredBuffer<HitInfo>"* bitcast (%dx.types.Handle* @"\01?hitInfo@@3V?$RWStructuredBuffer@UHitInfo@@@@A" to %"class.RWStructuredBuffer<HitInfo>"*), !"hitInfo", i32 0, i32 2, i32 1, i32 12, i1 true, i1 false, i1 false, !283}
!283 = !{i32 1, i32 8}
!284 = !{!285}
!285 = !{i32 0, %constants* bitcast (%dx.types.Handle* @constants to %constants*), !"constants", i32 0, i32 0, i32 1, i32 36, null}
!286 = !{i32 0, %struct.ConstantBufferStruct undef, !287, %"class.RWStructuredBuffer<HitInfo>" undef, !293, %struct.HitInfo undef, !298, %"class.StructuredBuffer<Tringle>" undef, !301, %struct.Tringle undef, !305, %struct.Vert undef, !307, %struct.RayPayload undef, !317, %struct.BuiltInTriangleIntersectionAttributes undef, !322, %constants undef, !324}
!287 = !{i32 36, !288, !289, !290, !291, !292}
!288 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!289 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!290 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!291 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!292 = !{i32 6, !"frameNumber", i32 3, i32 32, i32 7, i32 5}
!293 = !{i32 8, !294, !295}
!294 = !{i32 6, !"h", i32 3, i32 0}
!295 = !{i32 0, !296}
!296 = !{!297}
!297 = !{i32 0, %struct.HitInfo undef}
!298 = !{i32 8, !299, !300}
!299 = !{i32 3, i32 0, i32 7, i32 5}
!300 = !{i32 3, i32 4, i32 7, i32 5}
!301 = !{i32 184, !294, !302}
!302 = !{i32 0, !303}
!303 = !{!304}
!304 = !{i32 0, %struct.Tringle undef}
!305 = !{i32 184, !306}
!306 = !{i32 6, !"verts", i32 3, i32 0}
!307 = !{i32 56, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!308 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!309 = !{i32 6, !"norm", i32 3, i32 16, i32 7, i32 9}
!310 = !{i32 6, !"diffuseTextureIdx", i32 3, i32 28, i32 7, i32 5}
!311 = !{i32 6, !"normalTextureIdx", i32 3, i32 32, i32 7, i32 5}
!312 = !{i32 6, !"specularTextureIdx", i32 3, i32 36, i32 7, i32 5}
!313 = !{i32 6, !"metalicTextureIdx", i32 3, i32 40, i32 7, i32 5}
!314 = !{i32 6, !"roughnessTextureIdx", i32 3, i32 44, i32 7, i32 5}
!315 = !{i32 6, !"alphaTextureIdx", i32 3, i32 48, i32 7, i32 5}
!316 = !{i32 6, !"emmisiveTextureIdx", i32 3, i32 52, i32 7, i32 5}
!317 = !{i32 32, !318, !319, !320, !321}
!318 = !{i32 6, !"accum", i32 3, i32 0, i32 7, i32 9}
!319 = !{i32 6, !"layer", i32 3, i32 12, i32 7, i32 5}
!320 = !{i32 6, !"mask", i32 3, i32 16, i32 7, i32 9}
!321 = !{i32 3, i32 28, i32 7, i32 5}
!322 = !{i32 8, !323}
!323 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!324 = !{i32 36, !325}
!325 = !{i32 6, !"constants", i32 3, i32 0}
!326 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !327, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !329, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !331}
!327 = !{!328}
!328 = !{i32 1, !2, !2}
!329 = !{!328, !330}
!330 = !{i32 2, !2, !2}
!331 = !{!328, !330, !332}
!332 = !{i32 0, !2, !2}
!333 = !{null, !"", null, !271, !334}
!334 = !{i32 0, i64 43057169}
!335 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !336}
!336 = !{i32 8, i32 11, i32 6, i32 32, i32 5, !337}
!337 = !{i32 0}
!338 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !339}
!339 = !{i32 8, i32 7, i32 5, !337}
!340 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!341 = !{i32 8, i32 10, i32 6, i32 32, i32 7, i32 8, i32 5, !337}
!342 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!343 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!344 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!345 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!346 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!347 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !341}
!348 = !DILocation(line: 105, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !118, file: !1, line: 93, column: 5)
!350 = !DILocation(line: 21, column: 5, scope: !199, inlinedAt: !351)
!351 = distinct !DILocation(line: 28, column: 19, scope: !198, inlinedAt: !352)
!352 = distinct !DILocation(line: 37, column: 13, scope: !188, inlinedAt: !353)
!353 = distinct !DILocation(line: 112, column: 134, scope: !354)
!354 = distinct !DILexicalBlock(scope: !355, file: !1, line: 111, column: 5)
!355 = distinct !DILexicalBlock(scope: !356, file: !1, line: 110, column: 5)
!356 = distinct !DILexicalBlock(scope: !118, file: !1, line: 110, column: 5)
!357 = !DILocation(line: 130, column: 5, scope: !118)
!358 = !DILocation(line: 52, column: 28, scope: !118)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !118, file: !1, line: 52, type: !6)
!360 = !DIExpression(DW_OP_bit_piece, 0, 32)
!361 = !DILocation(line: 52, column: 12, scope: !118)
!362 = !DIExpression(DW_OP_bit_piece, 32, 32)
!363 = !DIExpression(DW_OP_bit_piece, 64, 32)
!364 = !DILocation(line: 53, column: 42, scope: !118)
!365 = !DILocation(line: 53, column: 61, scope: !118)
!366 = !DILocation(line: 53, column: 49, scope: !118)
!367 = !DILocation(line: 53, column: 22, scope: !118)
!368 = !DILocation(line: 53, column: 12, scope: !118)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !118, file: !1, line: 53, type: !6)
!370 = !DILocation(line: 54, column: 12, scope: !118)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !118, file: !1, line: 54, type: !6)
!372 = !DIExpression()
!373 = !DILocation(line: 55, column: 20, scope: !118)
!374 = !DILocation(line: 55, column: 12, scope: !118)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !118, file: !1, line: 55, type: !6)
!376 = !DILocation(line: 56, column: 17, scope: !118)
!377 = !DILocation(line: 56, column: 12, scope: !118)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !118, file: !1, line: 56, type: !6)
!379 = !DILocation(line: 58, column: 45, scope: !118)
!380 = !DILocation(line: 58, column: 21, scope: !118)
!381 = !DILocation(line: 58, column: 11, scope: !118)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !118, file: !1, line: 58, type: !191)
!383 = !DILocation(line: 59, column: 42, scope: !118)
!384 = !DILocation(line: 59, column: 18, scope: !118)
!385 = !DILocation(line: 59, column: 11, scope: !118)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !118, file: !1, line: 59, type: !191)
!387 = !DILocation(line: 60, column: 23, scope: !118)
!388 = !DILocation(line: 60, column: 28, scope: !118)
!389 = !DILocation(line: 60, column: 12, scope: !118)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !118, file: !1, line: 60, type: !15)
!391 = !DILocation(line: 61, column: 31, scope: !118)
!392 = !DILocation(line: 61, column: 35, scope: !118)
!393 = !DILocation(line: 61, column: 11, scope: !118)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !118, file: !1, line: 61, type: !5)
!395 = !DILocation(line: 63, column: 42, scope: !118)
!396 = !DILocation(line: 63, column: 40, scope: !118)
!397 = !DILocation(line: 63, column: 11, scope: !118)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !118, file: !1, line: 63, type: !5)
!399 = !DILocation(line: 65, column: 43, scope: !118)
!400 = !DILocation(line: 65, column: 32, scope: !118)
!401 = !DILocation(line: 65, column: 12, scope: !118)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "centerOfPlane", scope: !118, file: !1, line: 65, type: !6)
!403 = !DILocation(line: 67, column: 31, scope: !118)
!404 = !DILocation(line: 67, column: 47, scope: !118)
!405 = !DILocation(line: 67, column: 12, scope: !118)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !118, file: !1, line: 67, type: !15)
!407 = !DILocation(line: 71, column: 49, scope: !118)
!408 = !DILocation(line: 71, column: 40, scope: !118)
!409 = !DILocation(line: 71, column: 77, scope: !118)
!410 = !DILocation(line: 71, column: 71, scope: !118)
!411 = !DILocation(line: 71, column: 12, scope: !118)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !118, file: !1, line: 71, type: !6)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !118, file: !1, line: 72, type: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 72, size: 256, align: 32, elements: !415)
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !414, file: !1, line: 72, baseType: !7, size: 96, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !414, file: !1, line: 72, baseType: !5, size: 32, align: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !414, file: !1, line: 72, baseType: !7, size: 96, align: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !414, file: !1, line: 72, baseType: !5, size: 32, align: 32, offset: 224)
!420 = !DILocation(line: 72, column: 13, scope: !118)
!421 = !DILocation(line: 73, column: 43, scope: !118)
!422 = !DILocation(line: 73, column: 21, scope: !118)
!423 = !DILocation(line: 73, column: 9, scope: !118)
!424 = !DILocation(line: 73, column: 19, scope: !118)
!425 = !DILocation(line: 74, column: 9, scope: !118)
!426 = !DILocation(line: 74, column: 16, scope: !118)
!427 = !DILocation(line: 75, column: 9, scope: !118)
!428 = !DILocation(line: 75, column: 14, scope: !118)
!429 = !DILocation(line: 76, column: 9, scope: !118)
!430 = !DILocation(line: 76, column: 14, scope: !118)
!431 = !DILocation(line: 90, column: 12, scope: !118)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !118, file: !1, line: 90, type: !6)
!433 = !DILocation(line: 94, column: 53, scope: !349)
!434 = !DILocation(line: 94, column: 44, scope: !349)
!435 = !DILocation(line: 94, column: 81, scope: !349)
!436 = !DILocation(line: 94, column: 75, scope: !349)
!437 = !DILocation(line: 94, column: 16, scope: !349)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !349, file: !1, line: 94, type: !6)
!439 = !DILocation(line: 95, column: 47, scope: !349)
!440 = !DILocation(line: 95, column: 25, scope: !349)
!441 = !DILocation(line: 95, column: 13, scope: !349)
!442 = !DILocation(line: 95, column: 23, scope: !349)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !349, file: !1, line: 97, type: !147)
!444 = !DILocation(line: 97, column: 20, scope: !349)
!445 = !DILocation(line: 97, column: 42, scope: !349)
!446 = !DILocation(line: 98, column: 17, scope: !349)
!447 = !DILocation(line: 98, column: 22, scope: !349)
!448 = !DILocation(line: 99, column: 17, scope: !349)
!449 = !DILocation(line: 99, column: 23, scope: !349)
!450 = !DILocation(line: 100, column: 17, scope: !349)
!451 = !DILocation(line: 100, column: 23, scope: !349)
!452 = !DILocation(line: 101, column: 17, scope: !349)
!453 = !DILocation(line: 101, column: 29, scope: !349)
!454 = !DILocation(line: 102, column: 17, scope: !349)
!455 = !DILocation(line: 102, column: 27, scope: !349)
!456 = !DILocation(line: 103, column: 17, scope: !349)
!457 = !DILocation(line: 103, column: 22, scope: !349)
!458 = !DILocation(line: 107, column: 32, scope: !349)
!459 = !DILocation(line: 107, column: 18, scope: !349)
!460 = !DILocation(line: 107, column: 15, scope: !349)
!461 = !DILocation(line: 110, column: 14, scope: !356)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !356, file: !1, line: 110, type: !84)
!463 = !DILocation(line: 110, column: 5, scope: !356)
!464 = !DILocation(line: 112, column: 58, scope: !354)
!465 = !DILocation(line: 112, column: 81, scope: !354)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pixelID", arg: 1, scope: !188, file: !1, line: 35, type: !191)
!467 = !DILocation(line: 35, column: 37, scope: !188, inlinedAt: !468)
!468 = distinct !DILocation(line: 112, column: 81, scope: !354)
!469 = !DILocation(line: 37, column: 13, scope: !188, inlinedAt: !468)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pixelID", arg: 1, scope: !198, file: !1, line: 25, type: !191)
!471 = !DILocation(line: 25, column: 35, scope: !198, inlinedAt: !472)
!472 = distinct !DILocation(line: 37, column: 13, scope: !188, inlinedAt: !468)
!473 = !DILocation(line: 28, column: 19, scope: !198, inlinedAt: !472)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pixelID", arg: 1, scope: !199, file: !1, line: 15, type: !191)
!475 = !DILocation(line: 15, column: 29, scope: !199, inlinedAt: !476)
!476 = distinct !DILocation(line: 28, column: 19, scope: !198, inlinedAt: !472)
!477 = !DILocation(line: 17, column: 22, scope: !199, inlinedAt: !476)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !199, file: !1, line: 17, type: !86)
