#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Typed UAV Load Additional Formats
;       64-Bit integer
;       Use native low precision
;
; shader debug name: d4db63c69fea4625c51337a29f402ac5.pdb
; shader hash: d4db63c69fea4625c51337a29f402ac5
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;           uint frameNumber;                         ; Offset:   32
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !89, globals: !178)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !6, !15, !22, !31, !40, !48, !70, !85, !87}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 9, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 9, size: 96, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !10, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !5)
!14 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 3)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 53, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 53, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 53, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 53, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!13, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 76, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 76, size: 48, align: 16, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 76, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 76, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 76, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !14}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 93, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 93, size: 64, align: 16, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 93, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 93, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 93, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 93, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!38 = !{!30, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 110, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 110, size: 128, align: 32, elements: !42, templateParams: !47)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 110, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 110, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 110, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !41, file: !1, line: 110, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !{!13, !39}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 112, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 112, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 4)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 138, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 138, size: 288, align: 32, elements: !72, templateParams: !82)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !71, file: !1, line: 138, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!82 = !{!13, !83, !84}
!83 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 3)
!84 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 3)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 75, baseType: !86)
!86 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 16, baseType: !88)
!88 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!89 = !{!90, !94, !97, !100, !103, !106, !107, !110, !116, !119, !138, !141, !152, !155, !156, !159, !165, !175}
!90 = !DISubprogram(name: "Xchi", linkageName: "\01?Xchi@@YAMM@Z", scope: !91, file: !91, line: 4, type: !92, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DIFile(filename: "./CookTorrance.hlsl", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!5, !5}
!94 = !DISubprogram(name: "D", linkageName: "\01?D@@YAMV?$vector@M$02@@00M@Z", scope: !91, file: !91, line: 11, type: !95, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!5, !6, !6, !6, !5}
!97 = !DISubprogram(name: "fDialectric", linkageName: "\01?fDialectric@@YAMMMV?$vector@M$02@@0@Z", scope: !91, file: !91, line: 24, type: !98, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{!5, !5, !5, !6, !6}
!100 = !DISubprogram(name: "fresnelSchlick", linkageName: "\01?fresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !91, file: !91, line: 33, type: !101, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubroutineType(types: !102)
!102 = !{!6, !5, !6}
!103 = !DISubprogram(name: "fConductor", linkageName: "\01?fConductor@@YAMMV?$vector@M$02@@0@Z", scope: !91, file: !91, line: 40, type: !104, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!5, !5, !6, !6}
!106 = !DISubprogram(name: "Gp", linkageName: "\01?Gp@@YAMV?$vector@M$02@@00M@Z", scope: !91, file: !91, line: 50, type: !95, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubprogram(name: "G", linkageName: "\01?G@@YAMV?$vector@M$02@@000M@Z", scope: !91, file: !91, line: 60, type: !108, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubroutineType(types: !109)
!109 = !{!5, !6, !6, !6, !6, !5}
!110 = !DISubprogram(name: "CookTorance", linkageName: "\01?CookTorance@@YA?AV?$vector@M$02@@V1@00MV1@AIAV1@@Z", scope: !91, file: !91, line: 66, type: !111, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!111 = !DISubroutineType(types: !112)
!112 = !{!6, !6, !6, !6, !5, !113, !114}
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !6)
!116 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 42, type: !117, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!117 = !DISubroutineType(types: !118)
!118 = !{null}
!119 = !DISubprogram(name: "doTransform", linkageName: "\01?doTransform@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$02@@@Z", scope: !1, file: !1, line: 108, type: !120, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!120 = !DISubroutineType(types: !121)
!121 = !{!6, !6, !122}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 106, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 106, size: 384, align: 32, elements: !124, templateParams: !137)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !123, file: !1, line: 106, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!137 = !{!13, !68, !84}
!138 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 126, type: !139, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false)
!139 = !DISubroutineType(types: !140)
!140 = !{!6}
!141 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 145, type: !142, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144}
!144 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !146, line: 28, size: 256, align: 32, elements: !147)
!146 = !DIFile(filename: "./shared.h", directory: "")
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !145, file: !146, line: 30, baseType: !6, size: 96, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !145, file: !146, line: 31, baseType: !85, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !145, file: !146, line: 32, baseType: !6, size: 96, align: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !145, file: !146, line: 33, baseType: !85, size: 32, align: 32, offset: 224)
!152 = !DISubprogram(name: "ShadeIt", linkageName: "\01?ShadeIt@@YAXURayPayload@@V?$vector@M$02@@11I@Z", scope: !1, file: !1, line: 152, type: !153, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !144, !6, !6, !6, !85}
!155 = !DISubprogram(name: "ShadeItCookTorance", linkageName: "\01?ShadeItCookTorance@@YAXURayPayload@@V?$vector@M$02@@11I@Z", scope: !1, file: !1, line: 200, type: !153, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false)
!156 = !DISubprogram(name: "generateNewRayDir", linkageName: "\01?generateNewRayDir@@YA?AV?$vector@M$02@@V1@0@Z", scope: !1, file: !1, line: 278, type: !157, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false)
!157 = !DISubroutineType(types: !158)
!158 = !{!6, !6, !6}
!159 = !DISubprogram(name: "ch_normalcolors", linkageName: "\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 305, type: !160, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!160 = !DISubroutineType(types: !161)
!161 = !{null, !144, !162}
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 302, size: 64, align: 32, elements: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !162, file: !1, line: 302, baseType: !16, size: 64, align: 32)
!165 = !DISubprogram(name: "randFloat01", linkageName: "\01?randFloat01@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 24, type: !166, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!166 = !DISubroutineType(types: !167)
!167 = !{!5, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 51, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 51, size: 64, align: 32, elements: !170, templateParams: !173)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !169, file: !1, line: 51, baseType: !86, size: 32, align: 32, flags: DIFlagPublic)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !169, file: !1, line: 51, baseType: !86, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!173 = !{!174, !21}
!174 = !DITemplateTypeParameter(name: "element", type: !86)
!175 = !DISubprogram(name: "MWC64X", linkageName: "\01?MWC64X@@YAIV?$vector@I$01@@@Z", scope: !1, file: !1, line: 14, type: !176, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!176 = !DISubroutineType(types: !177)
!177 = !{!85, !168}
!178 = !{!179, !179, !181, !183, !194, !198, !202, !204}
!179 = !DIGlobalVariable(name: "FLOAT_MAX", linkageName: "\01?FLOAT_MAX@@3MB", scope: !0, file: !1, line: 39, type: !180, isLocal: false, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!181 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 90, type: !182, isLocal: true, isDefinition: true, variable: i32 1)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!183 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 8, type: !184, isLocal: false, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !185)
!185 = !{!186}
!186 = !DITemplateTypeParameter(name: "T", type: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !146, line: 19, size: 288, align: 32, elements: !188)
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !187, file: !146, line: 21, baseType: !6, size: 96, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !187, file: !146, line: 22, baseType: !5, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !187, file: !146, line: 23, baseType: !6, size: 96, align: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !187, file: !146, line: 24, baseType: !5, size: 32, align: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "frameNumber", scope: !187, file: !146, line: 25, baseType: !85, size: 32, align: 32, offset: 256)
!194 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 9, type: !195, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!195 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 9, size: 64, align: 16, elements: !2, templateParams: !196)
!196 = !{!197}
!197 = !DITemplateTypeParameter(name: "element", type: !32)
!198 = !DIGlobalVariable(name: "randBuff", linkageName: "\01?randBuff@@3V?$RWTexture2D@_K@@A", scope: !0, file: !1, line: 10, type: !199, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?randBuff@@3V?$RWTexture2D@_K@@A")
!199 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned long long>", file: !1, line: 10, size: 64, align: 64, elements: !2, templateParams: !200)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "element", type: !88)
!202 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 11, type: !203, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 11, size: 32, align: 32, elements: !2)
!204 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 12, type: !205, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 288, align: 32, elements: !218)
!206 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 12, size: 288, align: 32, elements: !2, templateParams: !207)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "element", type: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !146, line: 41, size: 288, align: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !209, file: !146, line: 43, baseType: !212, size: 288, align: 32)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 288, align: 32, elements: !216)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !146, line: 37, size: 96, align: 32, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !213, file: !146, line: 39, baseType: !6, size: 96, align: 32)
!216 = !{!217}
!217 = !DISubrange(count: 3)
!218 = !{!219}
!219 = !DISubrange(count: 1)
!220 = !{i32 2, !"Dwarf Version", i32 4}
!221 = !{i32 2, !"Debug Info Version", i32 3}
!222 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!223 = !{!"shaders.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A#include \22CookTorrance.hlsl\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0Agloballycoherent RWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0Agloballycoherent RWTexture2D<uint64_t>                 randBuff   : register(u1);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0Ainline uint MWC64X(in uint2 pixelID)\0D\0A{\0D\0A    uint64_t state = randBuff[pixelID];\0D\0A    uint c = uint((state) >> 32);\0D\0A    uint x = uint((state) & 0xFFFFFFFF);\0D\0A    state = uint64_t(x * ((uint64_t) 4294883355U) + c);\0D\0A    randBuff[pixelID] = state;\0D\0A    return x ^ c;\0D\0A}\0D\0A\0D\0Ainline float randFloat01(in uint2 pixelID)\0D\0A{\0D\0A    //return 0.5;\0D\0A    return (float(MWC64X(pixelID)) / float(0xFFFFFFFF));\0D\0A}\0D\0Ainline float randFloat11(in uint2 pixelID)\0D\0A{\0D\0A    return (randFloat01(pixelID) * 2.0) - 1.0;\0D\0A}\0D\0A\0D\0Ainline float randFloat0505(in uint2 pixelID)\0D\0A{\0D\0A    return (randFloat01(pixelID)) - 0.5;\0D\0A}\0D\0A\0D\0Aconst float FLOAT_MAX = 3.402823466e+38F;//\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(forward, right);\0D\0A     \0D\0A    uint2 pixelID = NonUniformResourceIndex(DispatchRaysIndex()).xy;\0D\0A    uint2 dims = NonUniformResourceIndex(DispatchRaysDimensions()).xy;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A\0D\0A\0D\0A    // for(uint i = 0; i < NUM_SAMPLES; i++)\0D\0A    // {\0D\0A    RayPayload payload = (RayPayload)0;\0D\0A    payload.mask = float16_t3(1.0, 1.0, 1.0);\0D\0A    payload.layer = 0; //why doesn't the api provide a layer ugh\0D\0A    payload.accum = float16_t3(0.0, 0.0, 0.0);\0D\0A    payload.padd = 0;\0D\0A\0D\0A    // const uint loBits = (uint32_t)(randBuff[pixelID]&0xFFFFFFFF);\0D\0A    // const uint hiBits = (uint32_t)((randBuff[pixelID]>>32)&0xFFFFFFFF);\0D\0A    // const float loFloat = (((float)loBits)/((float)0xFFFFFFFF));\0D\0A    // const float hiFloat = (((float)hiBits)/((float)0xFFFFFFFF));\0D\0A    // colorOut[pixelID].x = (float16_t) hiFloat;\0D\0A    // colorOut[pixelID].y = (float16_t) loFloat;\0D\0A    // colorOut[pixelID].z = 0.1f;\0D\0A    //return;\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    if(constants.frameNumber % NUM_SAMPLES == 0)\0D\0A    {\0D\0A        colorOut[pixelID] = float16_t4(0, 0, 0, 1);\0D\0A    }\0D\0A    //TODO: this clamp being required means somethign is *wrong*\0D\0A    float3 sampl3 = clamp(payload.accum, float3(0, 0, 0), float3(1, 1, 1)) / float(NUM_SAMPLES);\0D\0A    colorOut[pixelID] += float16_t4(sampl3.x, sampl3.y, sampl3.z, 0.0);\0D\0A    // colorOut[pixelID].w = 1.0;\0D\0A    // }\0D\0A\0D\0A    \0D\0A    \0D\0A    //payload.accum.b = float(payload.layer) / float(MAX_RECURSION_LAYERS);\0D\0A    \0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A}\0D\0A\0D\0Afloat3 doTransform(float3 vec3, float4x3 mat4x3)\0D\0A{\0D\0A    float4 vec4 = float4(vec3.x, vec3.y, vec3.z, 1.0);\0D\0A\0D\0A    float4x4 mat4x4 = float4x4(\0D\0A        mat4x3[0][0],mat4x3[0][1], mat4x3[0][2], 0,\0D\0A        mat4x3[1][0],mat4x3[1][1], mat4x3[1][2], 0,\0D\0A        mat4x3[2][0],mat4x3[2][1], mat4x3[2][2], 0,\0D\0A        mat4x3[3][0],mat4x3[3][1], mat4x3[3][2], 1\0D\0A    );\0D\0A    mat4x4 = transpose(mat4x4);\0D\0A\0D\0A    float4 retVal = mul(vec4, mat4x4);\0D\0A\0D\0A    return retVal.xyz;\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal()\0D\0A{\0D\0A    Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = cross(ba, ca);\0D\0A    normal = normalize(mul((float3x3)ObjectToWorld4x3(), normal));\0D\0A    //normal = normalize(doTransform(normal, ObjectToWorld4x3()));\0D\0A    return normal;\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    if(payload.layer == 0) { payload.accum = float3(1, 0, 0); }\0D\0A    return;\0D\0A    \0D\0A}\0D\0A\0D\0Avoid ShadeIt(inout RayPayload payload,\0D\0Ain float3 normal,\0D\0Ain float3 oldRayDir,\0D\0Ain float3 newRayDir,\0D\0Auint matIndex\0D\0A)\0D\0A{\0D\0A    return;\0D\0A    (void)matIndex;\0D\0A\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);//abs(normal);// float3(1.0, 1.0, 1.0);\0D\0A    mat.ni = 1.0;\0D\0A    mat.emission = float3(0.0, 0.0, 0.0);\0D\0A    if(NonUniformResourceIndex(InstanceIndex()) == 1)\0D\0A    {\0D\0A        mat.emission = float3(300, 300, 300);\0D\0A    }\0D\0A    mat.ns = 1.0;\0D\0A    mat.trans = 0.0;\0D\0A    mat.metal = 0.0;\0D\0A    mat.smooth = 0.0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    float3 lightDir = normalize(newRayDir);\0D\0A    float NdotL = dot(normal, normalize(lightDir));\0D\0A    float diffuse = NdotL;\0D\0A\0D\0A    float3 viewDir = -normalize(oldRayDir);\0D\0A    float3 H = normalize(lightDir + viewDir);\0D\0A    //TODO: better solution for this, if these two are the same, then it results in a NAN\0D\0A    if(all(oldRayDir == lightDir))\0D\0A    {\0D\0A        H = viewDir;\0D\0A    }\0D\0A    \0D\0A    float NdotH = dot(normal, H);\0D\0A    float specular = NdotH;\0D\0A    float3 nothin = payload.mask;\0D\0A    if(nothin.x == 50.03f || nothin.y == 50.03f || nothin.z == 50.03f)\0D\0A    {\0D\0A        return;\0D\0A    }\0D\0A    payload.accum += mat.emission * nothin;\0D\0A    payload.mask *= mat.color * (diffuse + specular);\0D\0A}\0D\0A\0D\0A\0D\0Avoid ShadeItCookTorance( \0D\0Ainout RayPayload payload,\0D\0Ain float3 normal,\0D\0Ain float3 oldRayDir,\0D\0Ain float3 newRayDir,\0D\0Auint matIndex\0D\0A)\0D\0A{\0D\0A\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);//abs(normal);// float3(1.0, 1.0, 1.0);\0D\0A    mat.ni = 1.0;\0D\0A    mat.emission = float3(0.0, 0.0, 0.0);\0D\0A    if(NonUniformResourceIndex(InstanceIndex()) == 1)\0D\0A    {\0D\0A        mat.emission = float3(300, 300, 300);\0D\0A    }\0D\0A    mat.ns = 1.0;\0D\0A    mat.trans = 0.0;\0D\0A    mat.metal = 0.5;\0D\0A    mat.smooth = 0.5;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A\0D\0A    float tf = abs((1.0 - mat.ni) / (1.0 + mat.ni));\0D\0A    float3 F0a = abs((1.0 - mat.ni) / (1.0 + mat.ni)).xxx;\0D\0A\0D\0A    //float3(tf, tf, tf);\0D\0A    F0a = F0a * F0a;\0D\0A\0D\0A    float3 F0 = lerp(F0a, mat.color, mat.metal);\0D\0A    //dvec3 ctSpecular = CookTorance(ray, reflectionRay, minRayResult, downstreamRadiance, minRayResult.shape->mat, currentIOR, F0, kS);\0D\0A    //TODO: need to keep the current ray\0D\0A    float3 kS;\0D\0A    float3 cT = max(CookTorance(oldRayDir, newRayDir, normal, mat.ni, F0, kS), 0.0f);\0D\0A    //blinn phong (ish)\0D\0A    float3 R = reflect(newRayDir, normal); //   rotateVector(newRay.dir, PI, hr.normal); //TODO: not the right rotate\0D\0A\0D\0A\0D\0A    float3 V = -oldRayDir;\0D\0A    float3 N = normal;\0D\0A    float3 L = newRayDir;\0D\0A\0D\0A    float3 H = normalize((L + V));\0D\0A\0D\0A    float diff = max(dot(L, N), 0.0f);\0D\0A    float spec = max(dot(N, H), 0.0f);\0D\0A    float lightsum = diff + spec;\0D\0A    float3 kD = ((1.0f - kS) * (1.0f - mat.metal)); //*diff;\0D\0A\0D\0A    payload.accum += mat.emission * payload.mask;\0D\0A    payload.mask *= mat.color * ((diff * kD) + (cT));\0D\0A\0D\0A    // (void)matIndex;\0D\0A\0D\0A    // float3 lightDir = normalize(newRayDir);\0D\0A    // float NdotL = dot(normal, normalize(lightDir));\0D\0A    // float diffuse = NdotL;\0D\0A\0D\0A    // float3 viewDir = -normalize(oldRayDir);\0D\0A    // float3 H = normalize(lightDir + viewDir);\0D\0A    // //TODO: better solution for this, if these two are the same, then it results in a NAN\0D\0A    // if(all(oldRayDir == lightDir))\0D\0A    // {\0D\0A    //     H = viewDir;\0D\0A    // }\0D\0A    \0D\0A    // float NdotH = dot(normal, H);\0D\0A    // float specular = NdotH;\0D\0A    // float3 nothin = payload.mask;\0D\0A    // if(nothin.x == 50.03f || nothin.y == 50.03f || nothin.z == 50.03f)\0D\0A    // {\0D\0A    //     return;\0D\0A    // }\0D\0A    // payload.accum += mat.emission * nothin;\0D\0A    // payload.mask *= mat.color * (diffuse + specular);\0D\0A}\0D\0A\0D\0Afloat3 generateNewRayDir(float3 oldRayDir, in float3 normal)\0D\0A{\0D\0A    (void)oldRayDir;\0D\0A    //TODO: this was essentially stolen from \0D\0A    //http://raytracey.blogspot.com/2016/11/opencl-path-tracing-tutorial-2-path.html\0D\0A    //need to go through and see how the one I wrote was wrong after I confirm this works.\0D\0A\0D\0A    //TODO: this refracts sometime when it shouldn't?\0D\0A    //float3 w = dot(normal, oldRayDir) < 0.0f ? normal : normal * (-1.0f);\0D\0A    float3 w = normal;\0D\0A\0D\0A    /* compute two random numbers to pick a random point on the hemisphere above the hitpoint*/\0D\0A                    \0D\0A    float rand1 = 2.0f * PI * randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float rand2 = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A\0D\0A    float rand2s = sqrt(rand2);\0D\0A\0D\0A    /* create a local orthogonal coordinate frame centered at the hitpoint */\0D\0A    float3 u = abs(w.x) > 0.1f ? float3(0.0f, 1.0f, 0.0f) : float3(1.0f, 0.0f, 0.0f); //axis\0D\0A    u = normalize(cross(u, w));\0D\0A    float3 v = cross(w, u);\0D\0A    v = normalize(v);                \0D\0A    return normalize(u * cos(rand1) * rand2s + v * sin(rand1) * rand2s + w * sqrt(1.0f - rand2));\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_normalcolors(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A    \0D\0A    float3 normal = getWorldSpaceNormal();\0D\0A    float3 pos = WorldRayOrigin() + (WorldRayDirection() * RayTCurrent());\0D\0A\0D\0A    //TODO: a smooth surface will generate more reflected rays\0D\0A    float3 oldRayDir = WorldRayDirection();\0D\0A    float3 newRayDir = generateNewRayDir(oldRayDir, normal);\0D\0A    \0D\0A    ShadeItCookTorance(\0D\0A    //ShadeIt(\0D\0A        payload,\0D\0A        normal,\0D\0A        oldRayDir,\0D\0A        newRayDir,\0D\0A        0\0D\0A    );\0D\0A    \0D\0A    payload.layer++;// = payload.layer+1;//++;\0D\0A    //uint layer = payload.layer;\0D\0A    if (payload.layer >= MAX_RECURSION_LAYERS)\0D\0A    {\0D\0A        //payload.accum = float3(1, 0, 0);\0D\0A        return;\0D\0A    }\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;// + (normal*0.001f);\0D\0A    ray.Direction = newRayDir;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A};"}
!224 = !{!".\5CCookTorrance.hlsl", !"#include \22shared.h\22\0D\0A\0D\0A\0D\0Afloat Xchi(float x)\0D\0A{\0D\0A    int i = (int) (x > 0);\0D\0A    return (1.0f * (float) (i)) + (-1.0f * ((float) (1 - i)));\0D\0A\0D\0A}\0D\0A\0D\0Afloat D(float3 m, float3 n, float3 h, float a)\0D\0A{\0D\0A    float numerator = a * a * Xchi(dot(h, n));\0D\0A\0D\0A    float mndot2 = pow(dot(m, n), 2);\0D\0A\0D\0A    float otherPart = (1.0f - mndot2) / mndot2;\0D\0A    float denominator = PI * pow(pow(dot(m, n), 2) * ((a * a) + otherPart), 2);\0D\0A\0D\0A    return numerator / denominator;\0D\0A}\0D\0A\0D\0A\0D\0Afloat fDialectric(float prevIOR, float newIOR, float3 i, float3 o)\0D\0A{\0D\0A    float f0 = (prevIOR - newIOR) / (prevIOR + newIOR);\0D\0A    f0 *= f0;\0D\0A\0D\0A\0D\0A    return f0 + ((1.0f - f0) * pow(1.0f - dot(i, o), 5));\0D\0A\0D\0A}\0D\0Afloat3 fresnelSchlick(float cosT, float3 f0)\0D\0A{\0D\0A    return f0 + (1.0f - f0) * pow(1.0f - cosT, 5);\0D\0A}\0D\0A\0D\0A#define fK 4.0f //absorbtion coefficient\0D\0A\0D\0Afloat fConductor(float matIOR, float3 i, float3 o)\0D\0A{\0D\0A    float numerator = pow(matIOR - 1.0, 2) + (4.0 * matIOR * pow(1.0 - dot(i, o), 5)) + pow(fK, 2);\0D\0A    float denom = pow(matIOR + 1.0, 2) + pow(fK, 2);\0D\0A\0D\0A    return numerator / denom;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0Afloat Gp(float3 v, float3 n, float3 h, float a)\0D\0A{\0D\0A\0D\0A\0D\0A    float vdh = dot(v, h);\0D\0A    float chi = Xchi(vdh / dot(v, n));\0D\0A    vdh *= vdh;\0D\0A    float right = (1.0f - vdh) / vdh;\0D\0A    return (chi * 2.0f) / (1.0f + sqrt(1.0f + (a * a * right)));\0D\0A}\0D\0Afloat G(float3 wi, float3 wo, float3 n, float3 h, float a)\0D\0A{\0D\0A    return Gp(wi, n, h, a) * Gp(wo, n, h, a);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 CookTorance(\0D\0A\09in float3 oldRayDir,\0D\0A\09in float3 newRayDir,\0D\0A\09in float3 normal,\0D\0A\09//Material mat,\0D\0A\09float prevIOR,\0D\0A\09const float3 F0,\0D\0A\09inout float3 kS)\0D\0A{\0D\0A    (void)prevIOR;\0D\0A\0D\0A    //float2 uv = minRayResult.uv.xy;\0D\0A\09\0D\0A    float roughness = 0.4;// 1.0f - mat.smooth;\0D\0A\0D\0A\0D\0A    float3 vi = -oldRayDir;\0D\0A    float3 vo = newRayDir;\0D\0A\09//dvec3 vh = normalize(vi + vo);\0D\0A    float3 vn = normal;\0D\0A\0D\0A\09/*if (dot(vn, vo) < 0) { //if going into transparent material\0D\0A\09\09vo = -vo;\0D\0A\09\09vo = vo - ((2.0f * vo * vn) / pow(length(vo), 2) * vo);\0D\0A\09} else if(dot(vn, vi) < 0) { //if coming out of transparent material\0D\0A\09\09vi = -vi;\0D\0A\09\09vi = vi - ((2.0f * vi * vn) / pow(length(vi), 2) * vi);\0D\0A\09}*/\0D\0A    float3 vh = normalize(vi + vo);\0D\0A\0D\0A\0D\0A    float ndi = dot(vn, vi);\0D\0A\0D\0A    float cosT = dot(vo, vn);\0D\0A    float sinT = sqrt(1 - cosT * cosT);\0D\0A\0D\0A\09// Calculate fresnel\0D\0A    float3 fresnel = fresnelSchlick(dot(vh, vi), F0);\0D\0A\0D\0A\0D\0A\09// Geometry term\0D\0A    float geometry = G(vi, vo, vn, vh, roughness); // GGX_PartialGeometryTerm(viewVector, normal, halfVector, roughness)* GGX_PartialGeometryTerm(sampleVector, normal, halfVector, roughness);\0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   \0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   // Calculate the Cook-Torrance denominator\0D\0A    float denominator = 4.0f * (ndi * dot(vh, vn) + 0.05f);\0D\0A    kS = fresnel;\0D\0A\09\0D\0A\09// Accumulate the radiance\0D\0A    return geometry * fresnel * sinT / denominator;\0D\0A}"}
!225 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A#define NUM_SAMPLES 8096\0D\0A#define MAX_RECURSION_LAYERS 16\0D\0A#define PI 3.14159265f\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A    uint frameNumber;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float3 accum;\0D\0A    uint layer;\0D\0A    float3 mask;\0D\0A    uint padd;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A};\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A// #ifdef __cplusplus\0D\0A// \09Material(\0D\0A// \09\09float3 color = float3(1.0f, 1.0f, 1.0f),\0D\0A// \09\09float3 emission = float3(0.0f, 0.0f, 0.0f),\0D\0A// \09\09float ni = 1.0f,\0D\0A// \09\09float ns = 1.0,\0D\0A// \09\09float trans = 0.0,\0D\0A// \09\09float metal = 0.0,\0D\0A// \09\09float smooth = 0.0,\0D\0A// \09\09uint indicator = 0)\0D\0A// \09{\0D\0A// \09\09this->color = color;\0D\0A// \09\09this->emission = emission;\0D\0A// \09\09this->ni = ni;\0D\0A// \09\09this->ns = ns;\0D\0A// \09\09this->trans = trans;\0D\0A// \09\09this->metal = metal;\0D\0A// \09\09this->smooth = smooth;\0D\0A// \09\09this->indicator = indicator;\0D\0A// \09}\0D\0A    \0D\0A// #endif // __cplusplus\0D\0A\0D\0A    float3 color; //base color\0D\0A    float ni; //index of refracton\0D\0A    float3 emission; //light emissition \0D\0A    float ns; //specular exponent\0D\0A    float trans; //transparency\0D\0A    float metal; //metalness\0D\0A    float smooth; //smoothness\0D\0A    uint indicator;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!226 = !{!"shaders.hlsl"}
!227 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"-HV", !"2021", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!228 = !{i32 1, i32 6}
!229 = !{!"lib", i32 6, i32 6}
!230 = !{!231, !236, !241, null}
!231 = !{!232, !234}
!232 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !233}
!233 = !{i32 0, i32 4}
!234 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* bitcast ([0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A" to [0 x %"class.StructuredBuffer<Tringle>"]*), !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !235}
!235 = !{i32 1, i32 36}
!236 = !{!237, !239}
!237 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* bitcast (%dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A" to %"class.RWTexture2D<vector<half, 4> >"*), !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 true, i1 false, i1 false, !238}
!238 = !{i32 0, i32 8}
!239 = !{i32 1, %"class.RWTexture2D<unsigned long long>"* bitcast (%dx.types.Handle* @"\01?randBuff@@3V?$RWTexture2D@_K@@A" to %"class.RWTexture2D<unsigned long long>"*), !"randBuff", i32 0, i32 1, i32 1, i32 2, i1 true, i1 false, i1 false, !240}
!240 = !{i32 0, i32 5}
!241 = !{!242}
!242 = !{i32 0, %constants* bitcast (%dx.types.Handle* @constants to %constants*), !"constants", i32 0, i32 0, i32 1, i32 36, null}
!243 = !{i32 0, %struct.ConstantBufferStruct undef, !244, %"class.StructuredBuffer<Tringle>" undef, !250, %struct.Tringle undef, !255, %struct.Vert undef, !257, %struct.RayPayload undef, !259, %struct.BuiltInTriangleIntersectionAttributes undef, !264, %constants undef, !266}
!244 = !{i32 36, !245, !246, !247, !248, !249}
!245 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!246 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!247 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!248 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!249 = !{i32 6, !"frameNumber", i32 3, i32 32, i32 7, i32 5}
!250 = !{i32 44, !251, !252}
!251 = !{i32 6, !"h", i32 3, i32 0}
!252 = !{i32 0, !253}
!253 = !{!254}
!254 = !{i32 0, %struct.Tringle undef}
!255 = !{i32 44, !256}
!256 = !{i32 6, !"verts", i32 3, i32 0}
!257 = !{i32 12, !258}
!258 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!259 = !{i32 32, !260, !261, !262, !263}
!260 = !{i32 6, !"accum", i32 3, i32 0, i32 7, i32 9}
!261 = !{i32 6, !"layer", i32 3, i32 12, i32 7, i32 5}
!262 = !{i32 6, !"mask", i32 3, i32 16, i32 7, i32 9}
!263 = !{i32 6, !"padd", i32 3, i32 28, i32 7, i32 5}
!264 = !{i32 8, !265}
!265 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!266 = !{i32 36, !267}
!267 = !{i32 6, !"constants", i32 3, i32 0}
!268 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !269, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !271, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !273}
!269 = !{!270}
!270 = !{i32 1, !2, !2}
!271 = !{!270, !272}
!272 = !{i32 2, !2, !2}
!273 = !{!270, !272, !274}
!274 = !{i32 0, !2, !2}
!275 = !{null, !"", null, !230, !276}
!276 = !{i32 0, i64 9510960}
!277 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !278}
!278 = !{i32 8, i32 11, i32 6, i32 32, i32 5, !279}
!279 = !{i32 0}
!280 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !281}
!281 = !{i32 8, i32 7, i32 5, !279}
!282 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !283}
!283 = !{i32 8, i32 10, i32 6, i32 32, i32 7, i32 8, i32 5, !279}
!284 = !DILocation(line: 90, column: 5, scope: !116)
!285 = !DILocation(line: 93, column: 9, scope: !286)
!286 = distinct !DILexicalBlock(scope: !287, file: !1, line: 92, column: 5)
!287 = distinct !DILexicalBlock(scope: !116, file: !1, line: 91, column: 8)
!288 = !DILocation(line: 45, column: 28, scope: !116)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !116, file: !1, line: 45, type: !6)
!290 = !DIExpression(DW_OP_bit_piece, 0, 32)
!291 = !DILocation(line: 45, column: 12, scope: !116)
!292 = !DIExpression(DW_OP_bit_piece, 32, 32)
!293 = !DIExpression(DW_OP_bit_piece, 64, 32)
!294 = !DILocation(line: 46, column: 42, scope: !116)
!295 = !DILocation(line: 46, column: 49, scope: !116)
!296 = !DILocation(line: 46, column: 22, scope: !116)
!297 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !116, file: !1, line: 46, type: !6)
!298 = !DILocation(line: 46, column: 12, scope: !116)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !116, file: !1, line: 47, type: !6)
!300 = !DIExpression()
!301 = !DILocation(line: 47, column: 12, scope: !116)
!302 = !DILocation(line: 48, column: 20, scope: !116)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !116, file: !1, line: 48, type: !6)
!304 = !DILocation(line: 48, column: 12, scope: !116)
!305 = !DILocation(line: 49, column: 17, scope: !116)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !116, file: !1, line: 49, type: !6)
!307 = !DILocation(line: 49, column: 12, scope: !116)
!308 = !DILocation(line: 51, column: 45, scope: !116)
!309 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !116, file: !1, line: 51, type: !168)
!310 = !DILocation(line: 51, column: 11, scope: !116)
!311 = !DILocation(line: 52, column: 42, scope: !116)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !116, file: !1, line: 52, type: !168)
!313 = !DILocation(line: 52, column: 11, scope: !116)
!314 = !DILocation(line: 53, column: 23, scope: !116)
!315 = !DILocation(line: 53, column: 28, scope: !116)
!316 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !116, file: !1, line: 53, type: !15)
!317 = !DILocation(line: 53, column: 12, scope: !116)
!318 = !DILocation(line: 54, column: 31, scope: !116)
!319 = !DILocation(line: 54, column: 35, scope: !116)
!320 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !116, file: !1, line: 54, type: !5)
!321 = !DILocation(line: 54, column: 11, scope: !116)
!322 = !DILocation(line: 56, column: 42, scope: !116)
!323 = !DILocation(line: 56, column: 40, scope: !116)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !116, file: !1, line: 56, type: !5)
!325 = !DILocation(line: 56, column: 11, scope: !116)
!326 = !DILocation(line: 58, column: 43, scope: !116)
!327 = !DILocation(line: 60, column: 31, scope: !116)
!328 = !DILocation(line: 60, column: 47, scope: !116)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !116, file: !1, line: 60, type: !15)
!330 = !DILocation(line: 60, column: 12, scope: !116)
!331 = !DILocation(line: 63, column: 49, scope: !116)
!332 = !DILocation(line: 63, column: 77, scope: !116)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !116, file: !1, line: 63, type: !6)
!334 = !DILocation(line: 63, column: 12, scope: !116)
!335 = !DILocation(line: 67, column: 43, scope: !116)
!336 = !DILocation(line: 63, column: 71, scope: !116)
!337 = !DILocation(line: 67, column: 21, scope: !116)
!338 = !DILocation(line: 75, column: 5, scope: !116)
!339 = !DILocation(line: 75, column: 38, scope: !116)
!340 = !DILocation(line: 76, column: 18, scope: !116)
!341 = !{!342, !342, i64 0}
!342 = !{!"omnipotent char", !343, i64 0}
!343 = !{!"Simple C/C++ TBAA"}
!344 = !DILocation(line: 77, column: 19, scope: !116)
!345 = !{!346, !346, i64 0}
!346 = !{!"int", !342, i64 0}
!347 = !DILocation(line: 78, column: 19, scope: !116)
!348 = !DILocation(line: 79, column: 18, scope: !116)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !116, file: !1, line: 75, type: !145)
!350 = !DILocation(line: 75, column: 16, scope: !116)
!351 = !DILocation(line: 91, column: 18, scope: !287)
!352 = !DILocation(line: 91, column: 30, scope: !287)
!353 = !DILocation(line: 91, column: 44, scope: !287)
!354 = !DILocation(line: 91, column: 8, scope: !116)
!355 = !DILocation(line: 93, column: 27, scope: !286)
!356 = !DILocation(line: 94, column: 5, scope: !286)
!357 = !DILocation(line: 96, column: 35, scope: !116)
!358 = !DILocation(line: 96, column: 21, scope: !116)
!359 = !DILocation(line: 96, column: 76, scope: !116)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sampl3", scope: !116, file: !1, line: 96, type: !6)
!361 = !DILocation(line: 96, column: 12, scope: !116)
!362 = !DILocation(line: 97, column: 37, scope: !116)
!363 = !DILocation(line: 97, column: 47, scope: !116)
!364 = !DILocation(line: 97, column: 57, scope: !116)
!365 = !DILocation(line: 97, column: 5, scope: !116)
!366 = !DILocation(line: 97, column: 23, scope: !116)
!367 = !DILocation(line: 106, column: 1, scope: !116)
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !141, file: !1, line: 145, type: !145)
!369 = !DILocation(line: 145, column: 28, scope: !141)
!370 = !DILocation(line: 147, column: 16, scope: !371)
!371 = distinct !DILexicalBlock(scope: !141, file: !1, line: 147, column: 8)
!372 = !DILocation(line: 147, column: 22, scope: !371)
!373 = !DILocation(line: 147, column: 8, scope: !141)
!374 = !DILocation(line: 147, column: 38, scope: !375)
!375 = distinct !DILexicalBlock(scope: !371, file: !1, line: 147, column: 28)
!376 = !DILocation(line: 147, column: 44, scope: !375)
!377 = !DILocation(line: 147, column: 63, scope: !375)
!378 = !DILocation(line: 148, column: 5, scope: !141)
!379 = !DILocation(line: 339, column: 5, scope: !159)
!380 = !DILocation(line: 20, column: 5, scope: !175, inlinedAt: !381)
!381 = distinct !DILocation(line: 27, column: 19, scope: !165, inlinedAt: !382)
!382 = distinct !DILocation(line: 292, column: 19, scope: !156, inlinedAt: !383)
!383 = distinct !DILocation(line: 314, column: 24, scope: !159)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !159, file: !1, line: 305, type: !162)
!385 = !DILocation(line: 305, column: 89, scope: !159)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !159, file: !1, line: 305, type: !145)
!387 = !DILocation(line: 305, column: 39, scope: !159)
!388 = !DILocation(line: 128, column: 52, scope: !138, inlinedAt: !389)
!389 = distinct !DILocation(line: 309, column: 21, scope: !159)
!390 = !DILocation(line: 128, column: 91, scope: !138, inlinedAt: !389)
!391 = !DILocation(line: 128, column: 19, scope: !138, inlinedAt: !389)
!392 = !{i32 1}
!393 = !DILocation(line: 131, column: 29, scope: !138, inlinedAt: !389)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !138, file: !1, line: 131, type: !6)
!395 = !DILocation(line: 131, column: 12, scope: !138, inlinedAt: !389)
!396 = !DILocation(line: 132, column: 29, scope: !138, inlinedAt: !389)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !138, file: !1, line: 132, type: !6)
!398 = !DILocation(line: 132, column: 12, scope: !138, inlinedAt: !389)
!399 = !DILocation(line: 133, column: 29, scope: !138, inlinedAt: !389)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !138, file: !1, line: 133, type: !6)
!401 = !DILocation(line: 133, column: 12, scope: !138, inlinedAt: !389)
!402 = !DILocation(line: 135, column: 19, scope: !138, inlinedAt: !389)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ba", scope: !138, file: !1, line: 135, type: !6)
!404 = !DILocation(line: 135, column: 12, scope: !138, inlinedAt: !389)
!405 = !DILocation(line: 136, column: 19, scope: !138, inlinedAt: !389)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ca", scope: !138, file: !1, line: 136, type: !6)
!407 = !DILocation(line: 136, column: 12, scope: !138, inlinedAt: !389)
!408 = !DILocation(line: 137, column: 21, scope: !138, inlinedAt: !389)
!409 = !DILocation(line: 138, column: 38, scope: !138, inlinedAt: !389)
!410 = !DILocation(line: 138, column: 24, scope: !138, inlinedAt: !389)
!411 = !DILocation(line: 138, column: 14, scope: !138, inlinedAt: !389)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !138, file: !1, line: 137, type: !6)
!413 = !DILocation(line: 137, column: 12, scope: !138, inlinedAt: !389)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !159, file: !1, line: 309, type: !6)
!415 = !DILocation(line: 309, column: 12, scope: !159)
!416 = !DILocation(line: 310, column: 60, scope: !159)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !159, file: !1, line: 310, type: !6)
!418 = !DILocation(line: 310, column: 12, scope: !159)
!419 = !DILocation(line: 313, column: 24, scope: !159)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldRayDir", scope: !159, file: !1, line: 313, type: !6)
!421 = !DILocation(line: 313, column: 12, scope: !159)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "normal", arg: 2, scope: !156, file: !1, line: 278, type: !6)
!423 = !DILocation(line: 278, column: 54, scope: !156, inlinedAt: !383)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldRayDir", arg: 1, scope: !156, file: !1, line: 278, type: !6)
!425 = !DILocation(line: 278, column: 33, scope: !156, inlinedAt: !383)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !156, file: !1, line: 287, type: !6)
!427 = !DILocation(line: 287, column: 12, scope: !156, inlinedAt: !383)
!428 = !DILocation(line: 291, column: 67, scope: !156, inlinedAt: !383)
!429 = !DILocation(line: 16, column: 22, scope: !175, inlinedAt: !430)
!430 = distinct !DILocation(line: 27, column: 19, scope: !165, inlinedAt: !431)
!431 = distinct !DILocation(line: 291, column: 31, scope: !156, inlinedAt: !383)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !175, file: !1, line: 16, type: !87)
!433 = !DILocation(line: 16, column: 14, scope: !175, inlinedAt: !430)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !175, file: !1, line: 17, type: !85)
!435 = !DILocation(line: 17, column: 10, scope: !175, inlinedAt: !430)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !175, file: !1, line: 18, type: !85)
!437 = !DILocation(line: 18, column: 10, scope: !175, inlinedAt: !430)
!438 = !DILocation(line: 19, column: 22, scope: !175, inlinedAt: !430)
!439 = !DILocation(line: 19, column: 24, scope: !175, inlinedAt: !430)
!440 = !DILocation(line: 19, column: 53, scope: !175, inlinedAt: !430)
!441 = !DILocation(line: 19, column: 51, scope: !175, inlinedAt: !430)
!442 = !DILocation(line: 20, column: 23, scope: !175, inlinedAt: !430)
!443 = !DILocation(line: 21, column: 14, scope: !175, inlinedAt: !430)
!444 = !DILocation(line: 27, column: 19, scope: !165, inlinedAt: !431)
!445 = !DILocation(line: 291, column: 29, scope: !156, inlinedAt: !383)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rand1", scope: !156, file: !1, line: 291, type: !5)
!447 = !DILocation(line: 291, column: 11, scope: !156, inlinedAt: !383)
!448 = !DILocation(line: 16, column: 22, scope: !175, inlinedAt: !381)
!449 = !DILocation(line: 16, column: 14, scope: !175, inlinedAt: !381)
!450 = !DILocation(line: 17, column: 10, scope: !175, inlinedAt: !381)
!451 = !DILocation(line: 18, column: 10, scope: !175, inlinedAt: !381)
!452 = !DILocation(line: 19, column: 22, scope: !175, inlinedAt: !381)
!453 = !DILocation(line: 19, column: 24, scope: !175, inlinedAt: !381)
!454 = !DILocation(line: 19, column: 53, scope: !175, inlinedAt: !381)
!455 = !DILocation(line: 19, column: 51, scope: !175, inlinedAt: !381)
!456 = !DILocation(line: 20, column: 23, scope: !175, inlinedAt: !381)
!457 = !DILocation(line: 21, column: 14, scope: !175, inlinedAt: !381)
!458 = !DILocation(line: 27, column: 19, scope: !165, inlinedAt: !382)
!459 = !DILocation(line: 27, column: 36, scope: !165, inlinedAt: !382)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rand2", scope: !156, file: !1, line: 292, type: !5)
!461 = !DILocation(line: 292, column: 11, scope: !156, inlinedAt: !383)
!462 = !DILocation(line: 294, column: 20, scope: !156, inlinedAt: !383)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rand2s", scope: !156, file: !1, line: 294, type: !5)
!464 = !DILocation(line: 294, column: 11, scope: !156, inlinedAt: !383)
!465 = !DILocation(line: 297, column: 16, scope: !156, inlinedAt: !383)
!466 = !DILocation(line: 297, column: 25, scope: !156, inlinedAt: !383)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !156, file: !1, line: 297, type: !6)
!468 = !DILocation(line: 297, column: 12, scope: !156, inlinedAt: !383)
!469 = !DILocation(line: 298, column: 19, scope: !156, inlinedAt: !383)
!470 = !DILocation(line: 298, column: 9, scope: !156, inlinedAt: !383)
!471 = !DILocation(line: 299, column: 16, scope: !156, inlinedAt: !383)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !156, file: !1, line: 299, type: !6)
!473 = !DILocation(line: 299, column: 12, scope: !156, inlinedAt: !383)
!474 = !DILocation(line: 300, column: 9, scope: !156, inlinedAt: !383)
!475 = !DILocation(line: 301, column: 26, scope: !156, inlinedAt: !383)
!476 = !DILocation(line: 301, column: 24, scope: !156, inlinedAt: !383)
!477 = !DILocation(line: 301, column: 52, scope: !156, inlinedAt: !383)
!478 = !DILocation(line: 301, column: 50, scope: !156, inlinedAt: !383)
!479 = !DILocation(line: 301, column: 46, scope: !156, inlinedAt: !383)
!480 = !DILocation(line: 301, column: 88, scope: !156, inlinedAt: !383)
!481 = !DILocation(line: 301, column: 78, scope: !156, inlinedAt: !383)
!482 = !DILocation(line: 301, column: 76, scope: !156, inlinedAt: !383)
!483 = !DILocation(line: 301, column: 72, scope: !156, inlinedAt: !383)
!484 = !DILocation(line: 301, column: 12, scope: !156, inlinedAt: !383)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newRayDir", scope: !159, file: !1, line: 314, type: !6)
!486 = !DILocation(line: 314, column: 12, scope: !159)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "matIndex", arg: 5, scope: !155, file: !1, line: 205, type: !85)
!488 = !DILocation(line: 205, column: 6, scope: !155, inlinedAt: !489)
!489 = distinct !DILocation(line: 316, column: 5, scope: !159)
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newRayDir", arg: 4, scope: !155, file: !1, line: 204, type: !6)
!491 = !DILocation(line: 204, column: 11, scope: !155, inlinedAt: !489)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldRayDir", arg: 3, scope: !155, file: !1, line: 203, type: !6)
!493 = !DILocation(line: 203, column: 11, scope: !155, inlinedAt: !489)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "normal", arg: 2, scope: !155, file: !1, line: 202, type: !6)
!495 = !DILocation(line: 202, column: 11, scope: !155, inlinedAt: !489)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !155, file: !1, line: 201, type: !145)
!497 = !DILocation(line: 201, column: 18, scope: !155, inlinedAt: !489)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat", scope: !155, file: !1, line: 209, type: !499)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !146, line: 48, size: 384, align: 32, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !499, file: !146, line: 73, baseType: !6, size: 96, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !499, file: !146, line: 74, baseType: !5, size: 32, align: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !499, file: !146, line: 75, baseType: !6, size: 96, align: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !499, file: !146, line: 76, baseType: !5, size: 32, align: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !499, file: !146, line: 77, baseType: !5, size: 32, align: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "metal", scope: !499, file: !146, line: 78, baseType: !5, size: 32, align: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "smooth", scope: !499, file: !146, line: 79, baseType: !5, size: 32, align: 32, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "indicator", scope: !499, file: !146, line: 80, baseType: !85, size: 32, align: 32, offset: 352)
!509 = !DIExpression(DW_OP_bit_piece, 224, 32)
!510 = !DILocation(line: 209, column: 14, scope: !155, inlinedAt: !489)
!511 = !DIExpression(DW_OP_bit_piece, 352, 32)
!512 = !DIExpression(DW_OP_bit_piece, 0, 96)
!513 = !DIExpression(DW_OP_bit_piece, 96, 32)
!514 = !DIExpression(DW_OP_bit_piece, 128, 96)
!515 = !DILocation(line: 213, column: 32, scope: !516, inlinedAt: !489)
!516 = distinct !DILexicalBlock(scope: !155, file: !1, line: 213, column: 8)
!517 = !DILocation(line: 213, column: 49, scope: !516, inlinedAt: !489)
!518 = !DILocation(line: 213, column: 8, scope: !155, inlinedAt: !489)
!519 = !DIExpression(DW_OP_bit_piece, 128, 32)
!520 = !DIExpression(DW_OP_bit_piece, 160, 32)
!521 = !DIExpression(DW_OP_bit_piece, 192, 32)
!522 = !DIExpression(DW_OP_bit_piece, 256, 32)
!523 = !DIExpression(DW_OP_bit_piece, 288, 32)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "F0a", scope: !155, file: !1, line: 225, type: !6)
!525 = !DILocation(line: 225, column: 12, scope: !155, inlinedAt: !489)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "F0", scope: !155, file: !1, line: 230, type: !6)
!527 = !DILocation(line: 230, column: 12, scope: !155, inlinedAt: !489)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "F0", arg: 5, scope: !110, file: !91, line: 72, type: !113)
!529 = !DILocation(line: 72, column: 15, scope: !110, inlinedAt: !530)
!530 = distinct !DILocation(line: 234, column: 21, scope: !155, inlinedAt: !489)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prevIOR", arg: 4, scope: !110, file: !91, line: 71, type: !5)
!532 = !DILocation(line: 71, column: 8, scope: !110, inlinedAt: !530)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "normal", arg: 3, scope: !110, file: !91, line: 69, type: !6)
!534 = !DILocation(line: 69, column: 12, scope: !110, inlinedAt: !530)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newRayDir", arg: 2, scope: !110, file: !91, line: 68, type: !6)
!536 = !DILocation(line: 68, column: 12, scope: !110, inlinedAt: !530)
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldRayDir", arg: 1, scope: !110, file: !91, line: 67, type: !6)
!538 = !DILocation(line: 67, column: 12, scope: !110, inlinedAt: !530)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "roughness", scope: !110, file: !91, line: 79, type: !5)
!540 = !DILocation(line: 79, column: 11, scope: !110, inlinedAt: !530)
!541 = !DILocation(line: 82, column: 17, scope: !110, inlinedAt: !530)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vi", scope: !110, file: !91, line: 82, type: !6)
!543 = !DILocation(line: 82, column: 12, scope: !110, inlinedAt: !530)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vo", scope: !110, file: !91, line: 83, type: !6)
!545 = !DILocation(line: 83, column: 12, scope: !110, inlinedAt: !530)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vn", scope: !110, file: !91, line: 85, type: !6)
!547 = !DILocation(line: 85, column: 12, scope: !110, inlinedAt: !530)
!548 = !DILocation(line: 94, column: 30, scope: !110, inlinedAt: !530)
!549 = !DILocation(line: 94, column: 17, scope: !110, inlinedAt: !530)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vh", scope: !110, file: !91, line: 94, type: !6)
!551 = !DILocation(line: 94, column: 12, scope: !110, inlinedAt: !530)
!552 = !DILocation(line: 97, column: 17, scope: !110, inlinedAt: !530)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndi", scope: !110, file: !91, line: 97, type: !5)
!554 = !DILocation(line: 97, column: 11, scope: !110, inlinedAt: !530)
!555 = !DILocation(line: 99, column: 18, scope: !110, inlinedAt: !530)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cosT", scope: !110, file: !91, line: 99, type: !5)
!557 = !DILocation(line: 99, column: 11, scope: !110, inlinedAt: !530)
