#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Use native low precision
;
; shader debug name: 6742b110bb67bb80e240aa6dfa48ed94.pdb
; shader hash: 6742b110bb67bb80e240aa6dfa48ed94
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; constants                         cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !55, globals: !81)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !22, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 18, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 52, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 52, size: 64, align: 16, elements: !24, templateParams: !30)
!24 = !{!25, !27, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!30 = !{!31, !32}
!31 = !DITemplateTypeParameter(name: "element", type: !26)
!32 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 48, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 48, size: 48, align: 16, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 48, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!39 = !{!31, !13}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 94, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 94, size: 288, align: 32, elements: !42, templateParams: !52)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !{!12, !53, !54}
!53 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!54 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!55 = !{!56, !59, !70, !73, !79, !80}
!56 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 15, type: !57, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!57 = !DISubroutineType(types: !58)
!58 = !{null}
!59 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 56, type: !60, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !64, line: 25, size: 64, align: 16, elements: !65)
!64 = !DIFile(filename: "./shared.h", directory: "")
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !63, file: !64, line: 27, baseType: !33, size: 48, align: 16)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !63, file: !64, line: 28, baseType: !68, size: 16, align: 16, offset: 48)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 48, baseType: !69)
!69 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 62, type: !71, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!4}
!73 = !DISubprogram(name: "ch_normalcolors", linkageName: "\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 79, type: !74, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!74 = !DISubroutineType(types: !75)
!75 = !{null, !62, !76}
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 75, size: 64, align: 32, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !76, file: !1, line: 75, baseType: !16, size: 64, align: 32)
!79 = !DISubprogram(name: "ch_red", linkageName: "\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 101, type: !74, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!80 = !DISubprogram(name: "ch_mirror", linkageName: "\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 113, type: !74, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!81 = !{!82, !85, !86, !96, !100, !102}
!82 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 50, type: !83, isLocal: true, isDefinition: true, variable: i32 1)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 129, type: !83, isLocal: true, isDefinition: true, variable: i32 0)
!86 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 7, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !64, line: 17, size: 256, align: 32, elements: !91)
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !90, file: !64, line: 19, baseType: !4, size: 96, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !90, file: !64, line: 20, baseType: !8, size: 32, align: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !90, file: !64, line: 21, baseType: !4, size: 96, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !90, file: !64, line: 22, baseType: !8, size: 32, align: 32, offset: 224)
!96 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 8, type: !97, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<half, 4> >"* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 8, size: 64, align: 16, elements: !2, templateParams: !98)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "element", type: !23)
!100 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 9, type: !101, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 9, size: 32, align: 32, elements: !2)
!102 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 10, type: !103, isLocal: false, isDefinition: true, variable: [0 x %"class.StructuredBuffer<Tringle>"]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 288, align: 32, elements: !116)
!104 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 10, size: 288, align: 32, elements: !2, templateParams: !105)
!105 = !{!106}
!106 = !DITemplateTypeParameter(name: "element", type: !107)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !64, line: 36, size: 288, align: 32, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !107, file: !64, line: 38, baseType: !110, size: 288, align: 32)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 288, align: 32, elements: !114)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !64, line: 32, size: 96, align: 32, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !111, file: !64, line: 34, baseType: !4, size: 96, align: 32)
!114 = !{!115}
!115 = !DISubrange(count: 3)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !{i32 2, !"Dwarf Version", i32 4}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!121 = !{!"shaders.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0ARWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0A\0D\0A//TODO: redo this, i don't like it\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(right, forward);\0D\0A     \0D\0A    \0D\0A    \0D\0A    uint2 pixelID = DispatchRaysIndex().xy;\0D\0A    uint2 dims = DispatchRaysDimensions().xy ;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    \0D\0A    //float2 offsetFromCenter = float2(dims.x, dims.y) - halfDims;\0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A    RayPayload payload = (RayPayload)0;\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A    colorOut[pixelID] = float16_t4(payload.color.x, payload.color.y, payload.color.z, 1.0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float16_t3(0.0, 0.0, 0.0);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal()\0D\0A{\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    return normal;//    mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_normalcolors(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A\0D\0A\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.color = float16_t3(color.x, color.y, color.z);\0D\0A    return;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_red(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A    //payload.color = float16_t3(0.0, 0.0, 1.0);\0D\0A    //return;\0D\0A    payload.color = float16_t3(1, 0, 0);\0D\0A    return;\0D\0A    //Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_mirror(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A    \0D\0A    \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    float3 normal = getWorldSpaceNormal();\0D\0A    float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = reflected;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    RayPayload payload2 = (RayPayload) 0;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload2);\0D\0A    payload.color = (payload2.color * 0.95) + float16_t3(0.05, 0.05, 0.05);\0D\0A    return;\0D\0A\0D\0A   // (void) attrib;\0D\0A    //payload.color = float16_t3(0.0, 0.0, 1.0);\0D\0A    //return;\0D\0A    //payload.color = float16_t3(1, 0, 0);\0D\0A    //return;\0D\0A    //Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A}"}
!122 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float16_t3 color;\0D\0A    uint16_t padd;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A};\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!123 = !{!"shaders.hlsl"}
!124 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"-HV", !"2021", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!125 = !{i32 1, i32 3}
!126 = !{i32 1, i32 6}
!127 = !{!"lib", i32 6, i32 3}
!128 = !{!129, !134, !137, null}
!129 = !{!130, !132}
!130 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !131}
!131 = !{i32 0, i32 4}
!132 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !133}
!133 = !{i32 1, i32 36}
!134 = !{!135}
!135 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !136}
!136 = !{i32 0, i32 8}
!137 = !{!138}
!138 = !{i32 0, %constants* @constants, !"constants", i32 0, i32 0, i32 1, i32 32, null}
!139 = !{i32 0, %struct.ConstantBufferStruct undef, !140, %"class.StructuredBuffer<Tringle>" undef, !145, %struct.Tringle undef, !147, %struct.Vert undef, !149, %struct.RayPayload undef, !151, %struct.BuiltInTriangleIntersectionAttributes undef, !154, %constants undef, !156}
!140 = !{i32 32, !141, !142, !143, !144}
!141 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!142 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!143 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!144 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!145 = !{i32 44, !146}
!146 = !{i32 6, !"h", i32 3, i32 0}
!147 = !{i32 44, !148}
!148 = !{i32 6, !"verts", i32 3, i32 0}
!149 = !{i32 12, !150}
!150 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!151 = !{i32 8, !152, !153}
!152 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 8}
!153 = !{i32 6, !"padd", i32 3, i32 6, i32 7, i32 3}
!154 = !{i32 8, !155}
!155 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!156 = !{i32 32, !157}
!157 = !{i32 6, !"constants", i32 3, i32 0}
!158 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !159, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !161, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !163, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !163, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !163}
!159 = !{!160}
!160 = !{i32 1, !2, !2}
!161 = !{!160, !162}
!162 = !{i32 2, !2, !2}
!163 = !{!160, !162, !164}
!164 = !{i32 0, !2, !2}
!165 = !{null, !"", null, !128, !166}
!166 = !{i32 0, i64 8454192}
!167 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !168}
!168 = !{i32 8, i32 11, i32 6, i32 8, i32 5, !169}
!169 = !{i32 0}
!170 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !171}
!171 = !{i32 8, i32 7, i32 5, !169}
!172 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !173}
!173 = !{i32 8, i32 10, i32 6, i32 8, i32 7, i32 8, i32 5, !169}
!174 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !173}
!175 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !173}
!176 = !DILocation(line: 50, column: 5, scope: !56)
!177 = !DILocation(line: 52, column: 5, scope: !56)
!178 = !DILocation(line: 18, column: 28, scope: !56)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !56, file: !1, line: 18, type: !4)
!180 = !DIExpression(DW_OP_bit_piece, 0, 32)
!181 = !DILocation(line: 18, column: 12, scope: !56)
!182 = !DIExpression(DW_OP_bit_piece, 32, 32)
!183 = !DIExpression(DW_OP_bit_piece, 64, 32)
!184 = !DILocation(line: 19, column: 42, scope: !56)
!185 = !DILocation(line: 19, column: 49, scope: !56)
!186 = !DILocation(line: 19, column: 22, scope: !56)
!187 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !56, file: !1, line: 19, type: !4)
!188 = !DILocation(line: 19, column: 12, scope: !56)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !56, file: !1, line: 20, type: !4)
!190 = !DIExpression()
!191 = !DILocation(line: 20, column: 12, scope: !56)
!192 = !DILocation(line: 21, column: 20, scope: !56)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !56, file: !1, line: 21, type: !4)
!194 = !DILocation(line: 21, column: 12, scope: !56)
!195 = !DILocation(line: 22, column: 17, scope: !56)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !56, file: !1, line: 22, type: !4)
!197 = !DILocation(line: 22, column: 12, scope: !56)
!198 = !DILocation(line: 26, column: 21, scope: !56)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !56, file: !1, line: 26, type: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 26, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 26, size: 64, align: 32, elements: !202, templateParams: !205)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !201, file: !1, line: 26, baseType: !84, size: 32, align: 32, flags: DIFlagPublic)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !201, file: !1, line: 26, baseType: !84, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!205 = !{!206, !21}
!206 = !DITemplateTypeParameter(name: "element", type: !84)
!207 = !DILocation(line: 26, column: 11, scope: !56)
!208 = !DILocation(line: 27, column: 18, scope: !56)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !56, file: !1, line: 27, type: !200)
!210 = !DILocation(line: 27, column: 11, scope: !56)
!211 = !DILocation(line: 28, column: 23, scope: !56)
!212 = !DILocation(line: 28, column: 28, scope: !56)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !56, file: !1, line: 28, type: !15)
!214 = !DILocation(line: 28, column: 12, scope: !56)
!215 = !DILocation(line: 29, column: 31, scope: !56)
!216 = !DILocation(line: 29, column: 35, scope: !56)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !56, file: !1, line: 29, type: !8)
!218 = !DILocation(line: 29, column: 11, scope: !56)
!219 = !DILocation(line: 31, column: 42, scope: !56)
!220 = !DILocation(line: 31, column: 40, scope: !56)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !56, file: !1, line: 31, type: !8)
!222 = !DILocation(line: 31, column: 11, scope: !56)
!223 = !DILocation(line: 33, column: 43, scope: !56)
!224 = !DILocation(line: 37, column: 31, scope: !56)
!225 = !DILocation(line: 37, column: 47, scope: !56)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !56, file: !1, line: 37, type: !15)
!227 = !DILocation(line: 37, column: 12, scope: !56)
!228 = !DILocation(line: 40, column: 49, scope: !56)
!229 = !DILocation(line: 40, column: 77, scope: !56)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !56, file: !1, line: 40, type: !4)
!231 = !DILocation(line: 40, column: 12, scope: !56)
!232 = !DILocation(line: 40, column: 71, scope: !56)
!233 = !DILocation(line: 44, column: 43, scope: !56)
!234 = !DILocation(line: 44, column: 21, scope: !56)
!235 = !DILocation(line: 48, column: 38, scope: !56)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !56, file: !1, line: 48, type: !63)
!237 = !DILocation(line: 48, column: 16, scope: !56)
!238 = !DILocation(line: 52, column: 36, scope: !56)
!239 = !DILocation(line: 52, column: 53, scope: !56)
!240 = !DILocation(line: 52, column: 70, scope: !56)
!241 = !DILocation(line: 52, column: 23, scope: !56)
!242 = !DILocation(line: 53, column: 1, scope: !56)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !59, file: !1, line: 56, type: !63)
!244 = !DIExpression(DW_OP_bit_piece, 0, 48)
!245 = !DILocation(line: 56, column: 28, scope: !59)
!246 = !DILocation(line: 59, column: 1, scope: !59)
!247 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !73, file: !1, line: 79, type: !76)
!248 = !DILocation(line: 79, column: 89, scope: !73)
!249 = !DILocation(line: 84, column: 28, scope: !73)
!250 = !DILocation(line: 84, column: 42, scope: !73)
!251 = !DILocation(line: 84, column: 19, scope: !73)
!252 = !DILocation(line: 87, column: 29, scope: !73)
!253 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !73, file: !1, line: 87, type: !4)
!254 = !DILocation(line: 87, column: 12, scope: !73)
!255 = !DILocation(line: 88, column: 29, scope: !73)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !73, file: !1, line: 88, type: !4)
!257 = !DILocation(line: 88, column: 12, scope: !73)
!258 = !DILocation(line: 89, column: 29, scope: !73)
!259 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !73, file: !1, line: 89, type: !4)
!260 = !DILocation(line: 89, column: 12, scope: !73)
!261 = !DILocation(line: 91, column: 19, scope: !73)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ba", scope: !73, file: !1, line: 91, type: !4)
!263 = !DILocation(line: 91, column: 12, scope: !73)
