#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Use native low precision
;
; shader debug name: 093c10b1ed7f79e18a4c1dc0f9894937.pdb
; shader hash: 093c10b1ed7f79e18a4c1dc0f9894937
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; constants                         cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !55, globals: !82)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !25, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 21, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 21, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 39, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 39, size: 64, align: 16, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 39, baseType: !18, size: 16, align: 16, flags: DIFlagPublic)
!18 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 39, baseType: !18, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 39, baseType: !18, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 39, baseType: !18, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 35, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 35, size: 48, align: 16, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 35, baseType: !18, size: 16, align: 16, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 35, baseType: !18, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 35, baseType: !18, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!31 = !{!23, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 12, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 12, size: 96, align: 32, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !{!11, !32}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 68, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 68, size: 288, align: 32, elements: !42, templateParams: !52)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !{!11, !53, !54}
!53 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!54 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!55 = !{!56, !59, !70, !73, !74, !80, !81}
!56 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 9, type: !57, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!57 = !DISubroutineType(types: !58)
!58 = !{null}
!59 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 43, type: !60, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !64, line: 27, size: 64, align: 16, elements: !65)
!64 = !DIFile(filename: "./shared.h", directory: "")
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !63, file: !64, line: 29, baseType: !25, size: 48, align: 16)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !63, file: !64, line: 30, baseType: !68, size: 16, align: 16, offset: 48)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 35, baseType: !69)
!69 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DISubprogram(name: "distanceColor", linkageName: "\01?distanceColor@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 48, type: !71, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!33}
!73 = !DISubprogram(name: "unifiedShading", linkageName: "\01?unifiedShading@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 55, type: !60, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "ch_hitgroup_a", linkageName: "\01?ch_hitgroup_a@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 75, type: !75, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_a@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!75 = !DISubroutineType(types: !76)
!76 = !{null, !62, !77}
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 71, size: 64, align: 32, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !77, file: !1, line: 71, baseType: !5, size: 64, align: 32)
!80 = !DISubprogram(name: "ch_hitgroup_b", linkageName: "\01?ch_hitgroup_b@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 81, type: !75, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_b@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!81 = !DISubprogram(name: "ch_hitgroup_c", linkageName: "\01?ch_hitgroup_c@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 87, type: !75, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_c@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!82 = !{!83, !85, !88, !98, !100, !104, !120, !122, !124}
!83 = !DIGlobalVariable(name: "worldUp", scope: !56, file: !1, line: 14, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!85 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 37, type: !86, isLocal: true, isDefinition: true, variable: i32 1)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!88 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 3, type: !89, isLocal: false, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !90)
!90 = !{!91}
!91 = !DITemplateTypeParameter(name: "T", type: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !64, line: 19, size: 256, align: 32, elements: !93)
!93 = !{!94, !95, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !92, file: !64, line: 21, baseType: !33, size: 96, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !92, file: !64, line: 22, baseType: !8, size: 32, align: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !92, file: !64, line: 23, baseType: !33, size: 96, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !92, file: !64, line: 24, baseType: !8, size: 32, align: 32, offset: 224)
!98 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 4, type: !99, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 4, size: 32, align: 32, elements: !2)
!100 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 5, type: !101, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!101 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 5, size: 64, align: 16, elements: !2, templateParams: !102)
!102 = !{!103}
!103 = !DITemplateTypeParameter(name: "element", type: !15)
!104 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 6, type: !105, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 288, align: 32, elements: !118)
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 6, size: 288, align: 32, elements: !2, templateParams: !107)
!107 = !{!108}
!108 = !DITemplateTypeParameter(name: "element", type: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !64, line: 38, size: 288, align: 32, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !109, file: !64, line: 40, baseType: !112, size: 288, align: 32)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 288, align: 32, elements: !116)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !64, line: 34, size: 96, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !113, file: !64, line: 36, baseType: !33, size: 96, align: 32)
!116 = !{!117}
!117 = !DISubrange(count: 3)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIGlobalVariable(name: "worldUp.2", linkageName: "\01?worldUp@?1??RayGeneration@@YAXXZ@3V?$vector@M$02@@B.2", scope: !56, file: !1, line: 14, type: !121, isLocal: false, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !84, size: 32, align: 4, offset: 64)
!122 = !DIGlobalVariable(name: "worldUp.1", linkageName: "\01?worldUp@?1??RayGeneration@@YAXXZ@3V?$vector@M$02@@B.1", scope: !56, file: !1, line: 14, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !84, size: 32, align: 4, offset: 32)
!124 = !DIGlobalVariable(name: "worldUp.0", linkageName: "\01?worldUp@?1??RayGeneration@@YAXXZ@3V?$vector@M$02@@B.0", scope: !56, file: !1, line: 14, type: !125, isLocal: false, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !84, size: 32, align: 4)
!126 = !{i32 2, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!129 = !{!"shaders.hlsl", !"#include \22shared.h\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0ARWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    const float3 pos = constants.camPos;\0D\0A    const float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    const float3 worldUp = float3(0, 1, 0);\0D\0A    const float3 right = cross(forward, worldUp);\0D\0A    const float3 up = cross(forward, right);\0D\0A    \0D\0A    const uint2 pixelID = DispatchRaysIndex().xy;\0D\0A    const uint2 dims = DispatchRaysDimensions().xy ;\0D\0A\0D\0A    const float2 halfDims = dims / 2.0f;\0D\0A    const float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    const float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    const float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    const float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    const float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A    RayPayload payload = (RayPayload)0;\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A\0D\0A    colorOut[pixelID] = float16_t4(payload.color.x, payload.color.y, payload.color.z, 1.0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float16_t3(0.0, 0.0, 0.0);\0D\0A}\0D\0A\0D\0Afloat3 distanceColor()\0D\0A{\0D\0A    float i = frac(RayTCurrent());\0D\0A    return float3(i, i, i);\0D\0A}\0D\0A\0D\0A//colors \0D\0Avoid unifiedShading(inout RayPayload payload)\0D\0A{\0D\0A    uint instance_id = InstanceID();\0D\0A    uint prim_index = PrimitiveIndex();\0D\0A    Tringle tri = geomdata[instance_id][prim_index];\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.color = float16_t3(color.x, color.y, color.z);\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_hitgroup_a(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_hitgroup_b(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_hitgroup_c(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    payload.color = distanceColor();\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A"}
!130 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A\0D\0A//#define MAX_RECURSION_LAYERS 16\0D\0A//#define PI 3.14159265f\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float16_t3 color;\0D\0A    uint16_t padd;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A};\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!131 = !{!"shaders.hlsl"}
!132 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"-HV", !"2021", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!133 = !{i32 1, i32 6}
!134 = !{!"lib", i32 6, i32 6}
!135 = !{!136, !141, !144, null}
!136 = !{!137, !139}
!137 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !138}
!138 = !{i32 0, i32 4}
!139 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* bitcast ([0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A" to [0 x %"class.StructuredBuffer<Tringle>"]*), !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !140}
!140 = !{i32 1, i32 36}
!141 = !{!142}
!142 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* bitcast (%dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A" to %"class.RWTexture2D<vector<half, 4> >"*), !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !143}
!143 = !{i32 0, i32 8}
!144 = !{!145}
!145 = !{i32 0, %constants* bitcast (%dx.types.Handle* @constants to %constants*), !"constants", i32 0, i32 0, i32 1, i32 32, null}
!146 = !{i32 0, %struct.ConstantBufferStruct undef, !147, %"class.StructuredBuffer<Tringle>" undef, !152, %struct.Tringle undef, !157, %struct.Vert undef, !159, %struct.RayPayload undef, !161, %struct.BuiltInTriangleIntersectionAttributes undef, !164, %constants undef, !166}
!147 = !{i32 32, !148, !149, !150, !151}
!148 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!149 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!150 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!151 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!152 = !{i32 44, !153, !154}
!153 = !{i32 6, !"h", i32 3, i32 0}
!154 = !{i32 0, !155}
!155 = !{!156}
!156 = !{i32 0, %struct.Tringle undef}
!157 = !{i32 44, !158}
!158 = !{i32 6, !"verts", i32 3, i32 0}
!159 = !{i32 12, !160}
!160 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!161 = !{i32 8, !162, !163}
!162 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 8}
!163 = !{i32 6, !"padd", i32 3, i32 6, i32 7, i32 3}
!164 = !{i32 8, !165}
!165 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!166 = !{i32 32, !167}
!167 = !{i32 6, !"constants", i32 3, i32 0}
!168 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !169, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !171, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_a@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_b@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_c@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173}
!169 = !{!170}
!170 = !{i32 1, !2, !2}
!171 = !{!170, !172}
!172 = !{i32 2, !2, !2}
!173 = !{!170, !172, !174}
!174 = !{i32 0, !2, !2}
!175 = !{null, !"", null, !135, !176}
!176 = !{i32 0, i64 8454192}
!177 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !178}
!178 = !{i32 8, i32 11, i32 6, i32 8, i32 5, !179}
!179 = !{i32 0}
!180 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !181}
!181 = !{i32 8, i32 7, i32 5, !179}
!182 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_a@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_hitgroup_a@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!183 = !{i32 8, i32 10, i32 6, i32 8, i32 7, i32 8, i32 5, !179}
!184 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_b@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_hitgroup_b@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!185 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_hitgroup_c@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_hitgroup_c@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!186 = !DILocation(line: 37, column: 5, scope: !56)
!187 = !DILocation(line: 39, column: 5, scope: !56)
!188 = !DILocation(line: 12, column: 34, scope: !56)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !56, file: !1, line: 12, type: !84)
!190 = !DIExpression(DW_OP_bit_piece, 0, 32)
!191 = !DILocation(line: 12, column: 18, scope: !56)
!192 = !DIExpression(DW_OP_bit_piece, 32, 32)
!193 = !DIExpression(DW_OP_bit_piece, 64, 32)
!194 = !DILocation(line: 13, column: 48, scope: !56)
!195 = !DILocation(line: 13, column: 55, scope: !56)
!196 = !DILocation(line: 13, column: 28, scope: !56)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !56, file: !1, line: 13, type: !84)
!198 = !DILocation(line: 13, column: 18, scope: !56)
!199 = !DILocation(line: 15, column: 26, scope: !56)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !56, file: !1, line: 15, type: !84)
!201 = !DILocation(line: 15, column: 18, scope: !56)
!202 = !DILocation(line: 16, column: 23, scope: !56)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !56, file: !1, line: 16, type: !84)
!204 = !DILocation(line: 16, column: 18, scope: !56)
!205 = !DILocation(line: 18, column: 27, scope: !56)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !56, file: !1, line: 18, type: !207)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 18, baseType: !209)
!209 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 18, size: 64, align: 32, elements: !210, templateParams: !213)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !209, file: !1, line: 18, baseType: !87, size: 32, align: 32, flags: DIFlagPublic)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !209, file: !1, line: 18, baseType: !87, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!213 = !{!214, !12}
!214 = !DITemplateTypeParameter(name: "element", type: !87)
!215 = !DILocation(line: 18, column: 17, scope: !56)
!216 = !DILocation(line: 19, column: 24, scope: !56)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !56, file: !1, line: 19, type: !207)
!218 = !DILocation(line: 19, column: 17, scope: !56)
!219 = !DILocation(line: 21, column: 29, scope: !56)
!220 = !DILocation(line: 21, column: 34, scope: !56)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !56, file: !1, line: 21, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!223 = !DILocation(line: 21, column: 18, scope: !56)
!224 = !DILocation(line: 22, column: 37, scope: !56)
!225 = !DILocation(line: 22, column: 41, scope: !56)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !56, file: !1, line: 22, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!228 = !DIExpression()
!229 = !DILocation(line: 22, column: 17, scope: !56)
!230 = !DILocation(line: 24, column: 48, scope: !56)
!231 = !DILocation(line: 24, column: 46, scope: !56)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !56, file: !1, line: 24, type: !227)
!233 = !DILocation(line: 24, column: 17, scope: !56)
!234 = !DILocation(line: 25, column: 49, scope: !56)
!235 = !DILocation(line: 26, column: 37, scope: !56)
!236 = !DILocation(line: 26, column: 53, scope: !56)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !56, file: !1, line: 26, type: !222)
!238 = !DILocation(line: 26, column: 18, scope: !56)
!239 = !DILocation(line: 27, column: 55, scope: !56)
!240 = !DILocation(line: 27, column: 83, scope: !56)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !56, file: !1, line: 27, type: !84)
!242 = !DILocation(line: 27, column: 18, scope: !56)
!243 = !DILocation(line: 31, column: 43, scope: !56)
!244 = !DILocation(line: 27, column: 77, scope: !56)
!245 = !DILocation(line: 31, column: 21, scope: !56)
!246 = !DILocation(line: 35, column: 5, scope: !56)
!247 = !DILocation(line: 35, column: 38, scope: !56)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !56, file: !1, line: 35, type: !63)
!249 = !DILocation(line: 35, column: 16, scope: !56)
!250 = !DILocation(line: 39, column: 36, scope: !56)
!251 = !DILocation(line: 39, column: 53, scope: !56)
!252 = !DILocation(line: 39, column: 70, scope: !56)
!253 = !DILocation(line: 39, column: 23, scope: !56)
!254 = !DILocation(line: 40, column: 1, scope: !56)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !59, file: !1, line: 43, type: !63)
!256 = !DIExpression(DW_OP_bit_piece, 0, 48)
!257 = !DILocation(line: 43, column: 28, scope: !59)
!258 = !DILocation(line: 46, column: 1, scope: !59)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !74, file: !1, line: 75, type: !77)
!260 = !DILocation(line: 75, column: 87, scope: !74)
!261 = !DILocation(line: 57, column: 24, scope: !73, inlinedAt: !262)
!262 = distinct !DILocation(line: 77, column: 5, scope: !74)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instance_id", scope: !73, file: !1, line: 57, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 57, baseType: !87)
!265 = !DILocation(line: 57, column: 10, scope: !73, inlinedAt: !262)
!266 = !DILocation(line: 58, column: 23, scope: !73, inlinedAt: !262)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prim_index", scope: !73, file: !1, line: 58, type: !264)
!268 = !DILocation(line: 58, column: 10, scope: !73, inlinedAt: !262)
!269 = !DILocation(line: 59, column: 19, scope: !73, inlinedAt: !262)
!270 = !{!271}
