#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Use native low precision
;
; shader debug name: cf5a1f0a2b2f6e90f33db4fbe093ac3b.pdb
; shader hash: cf5a1f0a2b2f6e90f33db4fbe093ac3b
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; constants                         cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !55, globals: !85)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !22, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 16, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 16, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 26, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 26, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 48, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 48, size: 64, align: 16, elements: !24, templateParams: !30)
!24 = !{!25, !27, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 48, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!30 = !{!31, !32}
!31 = !DITemplateTypeParameter(name: "element", type: !26)
!32 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 44, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 44, size: 48, align: 16, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 44, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 44, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 44, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!39 = !{!31, !13}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 70, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 70, size: 288, align: 32, elements: !42, templateParams: !52)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 70, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !{!12, !53, !54}
!53 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!54 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!55 = !{!56, !59, !70, !73, !74, !75, !81, !82, !83, !84}
!56 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 13, type: !57, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!57 = !DISubroutineType(types: !58)
!58 = !{null}
!59 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 52, type: !60, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !64, line: 27, size: 64, align: 16, elements: !65)
!64 = !DIFile(filename: "./shared.h", directory: "")
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !63, file: !64, line: 29, baseType: !33, size: 48, align: 16)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !63, file: !64, line: 30, baseType: !68, size: 16, align: 16, offset: 48)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 44, baseType: !69)
!69 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 58, type: !71, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!4}
!73 = !DISubprogram(name: "distanceColor", linkageName: "\01?distanceColor@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 73, type: !71, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "unifiedShading", linkageName: "\01?unifiedShading@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 82, type: !60, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubprogram(name: "ch_normalcolors", linkageName: "\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 114, type: !76, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!76 = !DISubroutineType(types: !77)
!77 = !{null, !62, !78}
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 98, size: 64, align: 32, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !78, file: !1, line: 98, baseType: !16, size: 64, align: 32)
!81 = !DISubprogram(name: "ch_red", linkageName: "\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 137, type: !76, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!82 = !DISubprogram(name: "ch_checkerboard", linkageName: "\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 161, type: !76, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!83 = !DISubprogram(name: "ch_mirror", linkageName: "\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 217, type: !76, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!84 = !DISubprogram(name: "ch_skybox", linkageName: "\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 241, type: !76, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!85 = !{!86, !89, !99, !103, !105}
!86 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 46, type: !87, isLocal: true, isDefinition: true, variable: i32 1)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!89 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 7, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !91)
!91 = !{!92}
!92 = !DITemplateTypeParameter(name: "T", type: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !64, line: 19, size: 256, align: 32, elements: !94)
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !93, file: !64, line: 21, baseType: !4, size: 96, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !93, file: !64, line: 22, baseType: !8, size: 32, align: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !93, file: !64, line: 23, baseType: !4, size: 96, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !93, file: !64, line: 24, baseType: !8, size: 32, align: 32, offset: 224)
!99 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 8, type: !100, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 8, size: 64, align: 16, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !23)
!103 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 9, type: !104, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 9, size: 32, align: 32, elements: !2)
!105 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 10, type: !106, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 288, align: 32, elements: !119)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 10, size: 288, align: 32, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "element", type: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !64, line: 38, size: 288, align: 32, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !110, file: !64, line: 40, baseType: !113, size: 288, align: 32)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 288, align: 32, elements: !117)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !64, line: 34, size: 96, align: 32, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !114, file: !64, line: 36, baseType: !4, size: 96, align: 32)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!124 = !{!"shaders.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0ARWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(forward, right);\0D\0A     \0D\0A    \0D\0A    \0D\0A    uint2 pixelID = DispatchRaysIndex().xy;\0D\0A    uint2 dims = DispatchRaysDimensions().xy ;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A    RayPayload payload = (RayPayload)0;\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A    colorOut[pixelID] = float16_t4(payload.color.x, payload.color.y, payload.color.z, 1.0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float16_t3(0.0, 0.0, 0.0);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal()\0D\0A{\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    return mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A}\0D\0A\0D\0Afloat3 distanceColor()\0D\0A{\0D\0A    float i = frac(RayTCurrent());\0D\0A    return float3(i, i, i);\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0Avoid unifiedShading(inout RayPayload payload)\0D\0A{\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.color = float16_t3(color.x, color.y, color.z);\0D\0A    return;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_normalcolors(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A    return;\0D\0A\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.color = float16_t3(color.x, color.y, color.z);\0D\0A    return;\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_red(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A    return;\0D\0A    (void) attrib;\0D\0A    //payload.color = float16_t3(0.0, 0.0, 1.0);\0D\0A    //return;\0D\0A    payload.color = float16_t3(1, 0, 0);\0D\0A    return;\0D\0A    //Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_checkerboard(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A    return;\0D\0A    \0D\0A    \0D\0A    // payload.color = distanceColor();\0D\0A    // payload.color[InstanceID()] = 1.0;\0D\0A    // return;\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.color = float16_t3(color.x, color.y, color.z);\0D\0A    return;\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A    // //const float  = 10;\0D\0A    \0D\0A    // float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\0D\0A    // int3 xyz = (int3)select(pos < 1, pos -1, pos);\0D\0A    // bool3 evenSquare = xyz%2;\0D\0A    \0D\0A    // bool colorIdx = evenSquare.x ^ evenSquare.y ^ evenSquare.z;// ((xyz.x + xyz.y)%2);\0D\0A    // // colorIdx = colorIdx | (xyz.z%2);\0D\0A    \0D\0A    // // int3 xyz = pos < 1 ? pos : pos-1;\0D\0A    // // xy.x = pos.x < 0 ? pos.x - 1.0f : pos.x;\0D\0A    // // xy.y = pos.z < 0 ? pos.z - 1.0f : pos.z;\0D\0A    \0D\0A    // // bool colorIdx = 1;//((xy.x + xy.y) % 2) ? true : false;\0D\0A\0D\0A\0D\0A    \0D\0A\0D\0A    // float16_t3 color = colorIdx ? float16_t3(0.9, 0.9, 0.9) : float16_t3(0.4, 0.4, 0.4);\0D\0A\0D\0A    // payload.color = color;\0D\0A    return;\0D\0A}\0D\0A \0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_mirror(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A    return;\0D\0A    (void) attrib;\0D\0A    \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    float3 normal = getWorldSpaceNormal();\0D\0A    float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = reflected;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    RayPayload payload2 = (RayPayload) 0;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload2);\0D\0A    payload.color = (payload2.color * 0.7) + float16_t3(0.3, 0.3, 0.3);\0D\0A    return;\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_skybox(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    unifiedShading(payload);\0D\0A    return;\0D\0A    (void)attrib;\0D\0A    payload.color = float16_t3(0.211765, 0.780392, 0.94902);\0D\0A}\0D\0A"}
!125 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A\0D\0A//#define MAX_RECURSION_LAYERS 16\0D\0A//#define PI 3.14159265f\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float16_t3 color;\0D\0A    uint16_t padd;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A};\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!126 = !{!"shaders.hlsl"}
!127 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"-HV", !"2021", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!128 = !{i32 1, i32 6}
!129 = !{!"lib", i32 6, i32 6}
!130 = !{!131, !136, !139, null}
!131 = !{!132, !134}
!132 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !133}
!133 = !{i32 0, i32 4}
!134 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* bitcast ([0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A" to [0 x %"class.StructuredBuffer<Tringle>"]*), !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !135}
!135 = !{i32 1, i32 36}
!136 = !{!137}
!137 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* bitcast (%dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A" to %"class.RWTexture2D<vector<half, 4> >"*), !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !138}
!138 = !{i32 0, i32 8}
!139 = !{!140}
!140 = !{i32 0, %constants* bitcast (%dx.types.Handle* @constants to %constants*), !"constants", i32 0, i32 0, i32 1, i32 32, null}
!141 = !{i32 0, %struct.ConstantBufferStruct undef, !142, %"class.StructuredBuffer<Tringle>" undef, !147, %struct.Tringle undef, !152, %struct.Vert undef, !154, %struct.RayPayload undef, !156, %struct.BuiltInTriangleIntersectionAttributes undef, !159, %constants undef, !161}
!142 = !{i32 32, !143, !144, !145, !146}
!143 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!144 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!145 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!146 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!147 = !{i32 44, !148, !149}
!148 = !{i32 6, !"h", i32 3, i32 0}
!149 = !{i32 0, !150}
!150 = !{!151}
!151 = !{i32 0, %struct.Tringle undef}
!152 = !{i32 44, !153}
!153 = !{i32 6, !"verts", i32 3, i32 0}
!154 = !{i32 12, !155}
!155 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!156 = !{i32 8, !157, !158}
!157 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 8}
!158 = !{i32 6, !"padd", i32 3, i32 6, i32 7, i32 3}
!159 = !{i32 8, !160}
!160 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!161 = !{i32 32, !162}
!162 = !{i32 6, !"constants", i32 3, i32 0}
!163 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !164, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !166, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !168, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !168, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !168, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !168, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !168}
!164 = !{!165}
!165 = !{i32 1, !2, !2}
!166 = !{!165, !167}
!167 = !{i32 2, !2, !2}
!168 = !{!165, !167, !169}
!169 = !{i32 0, !2, !2}
!170 = !{null, !"", null, !130, !171}
!171 = !{i32 0, i64 8454192}
!172 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !173}
!173 = !{i32 8, i32 11, i32 6, i32 8, i32 5, !174}
!174 = !{i32 0}
!175 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !176}
!176 = !{i32 8, i32 7, i32 5, !174}
!177 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !178}
!178 = !{i32 8, i32 10, i32 6, i32 8, i32 7, i32 8, i32 5, !174}
!179 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !178}
!180 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !178}
!181 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !178}
!182 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !178}
!183 = !DILocation(line: 46, column: 5, scope: !56)
!184 = !DILocation(line: 48, column: 5, scope: !56)
!185 = !DILocation(line: 16, column: 28, scope: !56)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !56, file: !1, line: 16, type: !4)
!187 = !DIExpression(DW_OP_bit_piece, 0, 32)
!188 = !DILocation(line: 16, column: 12, scope: !56)
!189 = !DIExpression(DW_OP_bit_piece, 32, 32)
!190 = !DIExpression(DW_OP_bit_piece, 64, 32)
!191 = !DILocation(line: 17, column: 42, scope: !56)
!192 = !DILocation(line: 17, column: 49, scope: !56)
!193 = !DILocation(line: 17, column: 22, scope: !56)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !56, file: !1, line: 17, type: !4)
!195 = !DILocation(line: 17, column: 12, scope: !56)
!196 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !56, file: !1, line: 18, type: !4)
!197 = !DIExpression()
!198 = !DILocation(line: 18, column: 12, scope: !56)
!199 = !DILocation(line: 19, column: 20, scope: !56)
!200 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !56, file: !1, line: 19, type: !4)
!201 = !DILocation(line: 19, column: 12, scope: !56)
!202 = !DILocation(line: 20, column: 17, scope: !56)
!203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !56, file: !1, line: 20, type: !4)
!204 = !DILocation(line: 20, column: 12, scope: !56)
!205 = !DILocation(line: 24, column: 21, scope: !56)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !56, file: !1, line: 24, type: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 24, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 24, size: 64, align: 32, elements: !209, templateParams: !212)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !208, file: !1, line: 24, baseType: !88, size: 32, align: 32, flags: DIFlagPublic)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !208, file: !1, line: 24, baseType: !88, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!212 = !{!213, !21}
!213 = !DITemplateTypeParameter(name: "element", type: !88)
!214 = !DILocation(line: 24, column: 11, scope: !56)
!215 = !DILocation(line: 25, column: 18, scope: !56)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !56, file: !1, line: 25, type: !207)
!217 = !DILocation(line: 25, column: 11, scope: !56)
!218 = !DILocation(line: 26, column: 23, scope: !56)
!219 = !DILocation(line: 26, column: 28, scope: !56)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !56, file: !1, line: 26, type: !15)
!221 = !DILocation(line: 26, column: 12, scope: !56)
!222 = !DILocation(line: 27, column: 31, scope: !56)
!223 = !DILocation(line: 27, column: 35, scope: !56)
!224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !56, file: !1, line: 27, type: !8)
!225 = !DILocation(line: 27, column: 11, scope: !56)
!226 = !DILocation(line: 29, column: 42, scope: !56)
!227 = !DILocation(line: 29, column: 40, scope: !56)
!228 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !56, file: !1, line: 29, type: !8)
!229 = !DILocation(line: 29, column: 11, scope: !56)
!230 = !DILocation(line: 31, column: 43, scope: !56)
!231 = !DILocation(line: 33, column: 31, scope: !56)
!232 = !DILocation(line: 33, column: 47, scope: !56)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !56, file: !1, line: 33, type: !15)
!234 = !DILocation(line: 33, column: 12, scope: !56)
!235 = !DILocation(line: 36, column: 49, scope: !56)
!236 = !DILocation(line: 36, column: 77, scope: !56)
!237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !56, file: !1, line: 36, type: !4)
!238 = !DILocation(line: 36, column: 12, scope: !56)
!239 = !DILocation(line: 40, column: 43, scope: !56)
!240 = !DILocation(line: 36, column: 71, scope: !56)
!241 = !DILocation(line: 40, column: 21, scope: !56)
!242 = !DILocation(line: 44, column: 5, scope: !56)
!243 = !DILocation(line: 44, column: 38, scope: !56)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !56, file: !1, line: 44, type: !63)
!245 = !DILocation(line: 44, column: 16, scope: !56)
!246 = !DILocation(line: 48, column: 36, scope: !56)
!247 = !DILocation(line: 48, column: 53, scope: !56)
!248 = !DILocation(line: 48, column: 70, scope: !56)
!249 = !DILocation(line: 48, column: 23, scope: !56)
!250 = !DILocation(line: 49, column: 1, scope: !56)
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !59, file: !1, line: 52, type: !63)
!252 = !DIExpression(DW_OP_bit_piece, 0, 48)
!253 = !DILocation(line: 52, column: 28, scope: !59)
!254 = !DILocation(line: 55, column: 1, scope: !59)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !75, file: !1, line: 114, type: !78)
!256 = !DILocation(line: 114, column: 89, scope: !75)
!257 = !DILocation(line: 84, column: 28, scope: !74, inlinedAt: !258)
!258 = distinct !DILocation(line: 116, column: 5, scope: !75)
!259 = !DILocation(line: 84, column: 42, scope: !74, inlinedAt: !258)
!260 = !DILocation(line: 84, column: 19, scope: !74, inlinedAt: !258)
!261 = !{!262}
!262 = distinct !{!262, !263, !"\01?unifiedShading@@YAXURayPayload@@@Z: %payload"}
!263 = distinct !{!263, !"\01?unifiedShading@@YAXURayPayload@@@Z"}
!264 = !DILocation(line: 87, column: 29, scope: !74, inlinedAt: !258)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !74, file: !1, line: 87, type: !4)
!266 = !DILocation(line: 87, column: 12, scope: !74, inlinedAt: !258)
!267 = !DILocation(line: 88, column: 29, scope: !74, inlinedAt: !258)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !74, file: !1, line: 88, type: !4)
!269 = !DILocation(line: 88, column: 12, scope: !74, inlinedAt: !258)
