#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Typed UAV Load Additional Formats
;       Use native low precision
;
; shader debug name: 7f6157c123746b6c572b0fe58e27f0c9.pdb
; shader hash: 7f6157c123746b6c572b0fe58e27f0c9
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;           uint frameNumber;                         ; Offset:   32
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !89, globals: !198)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !6, !15, !22, !31, !40, !48, !70, !85, !87}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 9, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 9, size: 96, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !10, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !5)
!14 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 3)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 59, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 59, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 59, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 59, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!13, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 82, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 82, size: 48, align: 16, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 82, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 82, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 82, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !14}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 99, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 99, size: 64, align: 16, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 99, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 99, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 99, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 99, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!38 = !{!30, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 116, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 116, size: 128, align: 32, elements: !42, templateParams: !47)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 116, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 116, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 116, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !41, file: !1, line: 116, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !{!13, !39}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 118, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 118, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 118, baseType: !5, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 4)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 164, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 164, size: 288, align: 32, elements: !72, templateParams: !82)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !71, file: !1, line: 164, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!82 = !{!13, !83, !84}
!83 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 3)
!84 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 3)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 115, baseType: !86)
!86 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 16, baseType: !88)
!88 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!89 = !{!90, !94, !97, !100, !103, !106, !107, !110, !116, !119, !122, !141, !144, !155, !168, !171, !174, !180, !181, !182, !183, !184, !185, !195}
!90 = !DISubprogram(name: "Xchi", linkageName: "\01?Xchi@@YAMM@Z", scope: !91, file: !91, line: 4, type: !92, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DIFile(filename: "./CookTorrance.hlsl", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!5, !5}
!94 = !DISubprogram(name: "D", linkageName: "\01?D@@YAMV?$vector@M$02@@00M@Z", scope: !91, file: !91, line: 11, type: !95, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!5, !6, !6, !6, !5}
!97 = !DISubprogram(name: "fDialectric", linkageName: "\01?fDialectric@@YAMMMV?$vector@M$02@@0@Z", scope: !91, file: !91, line: 24, type: !98, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{!5, !5, !5, !6, !6}
!100 = !DISubprogram(name: "fresnelSchlick", linkageName: "\01?fresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !91, file: !91, line: 33, type: !101, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubroutineType(types: !102)
!102 = !{!6, !5, !6}
!103 = !DISubprogram(name: "fConductor", linkageName: "\01?fConductor@@YAMMV?$vector@M$02@@0@Z", scope: !91, file: !91, line: 40, type: !104, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!5, !5, !6, !6}
!106 = !DISubprogram(name: "Gp", linkageName: "\01?Gp@@YAMV?$vector@M$02@@00M@Z", scope: !91, file: !91, line: 50, type: !95, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubprogram(name: "G", linkageName: "\01?G@@YAMV?$vector@M$02@@000M@Z", scope: !91, file: !91, line: 60, type: !108, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!108 = !DISubroutineType(types: !109)
!109 = !{!5, !6, !6, !6, !6, !5}
!110 = !DISubprogram(name: "CookTorance", linkageName: "\01?CookTorance@@YA?AV?$vector@M$02@@V1@00MV1@AIAV1@@Z", scope: !91, file: !91, line: 66, type: !111, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!111 = !DISubroutineType(types: !112)
!112 = !{!6, !6, !6, !6, !5, !113, !114}
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !6)
!116 = !DISubprogram(name: "numTriangles", linkageName: "\01?numTriangles@@YAIXZ", scope: !1, file: !1, line: 40, type: !117, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!117 = !DISubroutineType(types: !118)
!118 = !{!85}
!119 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 48, type: !120, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DISubprogram(name: "doTransform", linkageName: "\01?doTransform@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$02@@@Z", scope: !1, file: !1, line: 114, type: !123, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!123 = !DISubroutineType(types: !124)
!124 = !{!6, !6, !125}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 112, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 112, size: 384, align: 32, elements: !127, templateParams: !140)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !126, file: !1, line: 112, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!140 = !{!13, !68, !84}
!141 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 151, type: !142, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false)
!142 = !DISubroutineType(types: !143)
!143 = !{!6}
!144 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 173, type: !145, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147}
!147 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !149, line: 28, size: 256, align: 32, elements: !150)
!149 = !DIFile(filename: "./shared.h", directory: "")
!150 = !{!151, !152, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !148, file: !149, line: 30, baseType: !6, size: 96, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !148, file: !149, line: 31, baseType: !85, size: 32, align: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !148, file: !149, line: 32, baseType: !6, size: 96, align: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !148, file: !149, line: 33, baseType: !85, size: 32, align: 32, offset: 224)
!155 = !DISubprogram(name: "getColor", linkageName: "\01?getColor@@YA?AV?$vector@M$02@@UMaterial@@@Z", scope: !1, file: !1, line: 180, type: !156, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false)
!156 = !DISubroutineType(types: !157)
!157 = !{!6, !158}
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !149, line: 45, size: 384, align: 32, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !158, file: !149, line: 47, baseType: !6, size: 96, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "smooth", scope: !158, file: !149, line: 48, baseType: !5, size: 32, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !158, file: !149, line: 49, baseType: !6, size: 96, align: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !158, file: !149, line: 50, baseType: !5, size: 32, align: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !158, file: !149, line: 51, baseType: !5, size: 32, align: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !158, file: !149, line: 52, baseType: !5, size: 32, align: 32, offset: 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "metal", scope: !158, file: !149, line: 53, baseType: !5, size: 32, align: 32, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "indicator", scope: !158, file: !149, line: 54, baseType: !85, size: 32, align: 32, offset: 352)
!168 = !DISubprogram(name: "generateNewRayDir", linkageName: "\01?generateNewRayDir@@YA?AV?$vector@M$02@@V1@0@Z", scope: !1, file: !1, line: 194, type: !169, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false)
!169 = !DISubroutineType(types: !170)
!170 = !{!6, !6, !6}
!171 = !DISubprogram(name: "UnifiedShading", linkageName: "\01?UnifiedShading@@YAXURayPayload@@UMaterial@@@Z", scope: !1, file: !1, line: 220, type: !172, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !147, !158}
!174 = !DISubprogram(name: "ch_white", linkageName: "\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 292, type: !175, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!175 = !DISubroutineType(types: !176)
!176 = !{null, !147, !177}
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 288, size: 64, align: 32, elements: !178)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !177, file: !1, line: 288, baseType: !16, size: 64, align: 32)
!180 = !DISubprogram(name: "ch_shinyred", linkageName: "\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 310, type: !175, isLocal: false, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!181 = !DISubprogram(name: "ch_light", linkageName: "\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 328, type: !175, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!182 = !DISubprogram(name: "ch_metal", linkageName: "\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 346, type: !175, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!183 = !DISubprogram(name: "ch_mirror", linkageName: "\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 364, type: !175, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!184 = !DISubprogram(name: "ch_checkered", linkageName: "\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 382, type: !175, isLocal: false, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!185 = !DISubprogram(name: "randFloat01", linkageName: "\01?randFloat01@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 24, type: !186, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!186 = !DISubroutineType(types: !187)
!187 = !{!5, !188}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 57, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 57, size: 64, align: 32, elements: !190, templateParams: !193)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !189, file: !1, line: 57, baseType: !86, size: 32, align: 32, flags: DIFlagPublic)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !189, file: !1, line: 57, baseType: !86, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!193 = !{!194, !21}
!194 = !DITemplateTypeParameter(name: "element", type: !86)
!195 = !DISubprogram(name: "MWC64X", linkageName: "\01?MWC64X@@YAIV?$vector@I$01@@@Z", scope: !1, file: !1, line: 14, type: !196, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!196 = !DISubroutineType(types: !197)
!197 = !{!85, !188}
!198 = !{!199, !201, !212, !216, !220, !222}
!199 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 96, type: !200, isLocal: true, isDefinition: true, variable: i32 1)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!201 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 8, type: !202, isLocal: false, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !203)
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "T", type: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !149, line: 19, size: 288, align: 32, elements: !206)
!206 = !{!207, !208, !209, !210, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !205, file: !149, line: 21, baseType: !6, size: 96, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !205, file: !149, line: 22, baseType: !5, size: 32, align: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !205, file: !149, line: 23, baseType: !6, size: 96, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !205, file: !149, line: 24, baseType: !5, size: 32, align: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "frameNumber", scope: !205, file: !149, line: 25, baseType: !85, size: 32, align: 32, offset: 256)
!212 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 9, type: !213, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!213 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 9, size: 64, align: 16, elements: !2, templateParams: !214)
!214 = !{!215}
!215 = !DITemplateTypeParameter(name: "element", type: !32)
!216 = !DIGlobalVariable(name: "randBuff", linkageName: "\01?randBuff@@3V?$RWTexture2D@_K@@A", scope: !0, file: !1, line: 10, type: !217, isLocal: false, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned long long>", file: !1, line: 10, size: 64, align: 64, elements: !2, templateParams: !218)
!218 = !{!219}
!219 = !DITemplateTypeParameter(name: "element", type: !88)
!220 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 11, type: !221, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 11, size: 32, align: 32, elements: !2)
!222 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 12, type: !223, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 288, align: 32, elements: !236)
!224 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 12, size: 288, align: 32, elements: !2, templateParams: !225)
!225 = !{!226}
!226 = !DITemplateTypeParameter(name: "element", type: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !149, line: 40, size: 288, align: 32, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !227, file: !149, line: 42, baseType: !230, size: 288, align: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 288, align: 32, elements: !234)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !149, line: 36, size: 96, align: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !231, file: !149, line: 38, baseType: !6, size: 96, align: 32)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !{!237}
!237 = !DISubrange(count: 1)
!238 = !{i32 2, !"Dwarf Version", i32 4}
!239 = !{i32 2, !"Debug Info Version", i32 3}
!240 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
