#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       64-Bit integer
;       Use native low precision
;
; shader debug name: b0221e884840d1fb7dbf91b90bd46c24.pdb
; shader hash: b0221e884840d1fb7dbf91b90bd46c24
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;           uint frameNumber;                         ; Offset:   32
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    36
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;           float3 norm;                              ; Offset:   12
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    72
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !81, globals: !195)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !6, !15, !22, !31, !40, !48, !70, !77, !79}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 9, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 9, size: 96, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !10, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !5)
!14 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 3)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 59, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 59, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 59, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 59, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!13, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 96, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 96, size: 48, align: 16, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 96, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 96, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 96, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !14}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 109, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 109, size: 64, align: 16, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 109, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 109, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 109, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 109, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!38 = !{!30, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 130, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 130, size: 128, align: 32, elements: !42, templateParams: !47)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 130, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 130, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 130, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !41, file: !1, line: 130, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !{!13, !39}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 132, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 132, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 132, baseType: !5, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 4)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 199, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 199, size: 64, align: 32, elements: !72, templateParams: !75)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !71, file: !1, line: 199, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !71, file: !1, line: 199, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !{!76, !21}
!76 = !DITemplateTypeParameter(name: "element", type: !4)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 115, baseType: !78)
!78 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 16, baseType: !80)
!80 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!81 = !{!82, !86, !89, !92, !95, !98, !99, !102, !108, !111, !114, !134, !137, !150, !163, !166, !169, !175, !176, !177, !178, !179, !180, !181, !191, !192}
!82 = !DISubprogram(name: "Xchi", linkageName: "\01?Xchi@@YAMM@Z", scope: !83, file: !83, line: 4, type: !84, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DIFile(filename: "./CookTorrance.hlsl", directory: "")
!84 = !DISubroutineType(types: !85)
!85 = !{!5, !5}
!86 = !DISubprogram(name: "D", linkageName: "\01?D@@YAMV?$vector@M$02@@00M@Z", scope: !83, file: !83, line: 11, type: !87, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!5, !6, !6, !6, !5}
!89 = !DISubprogram(name: "fDialectric", linkageName: "\01?fDialectric@@YAMMMV?$vector@M$02@@0@Z", scope: !83, file: !83, line: 24, type: !90, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!5, !5, !5, !6, !6}
!92 = !DISubprogram(name: "fresnelSchlick", linkageName: "\01?fresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !83, file: !83, line: 33, type: !93, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DISubroutineType(types: !94)
!94 = !{!6, !5, !6}
!95 = !DISubprogram(name: "fConductor", linkageName: "\01?fConductor@@YAMMV?$vector@M$02@@0@Z", scope: !83, file: !83, line: 40, type: !96, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!96 = !DISubroutineType(types: !97)
!97 = !{!5, !5, !6, !6}
!98 = !DISubprogram(name: "Gp", linkageName: "\01?Gp@@YAMV?$vector@M$02@@00M@Z", scope: !83, file: !83, line: 50, type: !87, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!99 = !DISubprogram(name: "G", linkageName: "\01?G@@YAMV?$vector@M$02@@000M@Z", scope: !83, file: !83, line: 60, type: !100, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!5, !6, !6, !6, !6, !5}
!102 = !DISubprogram(name: "CookTorance", linkageName: "\01?CookTorance@@YA?AV?$vector@M$02@@V1@00MV1@AIAV1@@Z", scope: !83, file: !83, line: 66, type: !103, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!6, !6, !6, !6, !5, !105, !106}
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !6)
!108 = !DISubprogram(name: "numTriangles", linkageName: "\01?numTriangles@@YAIXZ", scope: !1, file: !1, line: 40, type: !109, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!77}
!111 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 48, type: !112, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!112 = !DISubroutineType(types: !113)
!113 = !{null}
!114 = !DISubprogram(name: "doTransform", linkageName: "\01?doTransform@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$02@@@Z", scope: !1, file: !1, line: 128, type: !115, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false)
!115 = !DISubroutineType(types: !116)
!116 = !{!6, !6, !117}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 126, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 126, size: 384, align: 32, elements: !119, templateParams: !132)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !118, file: !1, line: 126, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!132 = !{!13, !68, !133}
!133 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 3)
!134 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 146, type: !135, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!6, !15}
!137 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 186, type: !138, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140}
!140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !142, line: 28, size: 256, align: 32, elements: !143)
!142 = !DIFile(filename: "./shared.h", directory: "")
!143 = !{!144, !145, !146, !147, !149}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !141, file: !142, line: 30, baseType: !6, size: 96, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !141, file: !142, line: 31, baseType: !77, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !142, line: 32, baseType: !6, size: 96, align: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !141, file: !142, line: 33, baseType: !148, size: 31, align: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1, line: 95, baseType: !78)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "insideGlass", scope: !141, file: !142, line: 34, baseType: !148, size: 1, align: 32, offset: 255)
!150 = !DISubprogram(name: "getColor", linkageName: "\01?getColor@@YA?AV?$vector@M$02@@UMaterial@@V1@@Z", scope: !1, file: !1, line: 193, type: !151, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false)
!151 = !DISubroutineType(types: !152)
!152 = !{!6, !153, !6}
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !142, line: 48, size: 384, align: 32, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !153, file: !142, line: 50, baseType: !6, size: 96, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "smooth", scope: !153, file: !142, line: 51, baseType: !5, size: 32, align: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !153, file: !142, line: 52, baseType: !6, size: 96, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !153, file: !142, line: 53, baseType: !5, size: 32, align: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !153, file: !142, line: 54, baseType: !5, size: 32, align: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ior", scope: !153, file: !142, line: 55, baseType: !5, size: 32, align: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "metal", scope: !153, file: !142, line: 56, baseType: !5, size: 32, align: 32, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "indicator", scope: !153, file: !142, line: 57, baseType: !77, size: 32, align: 32, offset: 352)
!163 = !DISubprogram(name: "generateNewRayDir", linkageName: "\01?generateNewRayDir@@YA?AV?$vector@M$02@@V1@0@Z", scope: !1, file: !1, line: 216, type: !164, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false)
!164 = !DISubroutineType(types: !165)
!165 = !{!6, !6, !6}
!166 = !DISubprogram(name: "UnifiedShading", linkageName: "\01?UnifiedShading@@YAXURayPayload@@UMaterial@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 243, type: !167, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !140, !153, !15}
!169 = !DISubprogram(name: "ch_white", linkageName: "\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 336, type: !170, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!170 = !DISubroutineType(types: !171)
!171 = !{null, !140, !172}
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 332, size: 64, align: 32, elements: !173)
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !172, file: !1, line: 332, baseType: !16, size: 64, align: 32)
!175 = !DISubprogram(name: "ch_shinyred", linkageName: "\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 352, type: !170, isLocal: false, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!176 = !DISubprogram(name: "ch_light", linkageName: "\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 368, type: !170, isLocal: false, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!177 = !DISubprogram(name: "ch_metal", linkageName: "\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 384, type: !170, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!178 = !DISubprogram(name: "ch_mirror", linkageName: "\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 400, type: !170, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!179 = !DISubprogram(name: "ch_checkered", linkageName: "\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 416, type: !170, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!180 = !DISubprogram(name: "ch_glass", linkageName: "\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 432, type: !170, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!181 = !DISubprogram(name: "randFloat0505", linkageName: "\01?randFloat0505@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 34, type: !182, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!182 = !DISubroutineType(types: !183)
!183 = !{!5, !184}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 57, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 57, size: 64, align: 32, elements: !186, templateParams: !189)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !185, file: !1, line: 57, baseType: !78, size: 32, align: 32, flags: DIFlagPublic)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !185, file: !1, line: 57, baseType: !78, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!189 = !{!190, !21}
!190 = !DITemplateTypeParameter(name: "element", type: !78)
!191 = !DISubprogram(name: "randFloat01", linkageName: "\01?randFloat01@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 24, type: !182, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!192 = !DISubprogram(name: "MWC64X", linkageName: "\01?MWC64X@@YAIV?$vector@I$01@@@Z", scope: !1, file: !1, line: 14, type: !193, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!193 = !DISubroutineType(types: !194)
!194 = !{!77, !184}
!195 = !{!196, !198, !209, !213, !217, !219}
!196 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 102, type: !197, isLocal: true, isDefinition: true, variable: i32 1)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!198 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 8, type: !199, isLocal: false, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !200)
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "T", type: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !142, line: 19, size: 288, align: 32, elements: !203)
!203 = !{!204, !205, !206, !207, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !202, file: !142, line: 21, baseType: !6, size: 96, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !202, file: !142, line: 22, baseType: !5, size: 32, align: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !202, file: !142, line: 23, baseType: !6, size: 96, align: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !202, file: !142, line: 24, baseType: !5, size: 32, align: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "frameNumber", scope: !202, file: !142, line: 25, baseType: !77, size: 32, align: 32, offset: 256)
!209 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 9, type: !210, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!210 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 9, size: 64, align: 16, elements: !2, templateParams: !211)
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "element", type: !32)
!213 = !DIGlobalVariable(name: "randBuff", linkageName: "\01?randBuff@@3V?$RWTexture2D@_K@@A", scope: !0, file: !1, line: 10, type: !214, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?randBuff@@3V?$RWTexture2D@_K@@A")
!214 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned long long>", file: !1, line: 10, size: 64, align: 64, elements: !2, templateParams: !215)
!215 = !{!216}
!216 = !DITemplateTypeParameter(name: "element", type: !80)
!217 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 11, type: !218, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 11, size: 32, align: 32, elements: !2)
!219 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 12, type: !220, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 576, align: 32, elements: !234)
!221 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 12, size: 576, align: 32, elements: !2, templateParams: !222)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "element", type: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !142, line: 43, size: 576, align: 32, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !224, file: !142, line: 45, baseType: !227, size: 576, align: 32)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 576, align: 32, elements: !232)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !142, line: 37, size: 192, align: 32, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !228, file: !142, line: 39, baseType: !6, size: 96, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "norm", scope: !228, file: !142, line: 40, baseType: !6, size: 96, align: 32, offset: 96)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !{!235}
!235 = !DISubrange(count: 1)
!236 = !{i32 2, !"Dwarf Version", i32 4}
!237 = !{i32 2, !"Debug Info Version", i32 3}
!238 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!239 = !{!"shaders.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A#include \22CookTorrance.hlsl\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0Agloballycoherent RWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0Agloballycoherent RWTexture2D<uint64_t>                 randBuff   : register(u1);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0Ainline uint MWC64X(in uint2 pixelID)\0D\0A{\0D\0A    uint64_t state = randBuff[pixelID];\0D\0A    uint c = uint((state) >> 32);\0D\0A    uint x = uint((state) & 0xFFFFFFFF);\0D\0A    state = uint64_t(x * ((uint64_t) 4294883355U) + c);\0D\0A    randBuff[pixelID] = state;\0D\0A    return x ^ c;\0D\0A}\0D\0A\0D\0Ainline float randFloat01(in uint2 pixelID)\0D\0A{\0D\0A    //return 0.5;\0D\0A    return (float(MWC64X(pixelID)) / float(0xFFFFFFFF));\0D\0A}\0D\0Ainline float randFloat11(in uint2 pixelID)\0D\0A{\0D\0A    return (randFloat01(pixelID) * 2.0) - 1.0;\0D\0A}\0D\0A\0D\0Ainline float randFloat0505(in uint2 pixelID)\0D\0A{\0D\0A    return (randFloat01(pixelID)) - 0.5;\0D\0A}\0D\0A\0D\0A//Don't use this if it's a procedural geometry\0D\0Auint numTriangles()\0D\0A{\0D\0A    uint numtris, stride;\0D\0A    geomdata[NonUniformResourceIndex(InstanceID())].GetDimensions(numtris, stride);\0D\0A    return numtris/2;\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(forward, right);\0D\0A     \0D\0A    uint2 pixelID = NonUniformResourceIndex(DispatchRaysIndex()).xy;\0D\0A    uint2 dims = NonUniformResourceIndex(DispatchRaysDimensions()).xy;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A\0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A    RayDesc ray;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.Origin = pos;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A\0D\0A\0D\0A    // for(uint i = 0; i < NUM_SAMPLES; i++)\0D\0A    // {\0D\0A    // const uint loBits = (uint32_t)(randBuff[pixelID]&0xFFFFFFFF);\0D\0A    // const uint hiBits = (uint32_t)((randBuff[pixelID]>>32)&0xFFFFFFFF);\0D\0A    // const float loFloat = (((float)loBits)/((float)0xFFFFFFFF));\0D\0A    // const float hiFloat = (((float)hiBits)/((float)0xFFFFFFFF));\0D\0A    // colorOut[pixelID].x = (float16_t) hiFloat;\0D\0A    // colorOut[pixelID].y = (float16_t) loFloat;\0D\0A    // colorOut[pixelID].z = 0.1f;\0D\0A    //return;\0D\0A    float3 accum = float3(0, 0, 0);\0D\0A    for(uint i = 0; i < NUM_SAMPLES; i++)\0D\0A    {\0D\0A        float3 fuzzyLookAtPoint = centerOfPlane + (right * offsetFromCenter.x + randFloat0505(pixelID)) + (up * offsetFromCenter.y + randFloat0505(pixelID));\0D\0A        ray.Direction = normalize(fuzzyLookAtPoint - pos);\0D\0A\0D\0A        RayPayload payload = (RayPayload)0;\0D\0A        payload.mask = float16_t3(1.0, 1.0, 1.0);\0D\0A        payload.layer = 0; //why doesn't the api provide a layer ugh\0D\0A        payload.accum = float16_t3(0.0, 0.0, 0.0);\0D\0A        payload.insideGlass = 0;\0D\0A        payload.padd = 0;\0D\0A\0D\0A        TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    // //TODO: this clamp being required means somethign is *wrong*\0D\0A        accum += clamp(payload.accum, float3(0, 0, 0), float3(1, 1, 1));\0D\0A        //accum += payload.accum;\0D\0A    }\0D\0A    accum /= float3(NUM_SAMPLES, NUM_SAMPLES, NUM_SAMPLES);\0D\0A\0D\0A    colorOut[pixelID] = float16_t4(accum, 1.0);\0D\0A\0D\0A    // if(constants.frameNumber % NUM_SAMPLES == 0)\0D\0A    // {\0D\0A    //     colorOut[pixelID] = float16_t4(0, 0, 0, 1);\0D\0A    // }\0D\0A    // //TODO: this clamp being required means somethign is *wrong*\0D\0A    // float3 sampl3 = clamp(payload.accum, float3(0, 0, 0), float3(1, 1, 1)) / float(NUM_SAMPLES);\0D\0A    // colorOut[pixelID] += float16_t4(sampl3.x, sampl3.y, sampl3.z, 0.0);\0D\0A    // colorOut[pixelID].w = 1.0;\0D\0A    // }\0D\0A\0D\0A    \0D\0A    \0D\0A    //payload.accum.b = float(payload.layer) / float(MAX_RECURSION_LAYERS);\0D\0A    \0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A}\0D\0A\0D\0Afloat3 doTransform(float3 vec3, float4x3 mat4x3)\0D\0A{\0D\0A    float4 vec4 = float4(vec3.x, vec3.y, vec3.z, 1.0);\0D\0A\0D\0A    float4x4 mat4x4 = float4x4(\0D\0A        mat4x3[0][0],mat4x3[0][1], mat4x3[0][2], 0,\0D\0A        mat4x3[1][0],mat4x3[1][1], mat4x3[1][2], 0,\0D\0A        mat4x3[2][0],mat4x3[2][1], mat4x3[2][2], 0,\0D\0A        mat4x3[3][0],mat4x3[3][1], mat4x3[3][2], 1\0D\0A    );\0D\0A    mat4x4 = transpose(mat4x4);\0D\0A\0D\0A    float4 retVal = mul(vec4, mat4x4);\0D\0A\0D\0A    return retVal.xyz;\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal(float2 bary)\0D\0A{\0D\0A    uint offset = numTriangles();\0D\0A    Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float baryA = bary.x;\0D\0A    float baryB = bary.y;\0D\0A    float baryC = 1.0 - (baryA + baryB);\0D\0A\0D\0A    float3 normal = (tri.verts[0].norm * baryC) +\0D\0A                    (tri.verts[1].norm * baryA) +\0D\0A                    (tri.verts[2].norm * baryB);\0D\0A\0D\0A    normal = normalize(mul(normal, ObjectToWorld4x3()));\0D\0A    return normal; \0D\0A}\0D\0A\0D\0A// float3 getWorldSpaceNormal()\0D\0A// {\0D\0A//     uint offset = numTriangles();\0D\0A//     Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A//     //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A//     float3 a = tri.verts[0].pos;\0D\0A//     float3 b = tri.verts[1].pos;\0D\0A//     float3 c = tri.verts[2].pos;\0D\0A    \0D\0A//     float3 ba = b - a;\0D\0A//     float3 ca = c - a;\0D\0A//     float3 normal = cross(ba, ca);\0D\0A//     normal = normalize(mul((float3x3)ObjectToWorld4x3(), normal));\0D\0A//     return normal;\0D\0A//     //normal = normalize(doTransform(normal, ObjectToWorld4x3()));\0D\0A//    /// return normal;\0D\0A// }\0D\0A\0D\0A\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    if(payload.layer == 0) { payload.accum = float3(0, 0, 0); }\0D\0A    return;\0D\0A    \0D\0A}\0D\0A\0D\0Afloat3 getColor(in Material mat, in float3 pos)\0D\0A{\0D\0A    switch(mat.indicator)\0D\0A    {\0D\0A        case 1: //checkered\0D\0A            {\0D\0A            int2 xy = int2(floor(pos.xz));\0D\0A            uint colorIdx = (xy.x+xy.y)%2 == 0;\0D\0A\0D\0A            //int3 xyz = (int3)floor(select(pos < 1, pos-1, pos));\0D\0A            //bool3 evenSquare = xyz%2;\0D\0A        \0D\0A            //uint colorIdx = evenSquare.x ^ evenSquare.y ^ evenSquare.z;// ((xyz.x + xyz.y)%2);\0D\0A            return colorIdx ? float3(1.0, 1.0, 1.0)-mat.color : mat.color;\0D\0A            \0D\0A            }\0D\0A            break;\0D\0A        default:\0D\0A            return mat.color;\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 generateNewRayDir(float3 oldRayDir, in float3 normal)\0D\0A{\0D\0A    (void)oldRayDir;\0D\0A    //TODO: this was essentially stolen from \0D\0A    //http://raytracey.blogspot.com/2016/11/opencl-path-tracing-tutorial-2-path.html\0D\0A    //need to go through and see how the one I wrote was wrong after I confirm this works.\0D\0A\0D\0A    //TODO: this refracts sometime when it shouldn't?\0D\0A\0D\0A    //float3 w = dot(normal, oldRayDir) < 0.0f ? normal : normal * (-1.0f);\0D\0A    float3 w = normal;\0D\0A\0D\0A    /* compute two random numbers to pick a random point on the hemisphere above the hitpoint*/\0D\0A    \0D\0A    float rand1 = 2.0f * PI * randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float rand2 = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A\0D\0A    float rand2s = sqrt(rand2);\0D\0A\0D\0A    /* create a local orthogonal coordinate frame centered at the hitpoint */\0D\0A    float3 u = abs(w.x) > 0.1f ? float3(0.0f, 1.0f, 0.0f) : float3(1.0f, 0.0f, 0.0f); //axis\0D\0A    u = normalize(cross(u, w));\0D\0A    float3 v = cross(w, u);\0D\0A    v = normalize(v);                \0D\0A    return normalize(u * cos(rand1) * rand2s + v * sin(rand1) * rand2s + w * sqrt(1.0f - rand2));\0D\0A}\0D\0A\0D\0Avoid UnifiedShading(\0D\0Ainout RayPayload payload,\0D\0Ain Material mat,\0D\0Ain float2 bary\0D\0A)\0D\0A{\0D\0A    float3 normal = getWorldSpaceNormal(bary);\0D\0A    //payload.accum = abs(normal);\0D\0A    //return;\0D\0A    float3 pos = WorldRayOrigin() + (WorldRayDirection() * RayTCurrent());\0D\0A\0D\0A    //TODO: multiple rays for tree branching motecarlo for more efficient tracing?\0D\0A    // Maybe only branch after first hit..?\0D\0A    float3 oldRayDir = WorldRayDirection();\0D\0A    \0D\0A    float transDecider = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float mirrorDecider = randFloat01(NonUniformResourceIndex(DispatchRaysIndex()).xy);\0D\0A    float3 newRayDir;\0D\0A\0D\0A    bool doingTransparencyStuff = false;\0D\0A\0D\0A    if(payload.insideGlass)\0D\0A    {\0D\0A        payload.insideGlass = false;\0D\0A        newRayDir = refract(oldRayDir, -normal, 1.0/mat.ior);\0D\0A        doingTransparencyStuff = true;\0D\0A    }\0D\0A    else if (mat.trans >= transDecider)\0D\0A    {\0D\0A        // pos -= normal*0.0001f;\0D\0A        payload.insideGlass = true;\0D\0A        newRayDir = refract(oldRayDir, normal, 1);//mat.ior);\0D\0A        doingTransparencyStuff = true;\0D\0A    }\0D\0A    else if(mat.smooth >= mirrorDecider)\0D\0A    {\0D\0A        newRayDir = reflect(oldRayDir, normal);\0D\0A    }\0D\0A    else\0D\0A    {\0D\0A        newRayDir = generateNewRayDir(oldRayDir, normal);\0D\0A    }\0D\0A\0D\0A    if(!doingTransparencyStuff)\0D\0A    { // Cook Torance shading model\0D\0A    \0D\0A        float3 color = getColor(mat, pos);\0D\0A\0D\0A        //float tf = abs((1.0 - mat.ior) / (1.0 + mat.ior));\0D\0A        float3 F0a = abs((1.0 - mat.ior) / (1.0 + mat.ior)).xxx;\0D\0A\0D\0A        F0a = F0a * F0a;\0D\0A\0D\0A        float3 F0 = lerp(F0a, color, mat.metal);\0D\0A        float3 kS = float3(0, 0, 0);\0D\0A        float3 cT = max(CookTorance(oldRayDir, newRayDir, normal, mat.ior, F0, kS), 0.0f);\0D\0A        //float3 R = reflect(newRayDir, normal);\0D\0A\0D\0A\0D\0A        float3 V = -oldRayDir;\0D\0A        float3 N = normal;\0D\0A        float3 L = newRayDir;\0D\0A\0D\0A        float3 H = normalize((L + V));\0D\0A\0D\0A        float diff = max(dot(L, N), 0.0f);\0D\0A        //float spec = max(dot(N, H), 0.0f);\0D\0A        //float lightsum = diff + spec;\0D\0A        float3 kD = ((1.0f - kS) * (1.0f - mat.metal));\0D\0A\0D\0A        payload.accum += mat.emission * payload.mask;\0D\0A        payload.mask *= color * ((diff * kD) + (cT));\0D\0A    }\0D\0A    { // new ray stuff\0D\0A        payload.layer++;\0D\0A        if (payload.layer >= MAX_RECURSION_LAYERS || any(mat.emission > 0))\0D\0A        {\0D\0A            //payload.accum.x =\0D\0A            return;\0D\0A        }\0D\0A        \0D\0A        RayDesc ray;\0D\0A        ray.Origin = pos;\0D\0A        ray.Direction = newRayDir;\0D\0A        ray.TMin = 0.001;\0D\0A        ray.TMax = 1000;\0D\0A        \0D\0A        TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    }\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_white(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.0f;\0D\0A    mat.emission = float3(0, 0, 0);\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_shinyred(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 0.1, 0.1);\0D\0A    mat.smooth = 0.5f;\0D\0A    mat.emission = float3(0, 0, 0);\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_light(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.9f;\0D\0A    mat.emission = float3(1, 1, 1); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_metal(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.6f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.9;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_mirror(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.99f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 1.0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_checkered(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1, 1, 1);\0D\0A    mat.smooth = 0.1f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 1;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_glass(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(0.2, 0.8, 0.8);\0D\0A    mat.smooth = 0.1f;\0D\0A    mat.emission = float3(0, 0, 0); //TODO: brightness?\0D\0A    mat.trans = 0.9;\0D\0A    mat.ns = 1;\0D\0A    mat.ior = 1.52;\0D\0A    mat.metal = 0.1;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    UnifiedShading(payload, mat, attrib.barycentrics);\0D\0A}"}
!240 = !{!".\5CCookTorrance.hlsl", !"#include \22shared.h\22\0D\0A\0D\0A\0D\0Afloat Xchi(float x)\0D\0A{\0D\0A    int i = (int) (x > 0);\0D\0A    return (1.0f * (float) (i)) + (-1.0f * ((float) (1 - i)));\0D\0A\0D\0A}\0D\0A\0D\0Afloat D(float3 m, float3 n, float3 h, float a)\0D\0A{\0D\0A    float numerator = a * a * Xchi(dot(h, n));\0D\0A\0D\0A    float mndot2 = pow(dot(m, n), 2);\0D\0A\0D\0A    float otherPart = (1.0f - mndot2) / mndot2;\0D\0A    float denominator = PI * pow(pow(dot(m, n), 2) * ((a * a) + otherPart), 2);\0D\0A\0D\0A    return numerator / denominator;\0D\0A}\0D\0A\0D\0A\0D\0Afloat fDialectric(float prevIOR, float newIOR, float3 i, float3 o)\0D\0A{\0D\0A    float f0 = (prevIOR - newIOR) / (prevIOR + newIOR);\0D\0A    f0 *= f0;\0D\0A\0D\0A\0D\0A    return f0 + ((1.0f - f0) * pow(1.0f - dot(i, o), 5));\0D\0A\0D\0A}\0D\0Afloat3 fresnelSchlick(float cosT, float3 f0)\0D\0A{\0D\0A    return f0 + (1.0f - f0) * pow(1.0f - cosT, 5);\0D\0A}\0D\0A\0D\0A#define fK 4.0f //absorbtion coefficient\0D\0A\0D\0Afloat fConductor(float matIOR, float3 i, float3 o)\0D\0A{\0D\0A    float numerator = pow(matIOR - 1.0, 2) + (4.0 * matIOR * pow(1.0 - dot(i, o), 5)) + pow(fK, 2);\0D\0A    float denom = pow(matIOR + 1.0, 2) + pow(fK, 2);\0D\0A\0D\0A    return numerator / denom;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0Afloat Gp(float3 v, float3 n, float3 h, float a)\0D\0A{\0D\0A\0D\0A\0D\0A    float vdh = dot(v, h);\0D\0A    float chi = Xchi(vdh / dot(v, n));\0D\0A    vdh *= vdh;\0D\0A    float right = (1.0f - vdh) / vdh;\0D\0A    return (chi * 2.0f) / (1.0f + sqrt(1.0f + (a * a * right)));\0D\0A}\0D\0Afloat G(float3 wi, float3 wo, float3 n, float3 h, float a)\0D\0A{\0D\0A    return Gp(wi, n, h, a) * Gp(wo, n, h, a);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 CookTorance(\0D\0A\09in float3 oldRayDir,\0D\0A\09in float3 newRayDir,\0D\0A\09in float3 normal,\0D\0A\09//Material mat,\0D\0A\09float prevIOR,\0D\0A\09const float3 F0,\0D\0A\09inout float3 kS)\0D\0A{\0D\0A    (void)prevIOR;\0D\0A\0D\0A    //float2 uv = minRayResult.uv.xy;\0D\0A\09\0D\0A    float roughness = 0.4;// 1.0f - mat.smooth;\0D\0A\0D\0A\0D\0A    float3 vi = -oldRayDir;\0D\0A    float3 vo = newRayDir;\0D\0A\09//dvec3 vh = normalize(vi + vo);\0D\0A    float3 vn = normal;\0D\0A\0D\0A\09/*if (dot(vn, vo) < 0) { //if going into transparent material\0D\0A\09\09vo = -vo;\0D\0A\09\09vo = vo - ((2.0f * vo * vn) / pow(length(vo), 2) * vo);\0D\0A\09} else if(dot(vn, vi) < 0) { //if coming out of transparent material\0D\0A\09\09vi = -vi;\0D\0A\09\09vi = vi - ((2.0f * vi * vn) / pow(length(vi), 2) * vi);\0D\0A\09}*/\0D\0A    float3 vh = normalize(vi + vo);\0D\0A\0D\0A\0D\0A    float ndi = dot(vn, vi);\0D\0A\0D\0A    float cosT = dot(vo, vn);\0D\0A    float sinT = sqrt(1 - cosT * cosT);\0D\0A\0D\0A\09// Calculate fresnel\0D\0A    float3 fresnel = fresnelSchlick(dot(vh, vi), F0);\0D\0A\0D\0A\0D\0A\09// Geometry term\0D\0A    float geometry = G(vi, vo, vn, vh, roughness); // GGX_PartialGeometryTerm(viewVector, normal, halfVector, roughness)* GGX_PartialGeometryTerm(sampleVector, normal, halfVector, roughness);\0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   \0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   // Calculate the Cook-Torrance denominator\0D\0A    float denominator = 4.0f * (ndi * dot(vh, vn) + 0.05f);\0D\0A    kS = fresnel;\0D\0A\09\0D\0A\09// Accumulate the radiance\0D\0A    return geometry * fresnel * sinT / denominator;\0D\0A}"}
!241 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A#define NUM_SAMPLES 32//8096\0D\0A#define MAX_RECURSION_LAYERS 12\0D\0A#define PI 3.14159265f\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A    uint frameNumber;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float3 accum;\0D\0A    uint layer;\0D\0A    float3 mask;\0D\0A    uint32_t padd : 31;\0D\0A    uint32_t insideGlass : 1;\0D\0A};\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A    float3 norm;\0D\0A};\0D\0A\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A    float3 color; //base color\0D\0A    float smooth; //smoothness\0D\0A    float3 emission; //light emissition \0D\0A    float trans; //transparency\0D\0A    float ns; //specular exponent\0D\0A    float ior; //index of refracton\0D\0A    float metal; //metalness\0D\0A    uint indicator;\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!242 = !{!"shaders.hlsl"}
!243 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"-HV", !"2021", !"-Od", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!244 = !{i32 1, i32 6}
!245 = !{!"lib", i32 6, i32 6}
!246 = !{!247, !252, !257, null}
!247 = !{!248, !250}
!248 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !249}
!249 = !{i32 0, i32 4}
!250 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* bitcast ([0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A" to [0 x %"class.StructuredBuffer<Tringle>"]*), !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !251}
!251 = !{i32 1, i32 72}
!252 = !{!253, !255}
!253 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* bitcast (%dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A" to %"class.RWTexture2D<vector<half, 4> >"*), !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 true, i1 false, i1 false, !254}
!254 = !{i32 0, i32 8}
!255 = !{i32 1, %"class.RWTexture2D<unsigned long long>"* bitcast (%dx.types.Handle* @"\01?randBuff@@3V?$RWTexture2D@_K@@A" to %"class.RWTexture2D<unsigned long long>"*), !"randBuff", i32 0, i32 1, i32 1, i32 2, i1 true, i1 false, i1 false, !256}
!256 = !{i32 0, i32 5}
!257 = !{!258}
!258 = !{i32 0, %constants* bitcast (%dx.types.Handle* @constants to %constants*), !"constants", i32 0, i32 0, i32 1, i32 36, null}
!259 = !{i32 0, %struct.ConstantBufferStruct undef, !260, %"class.StructuredBuffer<Tringle>" undef, !266, %struct.Tringle undef, !271, %struct.Vert undef, !273, %struct.RayPayload undef, !276, %struct.BuiltInTriangleIntersectionAttributes undef, !281, %constants undef, !283}
!260 = !{i32 36, !261, !262, !263, !264, !265}
!261 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!262 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!263 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!264 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!265 = !{i32 6, !"frameNumber", i32 3, i32 32, i32 7, i32 5}
!266 = !{i32 92, !267, !268}
!267 = !{i32 6, !"h", i32 3, i32 0}
!268 = !{i32 0, !269}
!269 = !{!270}
!270 = !{i32 0, %struct.Tringle undef}
!271 = !{i32 92, !272}
!272 = !{i32 6, !"verts", i32 3, i32 0}
!273 = !{i32 28, !274, !275}
!274 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!275 = !{i32 6, !"norm", i32 3, i32 16, i32 7, i32 9}
!276 = !{i32 32, !277, !278, !279, !280}
!277 = !{i32 6, !"accum", i32 3, i32 0, i32 7, i32 9}
!278 = !{i32 6, !"layer", i32 3, i32 12, i32 7, i32 5}
!279 = !{i32 6, !"mask", i32 3, i32 16, i32 7, i32 9}
!280 = !{i32 3, i32 28, i32 7, i32 5}
!281 = !{i32 8, !282}
!282 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!283 = !{i32 36, !284}
!284 = !{i32 6, !"constants", i32 3, i32 0}
!285 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !286, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !288, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !290}
!286 = !{!287}
!287 = !{i32 1, !2, !2}
!288 = !{!287, !289}
!289 = !{i32 2, !2, !2}
!290 = !{!287, !289, !291}
!291 = !{i32 0, !2, !2}
!292 = !{null, !"", null, !246, !293}
!293 = !{i32 0, i64 9502769}
!294 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !295}
!295 = !{i32 8, i32 11, i32 6, i32 32, i32 5, !296}
!296 = !{i32 0}
!297 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !298}
!298 = !{i32 8, i32 7, i32 5, !296}
!299 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_checkered@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!300 = !{i32 8, i32 10, i32 6, i32 32, i32 7, i32 8, i32 5, !296}
!301 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_glass@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!302 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_light@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!303 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_metal@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!304 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!305 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_shinyred@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!306 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_white@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !300}
!307 = !DILocation(line: 102, column: 9, scope: !308)
!308 = distinct !DILexicalBlock(scope: !309, file: !1, line: 91, column: 5)
!309 = distinct !DILexicalBlock(scope: !310, file: !1, line: 90, column: 5)
!310 = distinct !DILexicalBlock(scope: !111, file: !1, line: 90, column: 5)
!311 = !DILocation(line: 20, column: 5, scope: !192, inlinedAt: !312)
!312 = distinct !DILocation(line: 27, column: 19, scope: !191, inlinedAt: !313)
!313 = distinct !DILocation(line: 36, column: 13, scope: !181, inlinedAt: !314)
!314 = distinct !DILocation(line: 92, column: 134, scope: !308)
!315 = !DILocation(line: 109, column: 5, scope: !111)
!316 = !DILocation(line: 51, column: 28, scope: !111)
!317 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !111, file: !1, line: 51, type: !6)
!318 = !DIExpression(DW_OP_bit_piece, 0, 32)
!319 = !DILocation(line: 51, column: 12, scope: !111)
!320 = !DIExpression(DW_OP_bit_piece, 32, 32)
!321 = !DIExpression(DW_OP_bit_piece, 64, 32)
!322 = !DILocation(line: 52, column: 42, scope: !111)
!323 = !DILocation(line: 52, column: 61, scope: !111)
!324 = !DILocation(line: 52, column: 49, scope: !111)
!325 = !DILocation(line: 52, column: 22, scope: !111)
!326 = !DILocation(line: 52, column: 12, scope: !111)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !111, file: !1, line: 52, type: !6)
!328 = !DILocation(line: 53, column: 12, scope: !111)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !111, file: !1, line: 53, type: !6)
!330 = !DIExpression()
!331 = !DILocation(line: 54, column: 20, scope: !111)
!332 = !DILocation(line: 54, column: 12, scope: !111)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !111, file: !1, line: 54, type: !6)
!334 = !DILocation(line: 55, column: 17, scope: !111)
!335 = !DILocation(line: 55, column: 12, scope: !111)
!336 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !111, file: !1, line: 55, type: !6)
!337 = !DILocation(line: 57, column: 45, scope: !111)
!338 = !DILocation(line: 57, column: 21, scope: !111)
!339 = !DILocation(line: 57, column: 11, scope: !111)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !111, file: !1, line: 57, type: !184)
!341 = !DILocation(line: 58, column: 42, scope: !111)
!342 = !DILocation(line: 58, column: 18, scope: !111)
!343 = !DILocation(line: 58, column: 11, scope: !111)
!344 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !111, file: !1, line: 58, type: !184)
!345 = !DILocation(line: 59, column: 23, scope: !111)
!346 = !DILocation(line: 59, column: 28, scope: !111)
!347 = !DILocation(line: 59, column: 12, scope: !111)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !111, file: !1, line: 59, type: !15)
!349 = !DILocation(line: 60, column: 31, scope: !111)
!350 = !DILocation(line: 60, column: 35, scope: !111)
!351 = !DILocation(line: 60, column: 11, scope: !111)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !111, file: !1, line: 60, type: !5)
!353 = !DILocation(line: 62, column: 42, scope: !111)
!354 = !DILocation(line: 62, column: 40, scope: !111)
!355 = !DILocation(line: 62, column: 11, scope: !111)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !111, file: !1, line: 62, type: !5)
!357 = !DILocation(line: 64, column: 43, scope: !111)
!358 = !DILocation(line: 64, column: 32, scope: !111)
!359 = !DILocation(line: 64, column: 12, scope: !111)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "centerOfPlane", scope: !111, file: !1, line: 64, type: !6)
!361 = !DILocation(line: 66, column: 31, scope: !111)
!362 = !DILocation(line: 66, column: 47, scope: !111)
!363 = !DILocation(line: 66, column: 12, scope: !111)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !111, file: !1, line: 66, type: !15)
!365 = !DILocation(line: 70, column: 49, scope: !111)
!366 = !DILocation(line: 70, column: 40, scope: !111)
!367 = !DILocation(line: 70, column: 77, scope: !111)
!368 = !DILocation(line: 70, column: 71, scope: !111)
!369 = !DILocation(line: 70, column: 12, scope: !111)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !111, file: !1, line: 70, type: !6)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !111, file: !1, line: 71, type: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 71, size: 256, align: 32, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !372, file: !1, line: 71, baseType: !7, size: 96, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !372, file: !1, line: 71, baseType: !5, size: 32, align: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !372, file: !1, line: 71, baseType: !7, size: 96, align: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !372, file: !1, line: 71, baseType: !5, size: 32, align: 32, offset: 224)
!378 = !DILocation(line: 71, column: 13, scope: !111)
!379 = !DILocation(line: 72, column: 43, scope: !111)
!380 = !DILocation(line: 72, column: 21, scope: !111)
!381 = !DILocation(line: 72, column: 9, scope: !111)
!382 = !DILocation(line: 72, column: 19, scope: !111)
!383 = !DILocation(line: 73, column: 9, scope: !111)
!384 = !DILocation(line: 73, column: 16, scope: !111)
!385 = !DILocation(line: 74, column: 9, scope: !111)
!386 = !DILocation(line: 74, column: 14, scope: !111)
!387 = !DILocation(line: 75, column: 9, scope: !111)
!388 = !DILocation(line: 75, column: 14, scope: !111)
!389 = !DILocation(line: 89, column: 12, scope: !111)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !111, file: !1, line: 89, type: !6)
!391 = !DILocation(line: 90, column: 14, scope: !310)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !310, file: !1, line: 90, type: !77)
!393 = !DILocation(line: 90, column: 5, scope: !310)
!394 = !DILocation(line: 92, column: 58, scope: !308)
!395 = !DILocation(line: 92, column: 81, scope: !308)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pixelID", arg: 1, scope: !181, file: !1, line: 34, type: !184)
!397 = !DILocation(line: 34, column: 37, scope: !181, inlinedAt: !398)
!398 = distinct !DILocation(line: 92, column: 81, scope: !308)
!399 = !DILocation(line: 36, column: 13, scope: !181, inlinedAt: !398)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pixelID", arg: 1, scope: !191, file: !1, line: 24, type: !184)
!401 = !DILocation(line: 24, column: 35, scope: !191, inlinedAt: !402)
!402 = distinct !DILocation(line: 36, column: 13, scope: !181, inlinedAt: !398)
!403 = !DILocation(line: 27, column: 19, scope: !191, inlinedAt: !402)
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pixelID", arg: 1, scope: !192, file: !1, line: 14, type: !184)
!405 = !DILocation(line: 14, column: 29, scope: !192, inlinedAt: !406)
!406 = distinct !DILocation(line: 27, column: 19, scope: !191, inlinedAt: !402)
!407 = !DILocation(line: 16, column: 22, scope: !192, inlinedAt: !406)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !192, file: !1, line: 16, type: !79)
!409 = !DILocation(line: 16, column: 14, scope: !192, inlinedAt: !406)
!410 = !DILocation(line: 17, column: 27, scope: !192, inlinedAt: !406)
!411 = !DILocation(line: 17, column: 19, scope: !192, inlinedAt: !406)
!412 = !DILocation(line: 17, column: 10, scope: !192, inlinedAt: !406)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !192, file: !1, line: 17, type: !77)
!414 = !DILocation(line: 18, column: 27, scope: !192, inlinedAt: !406)
!415 = !DILocation(line: 18, column: 19, scope: !192, inlinedAt: !406)
!416 = !DILocation(line: 18, column: 10, scope: !192, inlinedAt: !406)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !192, file: !1, line: 18, type: !77)
!418 = !DILocation(line: 19, column: 22, scope: !192, inlinedAt: !406)
!419 = !DILocation(line: 19, column: 24, scope: !192, inlinedAt: !406)
!420 = !DILocation(line: 19, column: 53, scope: !192, inlinedAt: !406)
!421 = !DILocation(line: 19, column: 51, scope: !192, inlinedAt: !406)
!422 = !DILocation(line: 19, column: 11, scope: !192, inlinedAt: !406)
!423 = !DILocation(line: 20, column: 5, scope: !192, inlinedAt: !406)
!424 = !DILocation(line: 20, column: 23, scope: !192, inlinedAt: !406)
!425 = !DILocation(line: 21, column: 14, scope: !192, inlinedAt: !406)
!426 = !DILocation(line: 21, column: 5, scope: !192, inlinedAt: !406)
!427 = !DILocation(line: 27, column: 36, scope: !191, inlinedAt: !402)
!428 = !DILocation(line: 27, column: 5, scope: !191, inlinedAt: !402)
!429 = !DILocation(line: 36, column: 35, scope: !181, inlinedAt: !398)
!430 = !DILocation(line: 36, column: 5, scope: !181, inlinedAt: !398)
!431 = !DILocation(line: 92, column: 79, scope: !308)
