#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Use native low precision
;
; shader debug name: 65e69d32a7d1a314aa93eef596016ab0.pdb
; shader hash: 65e69d32a7d1a314aa93eef596016ab0
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; constants                         cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !63, globals: !91)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !22, !33, !40, !55}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 18, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 52, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 52, size: 64, align: 16, elements: !24, templateParams: !30)
!24 = !{!25, !27, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 52, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!30 = !{!31, !32}
!31 = !DITemplateTypeParameter(name: "element", type: !26)
!32 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 48, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 48, size: 48, align: 16, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 48, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 48, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!39 = !{!31, !13}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 74, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 74, size: 288, align: 32, elements: !42, templateParams: !52)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 74, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !{!12, !53, !54}
!53 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!54 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 120, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 120, size: 96, align: 32, elements: !57, templateParams: !61)
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !1, line: 120, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !1, line: 120, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !56, file: !1, line: 120, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!61 = !{!62, !13}
!62 = !DITemplateTypeParameter(name: "element", type: !14)
!63 = !{!64, !67, !78, !81, !87, !88, !89, !90}
!64 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 15, type: !65, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!65 = !DISubroutineType(types: !66)
!66 = !{null}
!67 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 56, type: !68, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70}
!70 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !72, line: 25, size: 64, align: 16, elements: !73)
!72 = !DIFile(filename: "./shared.h", directory: "")
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !71, file: !72, line: 27, baseType: !33, size: 48, align: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "padd", scope: !71, file: !72, line: 28, baseType: !76, size: 16, align: 16, offset: 48)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 48, baseType: !77)
!77 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 62, type: !79, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!4}
!81 = !DISubprogram(name: "ch_normalcolors", linkageName: "\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 79, type: !82, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!82 = !DISubroutineType(types: !83)
!83 = !{null, !70, !84}
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 75, size: 64, align: 32, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !84, file: !1, line: 75, baseType: !16, size: 64, align: 32)
!87 = !DISubprogram(name: "ch_red", linkageName: "\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 101, type: !82, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!88 = !DISubprogram(name: "ch_checkerboard", linkageName: "\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 113, type: !82, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!89 = !DISubprogram(name: "ch_mirror", linkageName: "\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 143, type: !82, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!90 = !DISubprogram(name: "ch_skybox", linkageName: "\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 164, type: !82, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!91 = !{!92, !95, !96, !106, !110, !112}
!92 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 50, type: !93, isLocal: true, isDefinition: true, variable: i32 1)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!95 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 158, type: !93, isLocal: true, isDefinition: true, variable: i32 0)
!96 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 7, type: !97, isLocal: false, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 7, size: 32, align: 32, elements: !2, templateParams: !98)
!98 = !{!99}
!99 = !DITemplateTypeParameter(name: "T", type: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !72, line: 17, size: 256, align: 32, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !100, file: !72, line: 19, baseType: !4, size: 96, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !100, file: !72, line: 20, baseType: !8, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !100, file: !72, line: 21, baseType: !4, size: 96, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !100, file: !72, line: 22, baseType: !8, size: 32, align: 32, offset: 224)
!106 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 8, type: !107, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<half, 4> >"* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 8, size: 64, align: 16, elements: !2, templateParams: !108)
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "element", type: !23)
!110 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 9, type: !111, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 9, size: 32, align: 32, elements: !2)
!112 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 10, type: !113, isLocal: false, isDefinition: true, variable: [0 x %"class.StructuredBuffer<Tringle>"]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 288, align: 32, elements: !126)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 10, size: 288, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "element", type: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !72, line: 36, size: 288, align: 32, elements: !118)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !117, file: !72, line: 38, baseType: !120, size: 288, align: 32)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 288, align: 32, elements: !124)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !72, line: 32, size: 96, align: 32, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !121, file: !72, line: 34, baseType: !4, size: 96, align: 32)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !{i32 2, !"Dwarf Version", i32 4}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!131 = !{!"shaders.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0ARWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0A\0D\0A//TODO: redo this, i don't like it\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(forward, right);\0D\0A     \0D\0A    \0D\0A    \0D\0A    uint2 pixelID = DispatchRaysIndex().xy;\0D\0A    uint2 dims = DispatchRaysDimensions().xy ;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    \0D\0A    //float2 offsetFromCenter = float2(dims.x, dims.y) - halfDims;\0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A    RayPayload payload = (RayPayload)0;\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A    colorOut[pixelID] = float16_t4(payload.color.x, payload.color.y, payload.color.z, 1.0);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float16_t3(0.0, 0.0, 0.0);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal()\0D\0A{\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    return mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A}\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_normalcolors(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A\0D\0A\0D\0A    Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.color = float16_t3(color.x, color.y, color.z);\0D\0A    return;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_red(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A    //payload.color = float16_t3(0.0, 0.0, 1.0);\0D\0A    //return;\0D\0A    payload.color = float16_t3(1, 0, 0);\0D\0A    return;\0D\0A    //Tringle tri = geomdata[InstanceID()][PrimitiveIndex()];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_checkerboard(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void)attrib;\0D\0A    //const float  = 10;\0D\0A    \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\0D\0A    int3 xyz = (int3)select(pos < 1, pos -1, pos);\0D\0A    bool3 evenSquare = xyz%2;\0D\0A    \0D\0A    bool colorIdx = evenSquare.x ^ evenSquare.y ^ evenSquare.z;// ((xyz.x + xyz.y)%2);\0D\0A    // colorIdx = colorIdx | (xyz.z%2);\0D\0A    \0D\0A    // int3 xyz = pos < 1 ? pos : pos-1;\0D\0A    // xy.x = pos.x < 0 ? pos.x - 1.0f : pos.x;\0D\0A    // xy.y = pos.z < 0 ? pos.z - 1.0f : pos.z;\0D\0A    \0D\0A    // bool colorIdx = 1;//((xy.x + xy.y) % 2) ? true : false;\0D\0A\0D\0A\0D\0A    \0D\0A\0D\0A    float16_t3 color = colorIdx ? float16_t3(0.9, 0.9, 0.9) : float16_t3(0.4, 0.4, 0.4);\0D\0A\0D\0A    payload.color = color;\0D\0A    return;\0D\0A}\0D\0A \0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_mirror(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A    \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    float3 normal = getWorldSpaceNormal();\0D\0A    float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = reflected;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    RayPayload payload2 = (RayPayload) 0;\0D\0A    TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload2);\0D\0A    payload.color = (payload2.color * 0.7) + float16_t3(0.3, 0.3, 0.3);\0D\0A    return;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_skybox(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void)attrib;\0D\0A    payload.color = float16_t3(0.211765, 0.780392, 0.94902);\0D\0A}\0D\0A"}
!132 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float16_t3 color;\0D\0A    uint16_t padd;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A};\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!133 = !{!"shaders.hlsl"}
!134 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"-HV", !"2021", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!135 = !{i32 1, i32 3}
!136 = !{i32 1, i32 6}
!137 = !{!"lib", i32 6, i32 3}
!138 = !{!139, !144, !147, null}
!139 = !{!140, !142}
!140 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !141}
!141 = !{i32 0, i32 4}
!142 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !143}
!143 = !{i32 1, i32 36}
!144 = !{!145}
!145 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !146}
!146 = !{i32 0, i32 8}
!147 = !{!148}
!148 = !{i32 0, %constants* @constants, !"constants", i32 0, i32 0, i32 1, i32 32, null}
!149 = !{i32 0, %struct.ConstantBufferStruct undef, !150, %"class.StructuredBuffer<Tringle>" undef, !155, %struct.Tringle undef, !157, %struct.Vert undef, !159, %struct.RayPayload undef, !161, %struct.BuiltInTriangleIntersectionAttributes undef, !164, %constants undef, !166}
!150 = !{i32 32, !151, !152, !153, !154}
!151 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!152 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!153 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!154 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!155 = !{i32 44, !156}
!156 = !{i32 6, !"h", i32 3, i32 0}
!157 = !{i32 44, !158}
!158 = !{i32 6, !"verts", i32 3, i32 0}
!159 = !{i32 12, !160}
!160 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!161 = !{i32 8, !162, !163}
!162 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 8}
!163 = !{i32 6, !"padd", i32 3, i32 6, i32 7, i32 3}
!164 = !{i32 8, !165}
!165 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!166 = !{i32 32, !167}
!167 = !{i32 6, !"constants", i32 3, i32 0}
!168 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !169, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !171, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !173}
!169 = !{!170}
!170 = !{i32 1, !2, !2}
!171 = !{!170, !172}
!172 = !{i32 2, !2, !2}
!173 = !{!170, !172, !174}
!174 = !{i32 0, !2, !2}
!175 = !{null, !"", null, !138, !176}
!176 = !{i32 0, i64 8454192}
!177 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !178}
!178 = !{i32 8, i32 11, i32 6, i32 8, i32 5, !179}
!179 = !{i32 0}
!180 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !181}
!181 = !{i32 8, i32 7, i32 5, !179}
!182 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_checkerboard@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!183 = !{i32 8, i32 10, i32 6, i32 8, i32 7, i32 8, i32 5, !179}
!184 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_mirror@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!185 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!186 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_red@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!187 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_skybox@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !183}
!188 = !DILocation(line: 50, column: 5, scope: !64)
!189 = !DILocation(line: 52, column: 5, scope: !64)
!190 = !DILocation(line: 18, column: 28, scope: !64)
!191 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !64, file: !1, line: 18, type: !4)
!192 = !DIExpression(DW_OP_bit_piece, 0, 32)
!193 = !DILocation(line: 18, column: 12, scope: !64)
!194 = !DIExpression(DW_OP_bit_piece, 32, 32)
!195 = !DIExpression(DW_OP_bit_piece, 64, 32)
!196 = !DILocation(line: 19, column: 42, scope: !64)
!197 = !DILocation(line: 19, column: 49, scope: !64)
!198 = !DILocation(line: 19, column: 22, scope: !64)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !64, file: !1, line: 19, type: !4)
!200 = !DILocation(line: 19, column: 12, scope: !64)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !64, file: !1, line: 20, type: !4)
!202 = !DIExpression()
!203 = !DILocation(line: 20, column: 12, scope: !64)
!204 = !DILocation(line: 21, column: 20, scope: !64)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !64, file: !1, line: 21, type: !4)
!206 = !DILocation(line: 21, column: 12, scope: !64)
!207 = !DILocation(line: 22, column: 17, scope: !64)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !64, file: !1, line: 22, type: !4)
!209 = !DILocation(line: 22, column: 12, scope: !64)
!210 = !DILocation(line: 26, column: 21, scope: !64)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !64, file: !1, line: 26, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 26, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 26, size: 64, align: 32, elements: !214, templateParams: !217)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !1, line: 26, baseType: !94, size: 32, align: 32, flags: DIFlagPublic)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !1, line: 26, baseType: !94, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!217 = !{!218, !21}
!218 = !DITemplateTypeParameter(name: "element", type: !94)
!219 = !DILocation(line: 26, column: 11, scope: !64)
!220 = !DILocation(line: 27, column: 18, scope: !64)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !64, file: !1, line: 27, type: !212)
!222 = !DILocation(line: 27, column: 11, scope: !64)
!223 = !DILocation(line: 28, column: 23, scope: !64)
!224 = !DILocation(line: 28, column: 28, scope: !64)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !64, file: !1, line: 28, type: !15)
!226 = !DILocation(line: 28, column: 12, scope: !64)
!227 = !DILocation(line: 29, column: 31, scope: !64)
!228 = !DILocation(line: 29, column: 35, scope: !64)
!229 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !64, file: !1, line: 29, type: !8)
!230 = !DILocation(line: 29, column: 11, scope: !64)
!231 = !DILocation(line: 31, column: 42, scope: !64)
!232 = !DILocation(line: 31, column: 40, scope: !64)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !64, file: !1, line: 31, type: !8)
!234 = !DILocation(line: 31, column: 11, scope: !64)
!235 = !DILocation(line: 33, column: 43, scope: !64)
!236 = !DILocation(line: 37, column: 31, scope: !64)
!237 = !DILocation(line: 37, column: 47, scope: !64)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !64, file: !1, line: 37, type: !15)
!239 = !DILocation(line: 37, column: 12, scope: !64)
!240 = !DILocation(line: 40, column: 49, scope: !64)
!241 = !DILocation(line: 40, column: 77, scope: !64)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !64, file: !1, line: 40, type: !4)
!243 = !DILocation(line: 40, column: 12, scope: !64)
!244 = !DILocation(line: 44, column: 43, scope: !64)
!245 = !DILocation(line: 40, column: 71, scope: !64)
!246 = !DILocation(line: 44, column: 21, scope: !64)
!247 = !DILocation(line: 48, column: 38, scope: !64)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !64, file: !1, line: 48, type: !71)
!249 = !DILocation(line: 48, column: 16, scope: !64)
!250 = !DILocation(line: 52, column: 36, scope: !64)
!251 = !DILocation(line: 52, column: 53, scope: !64)
!252 = !DILocation(line: 52, column: 70, scope: !64)
!253 = !DILocation(line: 52, column: 23, scope: !64)
!254 = !DILocation(line: 53, column: 1, scope: !64)
!255 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !67, file: !1, line: 56, type: !71)
!256 = !DIExpression(DW_OP_bit_piece, 0, 48)
!257 = !DILocation(line: 56, column: 28, scope: !67)
!258 = !DILocation(line: 59, column: 1, scope: !67)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !81, file: !1, line: 79, type: !84)
!260 = !DILocation(line: 79, column: 89, scope: !81)
!261 = !DILocation(line: 84, column: 28, scope: !81)
!262 = !DILocation(line: 84, column: 42, scope: !81)
!263 = !DILocation(line: 84, column: 19, scope: !81)
!264 = !DILocation(line: 87, column: 29, scope: !81)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !81, file: !1, line: 87, type: !4)
!266 = !DILocation(line: 87, column: 12, scope: !81)
!267 = !DILocation(line: 88, column: 29, scope: !81)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !81, file: !1, line: 88, type: !4)
!269 = !DILocation(line: 88, column: 12, scope: !81)
!270 = !DILocation(line: 89, column: 29, scope: !81)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !81, file: !1, line: 89, type: !4)
!272 = !DILocation(line: 89, column: 12, scope: !81)
!273 = !DILocation(line: 91, column: 19, scope: !81)
!274 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ba", scope: !81, file: !1, line: 91, type: !4)
!275 = !DILocation(line: 91, column: 12, scope: !81)
