#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Use native low precision
;
; shader debug name: b8787c241dc04a652b4dd03070ae6e93.pdb
; shader hash: b8787c241dc04a652b4dd03070ae6e93
;
; Buffer Definitions:
;
; cbuffer constants
; {
;
;   struct constants
;   {
;
;       struct struct.ConstantBufferStruct
;       {
;
;           float3 camPos;                            ; Offset:    0
;           float ct;                                 ; Offset:   12
;           float3 lookAt;                            ; Offset:   16
;           float fov;                                ; Offset:   28
;       
;       } constants;                                  ; Offset:    0
;
;   
;   } constants;                                      ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for geomdata
; {
;
;   struct struct.Tringle
;   {
;
;       struct struct.Vert
;       {
;
;           float3 pos;                               ; Offset:    0
;       
;       } verts[3];;                                  ; Offset:    0
;
;   
;   } $Element;                                       ; Offset:    0 Size:    36
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; constants                         cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.6 (60719ebc6)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !85, globals: !162)
!1 = !DIFile(filename: "shaders.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !6, !15, !22, !31, !40, !48, !70}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 9, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 9, size: 96, align: 32, elements: !8, templateParams: !12)
!8 = !{!9, !10, !11}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 9, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !5)
!14 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 3)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 27, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 27, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 27, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 27, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!13, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t3", file: !1, line: 46, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 3>", file: !1, line: 46, size: 48, align: 16, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 46, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!26 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 46, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 46, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !14}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t4", file: !1, line: 56, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 4>", file: !1, line: 56, size: 64, align: 16, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 56, baseType: !26, size: 16, align: 16, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 56, baseType: !26, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 56, baseType: !26, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 56, baseType: !26, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!38 = !{!30, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !4, value: i32 4)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 61, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 61, size: 128, align: 32, elements: !42, templateParams: !47)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 61, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 61, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 61, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !41, file: !1, line: 61, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !{!13, !39}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 63, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 63, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 63, baseType: !5, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 4)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 188, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 188, size: 288, align: 32, elements: !72, templateParams: !82)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !71, file: !1, line: 188, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!82 = !{!13, !83, !84}
!83 = !DITemplateValueParameter(name: "row_count", type: !4, value: i32 3)
!84 = !DITemplateValueParameter(name: "col_count", type: !4, value: i32 3)
!85 = !{!86, !90, !93, !96, !99, !102, !103, !106, !112, !115, !134, !137, !150, !153, !154, !155, !156}
!86 = !DISubprogram(name: "Xchi", linkageName: "\01?Xchi@@YAMM@Z", scope: !87, file: !87, line: 4, type: !88, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DIFile(filename: "./CookTorrance.hlsl", directory: "")
!88 = !DISubroutineType(types: !89)
!89 = !{!5, !5}
!90 = !DISubprogram(name: "D", linkageName: "\01?D@@YAMV?$vector@M$02@@00M@Z", scope: !87, file: !87, line: 11, type: !91, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!5, !6, !6, !6, !5}
!93 = !DISubprogram(name: "fDialectric", linkageName: "\01?fDialectric@@YAMMMV?$vector@M$02@@0@Z", scope: !87, file: !87, line: 24, type: !94, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!5, !5, !5, !6, !6}
!96 = !DISubprogram(name: "fresnelSchlick", linkageName: "\01?fresnelSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !87, file: !87, line: 33, type: !97, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!6, !5, !6}
!99 = !DISubprogram(name: "fConductor", linkageName: "\01?fConductor@@YAMMV?$vector@M$02@@0@Z", scope: !87, file: !87, line: 40, type: !100, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!5, !5, !6, !6}
!102 = !DISubprogram(name: "Gp", linkageName: "\01?Gp@@YAMV?$vector@M$02@@00M@Z", scope: !87, file: !87, line: 50, type: !91, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubprogram(name: "G", linkageName: "\01?G@@YAMV?$vector@M$02@@000M@Z", scope: !87, file: !87, line: 60, type: !104, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{!5, !6, !6, !6, !6, !5}
!106 = !DISubprogram(name: "CookTorance", linkageName: "\01?CookTorance@@YA?AV?$vector@M$02@@V1@00MV1@AIAV1@@Z", scope: !87, file: !87, line: 66, type: !107, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubroutineType(types: !108)
!108 = !{!6, !6, !6, !6, !5, !109, !110}
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!110 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !6)
!112 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 14, type: !113, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!113 = !DISubroutineType(types: !114)
!114 = !{null}
!115 = !DISubprogram(name: "doTransform", linkageName: "\01?doTransform@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$02@@@Z", scope: !1, file: !1, line: 59, type: !116, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!116 = !DISubroutineType(types: !117)
!117 = !{!6, !6, !118}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 57, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 57, size: 384, align: 32, elements: !120, templateParams: !133)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !119, file: !1, line: 57, baseType: !5, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!133 = !{!13, !68, !84}
!134 = !DISubprogram(name: "getWorldSpaceNormal", linkageName: "\01?getWorldSpaceNormal@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 77, type: !135, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!6}
!137 = !DISubprogram(name: "ShadeItSky", linkageName: "\01?ShadeItSky@@YAXURayPayload@@V?$vector@M$02@@11I@Z", scope: !1, file: !1, line: 93, type: !138, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140, !6, !6, !6, !146}
!140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !142, line: 27, size: 256, align: 32, elements: !143)
!142 = !DIFile(filename: "./shared.h", directory: "")
!143 = !{!144, !145, !148, !149}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "accum", scope: !141, file: !142, line: 29, baseType: !6, size: 96, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !141, file: !142, line: 30, baseType: !146, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !147)
!147 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !142, line: 31, baseType: !6, size: 96, align: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !141, file: !142, line: 32, baseType: !146, size: 32, align: 32, offset: 224)
!150 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 143, type: !151, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !140}
!153 = !DISubprogram(name: "distanceColor", linkageName: "\01?distanceColor@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 167, type: !135, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false)
!154 = !DISubprogram(name: "unifiedShading", linkageName: "\01?unifiedShading@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 176, type: !151, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false)
!155 = !DISubprogram(name: "ShadeIt", linkageName: "\01?ShadeIt@@YAXURayPayload@@V?$vector@M$02@@11I@Z", scope: !1, file: !1, line: 198, type: !138, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false)
!156 = !DISubprogram(name: "ch_normalcolors", linkageName: "\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 295, type: !157, isLocal: false, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!157 = !DISubroutineType(types: !158)
!158 = !{null, !140, !159}
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 245, size: 64, align: 32, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !159, file: !1, line: 245, baseType: !16, size: 64, align: 32)
!162 = !{!163, !165, !175, !179, !181}
!163 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 51, type: !164, isLocal: true, isDefinition: true, variable: i32 1)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!165 = !DIGlobalVariable(name: "constants", linkageName: "\01?constants@@3U?$ConstantBuffer@UConstantBufferStruct@@@@A", scope: !0, file: !1, line: 8, type: !166, isLocal: false, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<ConstantBufferStruct>", file: !1, line: 8, size: 32, align: 32, elements: !2, templateParams: !167)
!167 = !{!168}
!168 = !DITemplateTypeParameter(name: "T", type: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBufferStruct", file: !142, line: 19, size: 256, align: 32, elements: !170)
!170 = !{!171, !172, !173, !174}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "camPos", scope: !169, file: !142, line: 21, baseType: !6, size: 96, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !169, file: !142, line: 22, baseType: !5, size: 32, align: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "lookAt", scope: !169, file: !142, line: 23, baseType: !6, size: 96, align: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !169, file: !142, line: 24, baseType: !5, size: 32, align: 32, offset: 224)
!175 = !DIGlobalVariable(name: "colorOut", linkageName: "\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A", scope: !0, file: !1, line: 9, type: !176, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A")
!176 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<half, 4> >", file: !1, line: 9, size: 64, align: 16, elements: !2, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "element", type: !32)
!179 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 10, type: !180, isLocal: false, isDefinition: true, variable: %dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 10, size: 32, align: 32, elements: !2)
!181 = !DIGlobalVariable(name: "geomdata", linkageName: "\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A", scope: !0, file: !1, line: 11, type: !182, isLocal: false, isDefinition: true, variable: [0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A")
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 288, align: 32, elements: !195)
!183 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Tringle>", file: !1, line: 11, size: 288, align: 32, elements: !2, templateParams: !184)
!184 = !{!185}
!185 = !DITemplateTypeParameter(name: "element", type: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tringle", file: !142, line: 40, size: 288, align: 32, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !186, file: !142, line: 42, baseType: !189, size: 288, align: 32)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 288, align: 32, elements: !193)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vert", file: !142, line: 36, size: 96, align: 32, elements: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !190, file: !142, line: 38, baseType: !6, size: 96, align: 32)
!193 = !{!194}
!194 = !DISubrange(count: 3)
!195 = !{!196}
!196 = !DISubrange(count: 1)
!197 = !{i32 2, !"Dwarf Version", i32 4}
!198 = !{i32 2, !"Debug Info Version", i32 3}
!199 = !{!"dxcoob 1.8.2306.6 (60719ebc6)"}
!200 = !{!"shaders.hlsl", !"\0D\0A// Most of this just copied from \0D\0A// https://landelare.github.io/2023/02/18/dxr-tutorial.html#shader.hlsl\0D\0A\0D\0A#include \22shared.h\22\0D\0A#include \22CookTorrance.hlsl\22\0D\0A\0D\0AConstantBuffer<ConstantBufferStruct>  constants  : register(b0);\0D\0ARWTexture2D<float16_t4>               colorOut   : register(u0);\0D\0ARaytracingAccelerationStructure       scene      : register(t0);\0D\0AStructuredBuffer<Tringle>             geomdata[] : register(t1);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    \0D\0A    float3 pos = constants.camPos;\0D\0A    float3 forward = normalize(constants.lookAt - constants.camPos);\0D\0A    float3 worldUp = float3(0, 1, 0);\0D\0A    float3 right = cross(forward, worldUp);\0D\0A    float3 up = cross(forward, right);\0D\0A     \0D\0A    \0D\0A    \0D\0A    uint2 pixelID = NonUniformResourceIndex(DispatchRaysIndex()).xy;\0D\0A    uint2 dims = NonUniformResourceIndex(DispatchRaysDimensions()).xy;\0D\0A    float2 halfDims = dims / 2.0f;\0D\0A    float halfFOV = constants.fov / 2.0f;\0D\0A        \0D\0A    float distanceToPlane = halfDims.x / tan(halfFOV);\0D\0A    \0D\0A    float3 centerOfPlane = pos + (forward * distanceToPlane);\0D\0A    \0D\0A    float2 offsetFromCenter = float2(pixelID) - halfDims;\0D\0A    \0D\0A    \0D\0A    float3 lookAtPoint = centerOfPlane + (right * offsetFromCenter.x) + (up * offsetFromCenter.y);\0D\0A\0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = normalize(lookAtPoint - pos);\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A\0D\0A    RayPayload payload = (RayPayload)0;\0D\0A    payload.mask = float16_t3(1.0, 1.0, 1.0);\0D\0A    payload.layer = 0; //why doesn't the api provide a layer ugh\0D\0A    payload.accum = float16_t3(0.0, 0.0, 0.0);\0D\0A    payload.seed = asuint(float(((pixelID.y * dims.x) + pixelID.x) * 10000) * frac(constants.ct));\0D\0A\0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A    \0D\0A    //payload.accum.b = float(payload.layer) / float(MAX_RECURSION_LAYERS);\0D\0A    \0D\0A    //colorOut[pixelID] = float16_t4(0.0, 1.0, 0.0, 1.0);\0D\0A    colorOut[pixelID] = float16_t4(payload.accum.x, payload.accum.y, payload.accum.z, 1.0);\0D\0A}\0D\0A\0D\0Afloat3 doTransform(float3 vec3, float4x3 mat4x3)\0D\0A{\0D\0A    float4 vec4 = float4(vec3.x, vec3.y, vec3.z, 1.0);\0D\0A\0D\0A    float4x4 mat4x4 = float4x4(\0D\0A        mat4x3[0][0],mat4x3[0][1], mat4x3[0][2], 0,\0D\0A        mat4x3[1][0],mat4x3[1][1], mat4x3[1][2], 0,\0D\0A        mat4x3[2][0],mat4x3[2][1], mat4x3[2][2], 0,\0D\0A        mat4x3[3][0],mat4x3[3][1], mat4x3[3][2], 1\0D\0A    );\0D\0A    mat4x4 = transpose(mat4x4);\0D\0A\0D\0A    float4 retVal = mul(vec4, mat4x4);\0D\0A\0D\0A    return retVal.xyz;\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 getWorldSpaceNormal()\0D\0A{\0D\0A    Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = cross(ba, ca);\0D\0A    normal = normalize(doTransform(normal, ObjectToWorld4x3()));\0D\0A    return normal;\0D\0A}\0D\0A\0D\0Avoid ShadeItSky(\0D\0Ainout RayPayload payload,\0D\0Ain float3 normal,\0D\0Ain float3 oldRayDir,\0D\0Ain float3 newRayDir,\0D\0Auint matIndex\0D\0A)\0D\0A{\0D\0A\0D\0A    // TODO: mat from mat buffer (until we start doing textures but f that, samplers who?)\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1.0, 1.0, 1.0);\0D\0A    mat.ni = 1.0;\0D\0A    mat.emission = float3(1.0, 1.0, 1.0);\0D\0A    mat.ns = 1.0;\0D\0A    mat.trans = 0.0;\0D\0A    mat.metal = 0.0;\0D\0A    mat.smooth = 0.0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    float tf = abs((1.0 - mat.ni) / (1.0 + mat.ni));\0D\0A    float3 F0a = abs((1.0 - mat.ni) / (1.0 + mat.ni)).xxx;\0D\0A\0D\0A    //float3(tf, tf, tf);\0D\0A    F0a = F0a * F0a;\0D\0A\0D\0A    float3 F0 = lerp(F0a, mat.color, mat.metal);\0D\0A    //dvec3 ctSpecular = CookTorance(ray, reflectionRay, minRayResult, downstreamRadiance, minRayResult.shape->mat, currentIOR, F0, kS);\0D\0A    //TODO: need to keep the current ray\0D\0A    float3 kS = float3(0, 0, 0);\0D\0A    float3 cT = max(CookTorance(oldRayDir, newRayDir, normal, mat.ni, F0, kS), 0.0f);\0D\0A    //blinn phong (ish)\0D\0A    float3 R = reflect(newRayDir, normal); //   rotateVector(newRay.dir, PI, hr.normal); //TODO: not the right rotate\0D\0A\0D\0A    float3 V = -oldRayDir;\0D\0A    float3 N = normal;\0D\0A    float3 L = newRayDir;   \0D\0A\0D\0A    float3 H = normalize((L + V));\0D\0A\0D\0A    float diff = max(dot(L, N), 0.0f);\0D\0A    float spec = max(dot(N, H), 0.0f);\0D\0A    //float lightsum = diff + spec;\0D\0A    float3 kD = ((1.0f - kS) * (1.0f - mat.metal)); //*diff;\0D\0A\0D\0A    payload.accum += mat.emission * payload.mask;\0D\0A    payload.mask *= mat.color * ((diff * kD) + (cT));\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout RayPayload payload)\0D\0A{\0D\0A    if(payload.layer == 0) { payload.accum = float3(1, 0, 0); return; }\0D\0A    float3 normal = -WorldRayDirection();\0D\0A    float3 oldRayDir = WorldRayDirection();\0D\0A    float3 newRayDir = -WorldRayDirection();\0D\0A    ShadeItSky(\0D\0A        payload,\0D\0A        normal,\0D\0A        oldRayDir,\0D\0A        newRayDir,\0D\0A        0\0D\0A    );\0D\0A    //float3 directionalLightDir = normalize(float3(-1, -1, -1));\0D\0A    //payload.accum = float3(1, 0, 0);\0D\0A    //payload.mask *= clamp(cross(WorldRayDirection(), -directionalLightDir), float3(0, 0, 0), float3(1, 1, 1));\0D\0A\0D\0A    // payload.accum = float16_t3(0, 0, 0);\0D\0A    return;\0D\0A    //payload.color = float16_t3(0.0, 0.0, 0.0);\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0Afloat3 distanceColor()\0D\0A{\0D\0A    float i = frac(RayTCurrent());\0D\0A    return float3(i, i, i);\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0Avoid unifiedShading(inout RayPayload payload)\0D\0A{\0D\0A    Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A    //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    float3 a = tri.verts[0].pos;\0D\0A    float3 b = tri.verts[1].pos;\0D\0A    float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    float3 ba = b - a;\0D\0A    float3 ca = c - a;\0D\0A    float3 normal = normalize(cross(ba, ca));\0D\0A    normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    float3 color = abs(normal);\0D\0A    payload.accum = float16_t3(color.x, color.y, color.z);\0D\0A    return;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0Avoid ShadeIt(\0D\0Ainout RayPayload payload,\0D\0Ain float3 normal,\0D\0Ain float3 oldRayDir,\0D\0Ain float3 newRayDir,\0D\0Auint matIndex\0D\0A)\0D\0A{\0D\0A\0D\0A    // TODO: mat from mat buffer (until we start doing textures but f that, samplers who?)\0D\0A    Material mat = (Material)0;\0D\0A    mat.color = float3(1.0, 1.0, 1.0);\0D\0A    mat.ni = 1.0;\0D\0A    mat.emission = float3(0.0, 0.0, 0.0);\0D\0A    mat.ns = 1.0;\0D\0A    mat.trans = 0.0;\0D\0A    mat.metal = 0.0;\0D\0A    mat.smooth = 0.0;\0D\0A    mat.indicator = 0;\0D\0A\0D\0A    float tf = abs((1.0 - mat.ni) / (1.0 + mat.ni));\0D\0A    float3 F0a = abs((1.0 - mat.ni) / (1.0 + mat.ni)).xxx;\0D\0A\0D\0A    //float3(tf, tf, tf);\0D\0A    F0a = F0a * F0a;\0D\0A\0D\0A    float3 F0 = lerp(F0a, mat.color, mat.metal);\0D\0A    //dvec3 ctSpecular = CookTorance(ray, reflectionRay, minRayResult, downstreamRadiance, minRayResult.shape->mat, currentIOR, F0, kS);\0D\0A    //TODO: need to keep the current ray\0D\0A    float3 kS = float3(0, 0, 0);\0D\0A    float3 cT = max(CookTorance(oldRayDir, newRayDir, normal, mat.ni, F0, kS), 0.0f);\0D\0A    //blinn phong (ish)\0D\0A    float3 R = reflect(newRayDir, normal); //   rotateVector(newRay.dir, PI, hr.normal); //TODO: not the right rotate\0D\0A\0D\0A    float3 V = -oldRayDir;\0D\0A    float3 N = normal;\0D\0A    float3 L = newRayDir;\0D\0A\0D\0A    float3 H = normalize((L + V));\0D\0A\0D\0A    float diff = max(dot(L, N), 0.0f);\0D\0A    float spec = max(dot(N, H), 0.0f);\0D\0A    //float lightsum = diff + spec;\0D\0A    float3 kD = ((1.0f - kS) * (1.0f - mat.metal)); //*diff;\0D\0A\0D\0A    payload.accum += mat.emission * payload.mask;\0D\0A    payload.mask *= mat.color * ((diff * kD) + (cT));\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A// uint wang_hash(inout uint seed)\0D\0A// {\0D\0A//     seed = (seed ^ 61) ^ (seed >> 16);\0D\0A//     seed *= 9;\0D\0A//     seed = seed ^ (seed >> 4);\0D\0A//     seed *= 0x27d4eb2d;\0D\0A//     seed = seed ^ (seed >> 15);\0D\0A//     return seed;\0D\0A// }\0D\0A\0D\0A\0D\0A\0D\0A// float randFloat01(inout uint randomState)\0D\0A// {\0D\0A//     uint randUint = wang_hash(randomState);\0D\0A//     float val = float(randUint) / float(0xFFFFFFFF);\0D\0A//     return val;\0D\0A// }\0D\0A\0D\0A// float3 generateNewRayDir(float3 oldRayDir, in float3 normal, inout uint randomState)\0D\0A// {\0D\0A//     //TODO: this was essentially stolen from \0D\0A//     //http://raytracey.blogspot.com/2016/11/opencl-path-tracing-tutorial-2-path.html\0D\0A//     //need to go through and see how the one I wrote was wrong after I confirm this works.\0D\0A//     float3 w = dot(normal, oldRayDir) < 0.0f ? normal : normal * (-1.0f);\0D\0A\0D\0A//     /* compute two random numbers to pick a random point on the hemisphere above the hitpoint*/\0D\0A                    \0D\0A//     float rand1 = 2.0f * PI * randFloat01(randomState);\0D\0A//     float rand2 = randFloat01(randomState);\0D\0A\0D\0A//     float rand2s = sqrt(rand2);\0D\0A\0D\0A//     /* create a local orthogonal coordinate frame centered at the hitpoint */\0D\0A//     float3 u = abs(w.x) > 0.1f ? float3(0.0f, 1.0f, 0.0f) : float3(1.0f, 0.0f, 0.0f); //axis\0D\0A//     u = normalize(cross(u, w));\0D\0A//     float3 v = cross(w, u);\0D\0A                    \0D\0A//     return normalize(u * cos(rand1) * rand2s + v * sin(rand1) * rand2s + w * sqrt(1.0f - rand2));\0D\0A// }\0D\0A\0D\0A\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ch_normalcolors(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A    (void) attrib;\0D\0A    \0D\0A    \0D\0A    // Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A    // //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    // float3 a = tri.verts[0].pos;\0D\0A    // float3 b = tri.verts[1].pos;\0D\0A    // float3 c = tri.verts[2].pos;\0D\0A    \0D\0A    // float3 ba = b - a;\0D\0A    // float3 ca = c - a;\0D\0A    // float3 normal = normalize(cross(ba, ca));\0D\0A    // normal = mul(normal, ((float3x3) ObjectToWorld4x3()));\0D\0A    // float3 color = abs(normal);\0D\0A    // payload.accum = float16_t3(color.x, color.y, color.z);\0D\0A    // return;\0D\0A\0D\0A    \0D\0A    //float d = frac(RayTCurrent());\0D\0A\0D\0A\0D\0A    //payload.accum = float16_t3(d, d, d);\0D\0A    // return;\0D\0A    // (void) attrib;\0D\0A    // // TODO: mat from mat buffer (until we start doing textures but f that, samplers who?)\0D\0A    // Material mat = (Material)0;\0D\0A    // mat.color = float3(1.0, 1.0, 1.0);\0D\0A    // mat.ni = 1.0;\0D\0A    // mat.emission = float3(0.0, 0.0, 0.0);\0D\0A    // mat.ns = 1.0;\0D\0A    // mat.trans = 0.0;\0D\0A    // mat.metal = 0.0;\0D\0A    // mat.smooth = 0.0;\0D\0A    // mat.indicator = 0;\0D\0A    float3 normal = getWorldSpaceNormal();\0D\0A    float3 bias = normal * 0.0001f;\0D\0A    float3 pos = WorldRayOrigin() + (WorldRayDirection() * RayTCurrent());\0D\0A    //float3 normal = normalize(cross(ba, ca));\0D\0A\0D\0A    //TODO: a smooth surface will generate more reflected rays\0D\0A    float3 oldRayDir = WorldRayDirection();\0D\0A    float3 newRayDir = reflect(oldRayDir, normal); //generateNewRayDir(oldRayDir, normal, payload.seed);\0D\0A\0D\0A    ShadeIt(\0D\0A        payload,\0D\0A        normal,\0D\0A        oldRayDir,\0D\0A        newRayDir,\0D\0A        0\0D\0A    );\0D\0A    \0D\0A    payload.layer++;\0D\0A\0D\0A    if (payload.layer >= MAX_RECURSION_LAYERS)\0D\0A    {\0D\0A        return;\0D\0A    }\0D\0A    \0D\0A    RayDesc ray;\0D\0A    ray.Origin = pos;\0D\0A    ray.Direction = newRayDir;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    TraceRay(scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A};\0D\0A\0D\0A// [shader(\22closesthit\22)]\0D\0A// void ch_red(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A// {\0D\0A//     (void) attrib;\0D\0A//     //payload.color = float16_t3(0.0, 0.0, 1.0);\0D\0A//     //return;\0D\0A//     payload.color = float16_t3(1, 0, 0);\0D\0A//     return;\0D\0A//     //Tringle tri = geomdata[NonUniformResourceIndex(InstanceID())][NonUniformResourceIndex(PrimitiveIndex())];\0D\0A//     //float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A// }\0D\0A\0D\0A// [shader(\22closesthit\22)]\0D\0A// void ch_checkerboard(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A// {\0D\0A//     (void)attrib;\0D\0A//     //const float  = 10;\0D\0A    \0D\0A//     float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\0D\0A//     int3 xyz = (int3)select(pos < 1, pos -1, pos);\0D\0A//     bool3 evenSquare = xyz%2;\0D\0A    \0D\0A//     bool colorIdx = evenSquare.x ^ evenSquare.y ^ evenSquare.z;// ((xyz.x + xyz.y)%2);\0D\0A//     // colorIdx = colorIdx | (xyz.z%2);\0D\0A    \0D\0A//     // int3 xyz = pos < 1 ? pos : pos-1;\0D\0A//     // xy.x = pos.x < 0 ? pos.x - 1.0f : pos.x;\0D\0A//     // xy.y = pos.z < 0 ? pos.z - 1.0f : pos.z;\0D\0A    \0D\0A//     // bool colorIdx = 1;//((xy.x + xy.y) % 2) ? true : false;\0D\0A\0D\0A\0D\0A    \0D\0A\0D\0A//     float16_t3 color = colorIdx ? float16_t3(0.9, 0.9, 0.9) : float16_t3(0.4, 0.4, 0.4);\0D\0A\0D\0A//     payload.color = color;\0D\0A//     return;\0D\0A// }\0D\0A \0D\0A\0D\0A// [shader(\22closesthit\22)]\0D\0A// void ch_mirror(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A// {\0D\0A//     (void) attrib;\0D\0A    \0D\0A//     float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A//     float3 normal = getWorldSpaceNormal();\0D\0A//     float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A//     RayDesc ray;\0D\0A//     ray.Origin = pos;\0D\0A//     ray.Direction = reflected;\0D\0A//     ray.TMin = 0.001;\0D\0A//     ray.TMax = 1000;\0D\0A    \0D\0A//     RayPayload payload2 = (RayPayload) 0;\0D\0A//     TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload2);\0D\0A//     payload.color = (payload2.color * 0.7) + float16_t3(0.3, 0.3, 0.3);\0D\0A//     return;\0D\0A// }\0D\0A\0D\0A// [shader(\22closesthit\22)]\0D\0A// void ch_skybox(inout RayPayload payload, in BuiltInTriangleIntersectionAttributes attrib)\0D\0A// {\0D\0A//     (void)attrib;\0D\0A//     // payload.color = float16_t3(0.211765, 0.780392, 0.94902);\0D\0A// }\0D\0A"}
!201 = !{!".\5CCookTorrance.hlsl", !"#include \22shared.h\22\0D\0A\0D\0A\0D\0Afloat Xchi(float x)\0D\0A{\0D\0A    int i = (int) (x > 0);\0D\0A    return (1.0f * (float) (i)) + (-1.0f * ((float) (1 - i)));\0D\0A\0D\0A}\0D\0A\0D\0Afloat D(float3 m, float3 n, float3 h, float a)\0D\0A{\0D\0A    float numerator = a * a * Xchi(dot(h, n));\0D\0A\0D\0A    float mndot2 = pow(dot(m, n), 2);\0D\0A\0D\0A    float otherPart = (1.0f - mndot2) / mndot2;\0D\0A    float denominator = PI * pow(pow(dot(m, n), 2) * ((a * a) + otherPart), 2);\0D\0A\0D\0A    return numerator / denominator;\0D\0A}\0D\0A\0D\0A\0D\0Afloat fDialectric(float prevIOR, float newIOR, float3 i, float3 o)\0D\0A{\0D\0A    float f0 = (prevIOR - newIOR) / (prevIOR + newIOR);\0D\0A    f0 *= f0;\0D\0A\0D\0A\0D\0A    return f0 + ((1.0f - f0) * pow(1.0f - dot(i, o), 5));\0D\0A\0D\0A}\0D\0Afloat3 fresnelSchlick(float cosT, float3 f0)\0D\0A{\0D\0A    return f0 + (1.0f - f0) * pow(1.0f - cosT, 5);\0D\0A}\0D\0A\0D\0A#define fK 4.0f //absorbtion coefficient\0D\0A\0D\0Afloat fConductor(float matIOR, float3 i, float3 o)\0D\0A{\0D\0A    float numerator = pow(matIOR - 1.0, 2) + (4.0 * matIOR * pow(1.0 - dot(i, o), 5)) + pow(fK, 2);\0D\0A    float denom = pow(matIOR + 1.0, 2) + pow(fK, 2);\0D\0A\0D\0A    return numerator / denom;\0D\0A\0D\0A}\0D\0A\0D\0A\0D\0Afloat Gp(float3 v, float3 n, float3 h, float a)\0D\0A{\0D\0A\0D\0A\0D\0A    float vdh = dot(v, h);\0D\0A    float chi = Xchi(vdh / dot(v, n));\0D\0A    vdh *= vdh;\0D\0A    float right = (1.0f - vdh) / vdh;\0D\0A    return (chi * 2.0f) / (1.0f + sqrt(1.0f + (a * a * right)));\0D\0A}\0D\0Afloat G(float3 wi, float3 wo, float3 n, float3 h, float a)\0D\0A{\0D\0A    return Gp(wi, n, h, a) * Gp(wo, n, h, a);\0D\0A}\0D\0A\0D\0A\0D\0Afloat3 CookTorance(\0D\0A\09in float3 oldRayDir,\0D\0A\09in float3 newRayDir,\0D\0A\09in float3 normal,\0D\0A\09//Material mat,\0D\0A\09float prevIOR,\0D\0A\09const float3 F0,\0D\0A\09inout float3 kS)\0D\0A{\0D\0A\0D\0A\0D\0A    //float2 uv = minRayResult.uv.xy;\0D\0A\09\0D\0A    float roughness = 0.4;// 1.0f - mat.smooth;\0D\0A\0D\0A\0D\0A    float3 vi = -oldRayDir;\0D\0A    float3 vo = newRayDir;\0D\0A\09//dvec3 vh = normalize(vi + vo);\0D\0A    float3 vn = normal;\0D\0A\0D\0A\09/*if (dot(vn, vo) < 0) { //if going into transparent material\0D\0A\09\09vo = -vo;\0D\0A\09\09vo = vo - ((2.0f * vo * vn) / pow(length(vo), 2) * vo);\0D\0A\09} else if(dot(vn, vi) < 0) { //if coming out of transparent material\0D\0A\09\09vi = -vi;\0D\0A\09\09vi = vi - ((2.0f * vi * vn) / pow(length(vi), 2) * vi);\0D\0A\09}*/\0D\0A    float3 vh = normalize(vi + vo);\0D\0A\0D\0A\0D\0A    float ndi = dot(vn, vi);\0D\0A\0D\0A    float cosT = dot(vo, vn);\0D\0A    float sinT = sqrt(1 - cosT * cosT);\0D\0A\0D\0A\09// Calculate fresnel\0D\0A    float3 fresnel = fresnelSchlick(dot(vh, vi), F0);\0D\0A\0D\0A\0D\0A\09// Geometry term\0D\0A    float geometry = G(vi, vo, vn, vh, roughness); // GGX_PartialGeometryTerm(viewVector, normal, halfVector, roughness)* GGX_PartialGeometryTerm(sampleVector, normal, halfVector, roughness);\0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   \0D\0A\09\09\09\09\09\09\09\09\09\09\09\09   // Calculate the Cook-Torrance denominator\0D\0A    float denominator = 4.0f * (ndi * dot(vh, vn) + 0.05f);\0D\0A    kS = fresnel;\0D\0A\09\0D\0A\09// Accumulate the radiance\0D\0A    return geometry * fresnel * sinT / denominator;\0D\0A}"}
!202 = !{!".\5Cshared.h", !"#pragma once\0D\0A\0D\0A//hlsl2021 compat\0D\0A#ifdef __cplusplus\0D\0A#include \22common.h\22\0D\0A\0D\0Ausing float3 = glm::fvec3;\0D\0Ausing float4 = glm::fvec4;\0D\0Ausing float16_t3 = glm::u16vec3; //just for equivalent size\0D\0Ausing float16_t4 = glm::u16vec4;\0D\0A#endif\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(push, 4)\0D\0A#endif\0D\0A\0D\0A#define MAX_RECURSION_LAYERS 16\0D\0A#define PI 3.14159265f\0D\0Astruct ConstantBufferStruct\0D\0A{\0D\0A    float3 camPos;\0D\0A    float ct;\0D\0A    float3 lookAt;\0D\0A    float fov;\0D\0A};\0D\0A\0D\0Astruct RayPayload\0D\0A{\0D\0A    float3 accum;\0D\0A    uint layer;\0D\0A    float3 mask;\0D\0A    uint seed;\0D\0A};\0D\0A\0D\0A\0D\0Astruct Vert\0D\0A{\0D\0A    float3 pos;\0D\0A};\0D\0Astruct Tringle\0D\0A{\0D\0A    Vert verts[3];\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0Astruct Material\0D\0A{\0D\0A// #ifdef __cplusplus\0D\0A// \09Material(\0D\0A// \09\09float3 color = float3(1.0f, 1.0f, 1.0f),\0D\0A// \09\09float3 emission = float3(0.0f, 0.0f, 0.0f),\0D\0A// \09\09float ni = 1.0f,\0D\0A// \09\09float ns = 1.0,\0D\0A// \09\09float trans = 0.0,\0D\0A// \09\09float metal = 0.0,\0D\0A// \09\09float smooth = 0.0,\0D\0A// \09\09uint indicator = 0)\0D\0A// \09{\0D\0A// \09\09this->color = color;\0D\0A// \09\09this->emission = emission;\0D\0A// \09\09this->ni = ni;\0D\0A// \09\09this->ns = ns;\0D\0A// \09\09this->trans = trans;\0D\0A// \09\09this->metal = metal;\0D\0A// \09\09this->smooth = smooth;\0D\0A// \09\09this->indicator = indicator;\0D\0A// \09}\0D\0A    \0D\0A// #endif // __cplusplus\0D\0A\0D\0A    float3 color; //base color\0D\0A    float ni; //index of refracton\0D\0A    float3 emission; //light emissition \0D\0A    float ns; //specular exponent\0D\0A    float trans; //transparency\0D\0A    float metal; //metalness\0D\0A    float smooth; //smoothness\0D\0A    uint indicator;\0D\0A};\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A#ifdef __cplusplus\0D\0A#pragma pack(pop, 4)\0D\0A#endif\0D\0A\0D\0A"}
!203 = !{!"shaders.hlsl"}
!204 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_6", !"-HV", !"2021", !"-enable-16bit-types", !"-Wall", !"-Wextra", !"-Zi", !"-Qembed_debug"}
!205 = !{i32 1, i32 6}
!206 = !{!"lib", i32 6, i32 6}
!207 = !{!208, !213, !216, null}
!208 = !{!209, !211}
!209 = !{i32 0, %struct.RaytracingAccelerationStructure* bitcast (%dx.types.Handle* @"\01?scene@@3URaytracingAccelerationStructure@@A" to %struct.RaytracingAccelerationStructure*), !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !210}
!210 = !{i32 0, i32 4}
!211 = !{i32 1, [0 x %"class.StructuredBuffer<Tringle>"]* bitcast ([0 x %dx.types.Handle]* @"\01?geomdata@@3PAV?$StructuredBuffer@UTringle@@@@A" to [0 x %"class.StructuredBuffer<Tringle>"]*), !"geomdata", i32 0, i32 1, i32 -1, i32 12, i32 0, !212}
!212 = !{i32 1, i32 36}
!213 = !{!214}
!214 = !{i32 0, %"class.RWTexture2D<vector<half, 4> >"* bitcast (%dx.types.Handle* @"\01?colorOut@@3V?$RWTexture2D@V?$vector@$f16@$03@@@@A" to %"class.RWTexture2D<vector<half, 4> >"*), !"colorOut", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !215}
!215 = !{i32 0, i32 8}
!216 = !{!217}
!217 = !{i32 0, %constants* bitcast (%dx.types.Handle* @constants to %constants*), !"constants", i32 0, i32 0, i32 1, i32 32, null}
!218 = !{i32 0, %struct.ConstantBufferStruct undef, !219, %"class.StructuredBuffer<Tringle>" undef, !224, %struct.Tringle undef, !229, %struct.Vert undef, !231, %struct.RayPayload undef, !233, %struct.BuiltInTriangleIntersectionAttributes undef, !238, %constants undef, !240}
!219 = !{i32 32, !220, !221, !222, !223}
!220 = !{i32 6, !"camPos", i32 3, i32 0, i32 7, i32 9}
!221 = !{i32 6, !"ct", i32 3, i32 12, i32 7, i32 9}
!222 = !{i32 6, !"lookAt", i32 3, i32 16, i32 7, i32 9}
!223 = !{i32 6, !"fov", i32 3, i32 28, i32 7, i32 9}
!224 = !{i32 44, !225, !226}
!225 = !{i32 6, !"h", i32 3, i32 0}
!226 = !{i32 0, !227}
!227 = !{!228}
!228 = !{i32 0, %struct.Tringle undef}
!229 = !{i32 44, !230}
!230 = !{i32 6, !"verts", i32 3, i32 0}
!231 = !{i32 12, !232}
!232 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!233 = !{i32 32, !234, !235, !236, !237}
!234 = !{i32 6, !"accum", i32 3, i32 0, i32 7, i32 9}
!235 = !{i32 6, !"layer", i32 3, i32 12, i32 7, i32 5}
!236 = !{i32 6, !"mask", i32 3, i32 16, i32 7, i32 9}
!237 = !{i32 6, !"seed", i32 3, i32 28, i32 7, i32 5}
!238 = !{i32 8, !239}
!239 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!240 = !{i32 32, !241}
!241 = !{i32 6, !"constants", i32 3, i32 0}
!242 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !243, void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !245, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !247}
!243 = !{!244}
!244 = !{i32 1, !2, !2}
!245 = !{!244, !246}
!246 = !{i32 2, !2, !2}
!247 = !{!244, !246, !248}
!248 = !{i32 0, !2, !2}
!249 = !{null, !"", null, !207, !250}
!250 = !{i32 0, i64 8454192}
!251 = !{void (%struct.RayPayload*)* @"\01?Miss@@YAXURayPayload@@@Z", !"\01?Miss@@YAXURayPayload@@@Z", null, null, !252}
!252 = !{i32 8, i32 11, i32 6, i32 32, i32 5, !253}
!253 = !{i32 0}
!254 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !255}
!255 = !{i32 8, i32 7, i32 5, !253}
!256 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ch_normalcolors@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !257}
!257 = !{i32 8, i32 10, i32 6, i32 32, i32 7, i32 8, i32 5, !253}
!258 = !DILocation(line: 51, column: 5, scope: !112)
!259 = !DILocation(line: 56, column: 5, scope: !112)
!260 = !DILocation(line: 17, column: 28, scope: !112)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !112, file: !1, line: 17, type: !6)
!262 = !DIExpression(DW_OP_bit_piece, 0, 32)
!263 = !DILocation(line: 17, column: 12, scope: !112)
!264 = !DIExpression(DW_OP_bit_piece, 32, 32)
!265 = !DIExpression(DW_OP_bit_piece, 64, 32)
!266 = !DILocation(line: 18, column: 42, scope: !112)
!267 = !DILocation(line: 18, column: 49, scope: !112)
!268 = !DILocation(line: 18, column: 22, scope: !112)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "forward", scope: !112, file: !1, line: 18, type: !6)
!270 = !DILocation(line: 18, column: 12, scope: !112)
!271 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldUp", scope: !112, file: !1, line: 19, type: !6)
!272 = !DIExpression()
!273 = !DILocation(line: 19, column: 12, scope: !112)
!274 = !DILocation(line: 20, column: 20, scope: !112)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !112, file: !1, line: 20, type: !6)
!276 = !DILocation(line: 20, column: 12, scope: !112)
!277 = !DILocation(line: 21, column: 17, scope: !112)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "up", scope: !112, file: !1, line: 21, type: !6)
!279 = !DILocation(line: 21, column: 12, scope: !112)
!280 = !DILocation(line: 25, column: 45, scope: !112)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelID", scope: !112, file: !1, line: 25, type: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 25, baseType: !283)
!283 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 25, size: 64, align: 32, elements: !284, templateParams: !287)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !283, file: !1, line: 25, baseType: !147, size: 32, align: 32, flags: DIFlagPublic)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !283, file: !1, line: 25, baseType: !147, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!287 = !{!288, !21}
!288 = !DITemplateTypeParameter(name: "element", type: !147)
!289 = !DILocation(line: 25, column: 11, scope: !112)
!290 = !DILocation(line: 26, column: 42, scope: !112)
!291 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dims", scope: !112, file: !1, line: 26, type: !282)
!292 = !DILocation(line: 26, column: 11, scope: !112)
!293 = !DILocation(line: 27, column: 23, scope: !112)
!294 = !DILocation(line: 27, column: 28, scope: !112)
!295 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfDims", scope: !112, file: !1, line: 27, type: !15)
!296 = !DILocation(line: 27, column: 12, scope: !112)
!297 = !DILocation(line: 28, column: 31, scope: !112)
!298 = !DILocation(line: 28, column: 35, scope: !112)
!299 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halfFOV", scope: !112, file: !1, line: 28, type: !5)
!300 = !DILocation(line: 28, column: 11, scope: !112)
!301 = !DILocation(line: 30, column: 42, scope: !112)
!302 = !DILocation(line: 30, column: 40, scope: !112)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "distanceToPlane", scope: !112, file: !1, line: 30, type: !5)
!304 = !DILocation(line: 30, column: 11, scope: !112)
!305 = !DILocation(line: 32, column: 43, scope: !112)
!306 = !DILocation(line: 34, column: 31, scope: !112)
!307 = !DILocation(line: 34, column: 47, scope: !112)
!308 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offsetFromCenter", scope: !112, file: !1, line: 34, type: !15)
!309 = !DILocation(line: 34, column: 12, scope: !112)
!310 = !DILocation(line: 37, column: 49, scope: !112)
!311 = !DILocation(line: 37, column: 77, scope: !112)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lookAtPoint", scope: !112, file: !1, line: 37, type: !6)
!313 = !DILocation(line: 37, column: 12, scope: !112)
!314 = !DILocation(line: 41, column: 43, scope: !112)
!315 = !DILocation(line: 37, column: 71, scope: !112)
!316 = !DILocation(line: 41, column: 21, scope: !112)
!317 = !DILocation(line: 45, column: 5, scope: !112)
!318 = !DILocation(line: 45, column: 38, scope: !112)
!319 = !DILocation(line: 46, column: 18, scope: !112)
!320 = !{!321, !321, i64 0}
!321 = !{!"omnipotent char", !322, i64 0}
!322 = !{!"Simple C/C++ TBAA"}
!323 = !DILocation(line: 47, column: 19, scope: !112)
!324 = !{!325, !325, i64 0}
!325 = !{!"int", !321, i64 0}
!326 = !DILocation(line: 48, column: 19, scope: !112)
!327 = !DILocation(line: 49, column: 45, scope: !112)
!328 = !DILocation(line: 49, column: 55, scope: !112)
!329 = !DILocation(line: 49, column: 68, scope: !112)
!330 = !DILocation(line: 49, column: 33, scope: !112)
!331 = !DILocation(line: 49, column: 94, scope: !112)
!332 = !DILocation(line: 49, column: 79, scope: !112)
!333 = !DILocation(line: 49, column: 77, scope: !112)
!334 = !DILocation(line: 49, column: 18, scope: !112)
!335 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !112, file: !1, line: 45, type: !141)
!336 = !DILocation(line: 45, column: 16, scope: !112)
!337 = !DILocation(line: 56, column: 36, scope: !112)
!338 = !DILocation(line: 56, column: 53, scope: !112)
!339 = !DILocation(line: 56, column: 70, scope: !112)
!340 = !DILocation(line: 56, column: 23, scope: !112)
!341 = !DILocation(line: 57, column: 1, scope: !112)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !150, file: !1, line: 143, type: !141)
!343 = !DILocation(line: 143, column: 28, scope: !150)
!344 = !DILocation(line: 145, column: 16, scope: !345)
!345 = distinct !DILexicalBlock(scope: !150, file: !1, line: 145, column: 8)
!346 = !DILocation(line: 145, column: 22, scope: !345)
!347 = !DILocation(line: 145, column: 38, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !1, line: 145, column: 28)
!349 = !DILocation(line: 145, column: 8, scope: !150)
!350 = !DILocation(line: 145, column: 44, scope: !348)
!351 = !DILocation(line: 145, column: 63, scope: !348)
!352 = !DILocation(line: 146, column: 22, scope: !150)
!353 = !DILocation(line: 146, column: 21, scope: !150)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !150, file: !1, line: 146, type: !6)
!355 = !DILocation(line: 146, column: 12, scope: !150)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldRayDir", scope: !150, file: !1, line: 147, type: !6)
!357 = !DILocation(line: 147, column: 12, scope: !150)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newRayDir", scope: !150, file: !1, line: 148, type: !6)
!359 = !DILocation(line: 148, column: 12, scope: !150)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "matIndex", arg: 5, scope: !137, file: !1, line: 98, type: !146)
!361 = !DILocation(line: 98, column: 6, scope: !137, inlinedAt: !362)
!362 = distinct !DILocation(line: 149, column: 5, scope: !150)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newRayDir", arg: 4, scope: !137, file: !1, line: 97, type: !6)
!364 = !DILocation(line: 97, column: 11, scope: !137, inlinedAt: !362)
!365 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldRayDir", arg: 3, scope: !137, file: !1, line: 96, type: !6)
!366 = !DILocation(line: 96, column: 11, scope: !137, inlinedAt: !362)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "normal", arg: 2, scope: !137, file: !1, line: 95, type: !6)
!368 = !DILocation(line: 95, column: 11, scope: !137, inlinedAt: !362)
!369 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !137, file: !1, line: 94, type: !141)
!370 = !DILocation(line: 94, column: 18, scope: !137, inlinedAt: !362)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mat", scope: !137, file: !1, line: 103, type: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !142, line: 47, size: 384, align: 32, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !372, file: !142, line: 72, baseType: !6, size: 96, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !372, file: !142, line: 73, baseType: !5, size: 32, align: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !372, file: !142, line: 74, baseType: !6, size: 96, align: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !372, file: !142, line: 75, baseType: !5, size: 32, align: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !372, file: !142, line: 76, baseType: !5, size: 32, align: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "metal", scope: !372, file: !142, line: 77, baseType: !5, size: 32, align: 32, offset: 288)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "smooth", scope: !372, file: !142, line: 78, baseType: !5, size: 32, align: 32, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "indicator", scope: !372, file: !142, line: 79, baseType: !146, size: 32, align: 32, offset: 352)
!382 = !DIExpression(DW_OP_bit_piece, 0, 96)
!383 = !DILocation(line: 103, column: 14, scope: !137, inlinedAt: !362)
!384 = !DIExpression(DW_OP_bit_piece, 96, 32)
!385 = !DIExpression(DW_OP_bit_piece, 128, 96)
!386 = !DIExpression(DW_OP_bit_piece, 224, 32)
!387 = !DIExpression(DW_OP_bit_piece, 256, 32)
!388 = !DIExpression(DW_OP_bit_piece, 288, 32)
!389 = !DIExpression(DW_OP_bit_piece, 320, 32)
!390 = !DIExpression(DW_OP_bit_piece, 352, 32)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "F0a", scope: !137, file: !1, line: 114, type: !6)
!392 = !DILocation(line: 114, column: 12, scope: !137, inlinedAt: !362)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "F0", scope: !137, file: !1, line: 119, type: !6)
!394 = !DILocation(line: 119, column: 12, scope: !137, inlinedAt: !362)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kS", arg: 6, scope: !106, file: !87, line: 73, type: !6)
!396 = !DILocation(line: 73, column: 15, scope: !106, inlinedAt: !397)
!397 = distinct !DILocation(line: 123, column: 21, scope: !137, inlinedAt: !362)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kS", scope: !137, file: !1, line: 122, type: !6)
!399 = !DILocation(line: 122, column: 12, scope: !137, inlinedAt: !362)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "F0", arg: 5, scope: !106, file: !87, line: 72, type: !109)
!401 = !DILocation(line: 72, column: 15, scope: !106, inlinedAt: !397)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prevIOR", arg: 4, scope: !106, file: !87, line: 71, type: !5)
!403 = !DILocation(line: 71, column: 8, scope: !106, inlinedAt: !397)
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "normal", arg: 3, scope: !106, file: !87, line: 69, type: !6)
!405 = !DILocation(line: 69, column: 12, scope: !106, inlinedAt: !397)
!406 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newRayDir", arg: 2, scope: !106, file: !87, line: 68, type: !6)
!407 = !DILocation(line: 68, column: 12, scope: !106, inlinedAt: !397)
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldRayDir", arg: 1, scope: !106, file: !87, line: 67, type: !6)
!409 = !DILocation(line: 67, column: 12, scope: !106, inlinedAt: !397)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "roughness", scope: !106, file: !87, line: 79, type: !5)
!411 = !DILocation(line: 79, column: 11, scope: !106, inlinedAt: !397)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vi", scope: !106, file: !87, line: 82, type: !6)
!413 = !DILocation(line: 82, column: 12, scope: !106, inlinedAt: !397)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vo", scope: !106, file: !87, line: 83, type: !6)
!415 = !DILocation(line: 83, column: 12, scope: !106, inlinedAt: !397)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vn", scope: !106, file: !87, line: 85, type: !6)
!417 = !DILocation(line: 85, column: 12, scope: !106, inlinedAt: !397)
!418 = !DILocation(line: 94, column: 30, scope: !106, inlinedAt: !397)
!419 = !DILocation(line: 94, column: 17, scope: !106, inlinedAt: !397)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vh", scope: !106, file: !87, line: 94, type: !6)
!421 = !DILocation(line: 94, column: 12, scope: !106, inlinedAt: !397)
!422 = !DILocation(line: 97, column: 17, scope: !106, inlinedAt: !397)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndi", scope: !106, file: !87, line: 97, type: !5)
!424 = !DILocation(line: 97, column: 11, scope: !106, inlinedAt: !397)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cosT", scope: !106, file: !87, line: 99, type: !5)
!426 = !DILocation(line: 99, column: 11, scope: !106, inlinedAt: !397)
!427 = !DILocation(line: 100, column: 32, scope: !106, inlinedAt: !397)
!428 = !DILocation(line: 100, column: 25, scope: !106, inlinedAt: !397)
